[
  {
    "query": "Who is the mother of the director of film Polish-Russian War (Film)?",
    "gold_answer": "Małgorzata Braunek",
    "generated_answer": "Maria Strzelecka",
    "retrieved_passages": [
      "Mieczysław Krawicz\nMieczysław Krawicz( 1893–1944) was a Polish film director from Warsaw.",
      "Polish-Russian War (film)\nPolish-Russian War\n(Wojna polsko-ruska) is a 2009 Polish film directed by Xawery Żuławski based on the novel Polish-Russian War under the white-red flag by Dorota Masłowska.",
      "Xawery Żuławski\nXawery Żuławski (born 22 December 1971 in Warsaw) is a Polish film director.\nIn 1995 he graduated National Film School in Łódź.\nHe is the son of actress Małgorzata Braunek and director Andrzej Żuławski.\nHis second feature \"Wojna polsko-ruska\" (2009), adapted from the controversial best-selling novel by Dorota Masłowska, won First Prize in the New Polish Films competition at the 9th Era New Horizons Film Festival in Wrocław.\nIn 2013, he stated he intends to direct a Polish novel \"Zły\" by Leopold Tyrmand.\nŻuławski and his wife Maria Strzelecka had 2 children together:\nson Kaj Żuławski (born 2002) and daughter Jagna Żuławska (born 2009).",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Peter Levin\nPeter Levin is an American director of film, television and theatre.",
      "Peter Levin\nPeter Levin is an American director of film, television and theatre.",
      "Peter Levin\nPeter Levin is an American director of film, television and theatre.",
      "Peter Levin\nPeter Levin is an American director of film, television and theatre."
    ],
    "gold_passages": [
      "Xawery Żuławski\nXawery Żuławski (born 22 December 1971 in Warsaw) is a Polish film director.\nIn 1995 he graduated National Film School in Łódź.\nHe is the son of actress Małgorzata Braunek and director Andrzej Żuławski.\nHis second feature \"Wojna polsko-ruska\" (2009), adapted from the controversial best-selling novel by Dorota Masłowska, won First Prize in the New Polish Films competition at the 9th Era New Horizons Film Festival in Wrocław.\nIn 2013, he stated he intends to direct a Polish novel \"Zły\" by Leopold Tyrmand.\nŻuławski and his wife Maria Strzelecka had 2 children together:\nson Kaj Żuławski (born 2002) and daughter Jagna Żuławska (born 2009).",
      "Polish-Russian War (film)\nPolish-Russian War\n(Wojna polsko-ruska) is a 2009 Polish film directed by Xawery Żuławski based on the novel Polish-Russian War under the white-red flag by Dorota Masłowska."
    ]
  },
  {
    "query": "Which film came out first, Blind Shaft or The Mask Of Fu Manchu?",
    "gold_answer": "The Mask Of Fu Manchu",
    "generated_answer": "Blind Shaft",
    "retrieved_passages": [
      "The Mask of Fu Manchu\nThe Mask of Fu Manchu is a 1932 pre-Code adventure film directed by Charles Brabin.\nIt was written by Irene Kuhn, Edgar Allan Woolf and John Willard based on the 1932 novel of the same name by Sax Rohmer.\nStarring Boris Karloff as Fu Manchu, and featuring Myrna Loy as his depraved daughter, the movie revolves around Fu Manchu's quest for the golden sword and mask of Genghis Khan.\nLewis Stone plays his nemesis.\nDr. Petrie is absent from this film.",
      "The Mysterious Dr. Fu Manchu\nThe Mysterious Dr. Fu Manchu is a 1929 American pre-Code drama film directed by Rowland V. Lee and starring Warner Oland as Dr. Fu Manchu.\nIt was the first Fu Manchu film of the talkie era.\nSince this was during the transition period to sound, a silent version was also released in the United States.",
      "The Castle of Fu Manchu\nThe Castle of Fu Manchu( also known as The Torture Chamber of Dr. Fu Manchu and also known by its German title Die Folterkammer des Dr. Fu Man Chu) is a 1969 film and the fifth and final Dr. Fu Manchu film with Christopher Lee portraying the title character.",
      "The Face of Fu Manchu\nThe Face of Fu Manchu is a 1965 thriller film directed by Don Sharp and based on the characters created by Sax Rohmer.\nIt stars Christopher Lee as the eponymous villain, a Chinese criminal mastermind, and Nigel Green as his pursuing rival Nayland Smith, a Scotland Yard detective.\nThe film was a British- West German co-production, and was the first in a five- part series starring Lee and produced by Harry Alan Towers for Constantin Film, the second of which was\" The Brides of Fu Manchu\" released the next year, with the final entry being\" The Castle of Fu Manchu\" in 1969.\nIt was shot in Technicolor and Techniscope, on- location in County Dublin, Ireland.",
      "The Blood of Fu Manchu\nThe Blood of Fu Manchu, also known as Fu Manchu and the Kiss of Death, Kiss of Death, Kiss and Kill( U.S. title) and Against All Odds( original U.S. video title), is a 1968 British adventure crime film directed by Jesús Franco, based on the fictional Asian villain Dr. Fu Manchu created by Sax Rohmer.\nIt was the fourth film in a series, and was preceded by\" The Vengeance of Fu Manchu The Castle of Fu Manchu\" followed in 1969.\nIt was produced by Harry Alan Towers for Udastex Films.\nIt starred Christopher Lee as Dr. Fu Manchu, Richard Greene as Scotland Yard detective Nayland Smith, and Howard Marion- Crawford as Dr. Petrie.\nThe movie was filmed in Spain and Brazil.\nShirley Eaton appears in a scene that she claimed she was never paid for; apparently, the director Jesús Franco had inserted some stock footage of her from one of her films(\" The Girl from Rio\"( 1968)) into the film without telling her.\nShe only found out years later that she had been in a Fu Manchu film.",
      "The Return of Dr. Fu Manchu\nThe Return of Dr. Fu Manchu is a 1930 American pre-Code film directed by Rowland V. Lee.\nIt is the second of three films starring Warner Oland as the fiendish Fu Manchu, who returns from apparent death in the previous film,\" The Mysterious Dr. Fu Manchu\"( 1929), to seek revenge on those he holds responsible for the death of his wife and child.",
      "Blind Shaft\nBlind Shaft is a 2003 film about a pair of brutal con artists operating in the illegal coal mines of present- day northern China.\nThe film was written and directed by Li Yang( 李杨), and is based on Chinese writer Liu Qingbang's short novel\" Shen MuSacred Wood\").",
      "Les Trottoirs de Bangkok\nLes Trottoirs de Bangkok( English:\" The Sidewalks of Bangkok\", also known as\" Bangkok Interdit\") is a 1984 erotic thriller film directed by Jean Rollin.\nThe film was inspired by the 1932 Boris Karloff classic\" The Mask of Fu Manchu\".\nIn contrast to Rollin's usual themes of vampires, dream- like atmosphere and crumbling châteaus,\" Les Trottoirs des Bangkok\" mixes themes of adventure, crime and mystery with comic book dialogue, while still featuring naked women and sex, which his films were known for.",
      "The Brides of Fu Manchu\nThe Brides of Fu Manchu is a 1966 British/ West German Constantin Film co-production adventure crime film based on the fictional Chinese villain Dr. Fu Manchu, created by Sax Rohmer.\nIt was the second film in a series, and was preceded by\" The Face of Fu ManchuThe Vengeance of Fu Manchu\" followed in 1967,\" The Blood of Fu Manchu\" in 1968, and\" The Castle of Fu Manchu\" in 1969.\nIt was produced by Harry Alan Towers for Hallam Productions.\nLike the first film, it was directed by Don Sharp, and starred Christopher Lee as Fu Manchu.\nNigel Green was replaced by Douglas Wilmer as Scotland Yard detective Nayland Smith.\nThe action takes place mainly in London, where much of the location filming took place.",
      "The Mask of the Gorilla\nThe Mask of the Gorilla is a 1958 French action film directed by Bernard Borderie."
    ],
    "gold_passages": [
      "The Mask of Fu Manchu\nThe Mask of Fu Manchu is a 1932 pre-Code adventure film directed by Charles Brabin.\nIt was written by Irene Kuhn, Edgar Allan Woolf and John Willard based on the 1932 novel of the same name by Sax Rohmer.\nStarring Boris Karloff as Fu Manchu, and featuring Myrna Loy as his depraved daughter, the movie revolves around Fu Manchu's quest for the golden sword and mask of Genghis Khan.\nLewis Stone plays his nemesis.\nDr. Petrie is absent from this film.",
      "Blind Shaft\nBlind Shaft is a 2003 film about a pair of brutal con artists operating in the illegal coal mines of present- day northern China.\nThe film was written and directed by Li Yang( 李杨), and is based on Chinese writer Liu Qingbang's short novel\" Shen MuSacred Wood\")."
    ]
  },
  {
    "query": "When did John V, Prince Of Anhalt-Zerbst's father die?",
    "gold_answer": "12 June 1516",
    "generated_answer": "4 February 1551",
    "retrieved_passages": [
      "John VI, Prince of Anhalt-Zerbst\nJohn VI of Anhalt-Zerbst (Zerbst, 24 March 1621 – Zerbst, 4 July 1667), was a German prince of the House of Ascania and ruler of the principality of Anhalt-Zerbst.\nHe was the only son of Rudolph, Prince of Anhalt-Zerbst, by his second wife Magdalene, daughter of John VII, Count of Oldenburg.",
      "John II, Prince of Anhalt-Zerbst\nJohn II, Prince of Anhalt- Zerbst( died 11 April 1382) was a German prince of the House of Ascania and ruler of the principality of Anhalt- Zerbst.\nHe was the youngest son of Albert II, Prince of Anhalt- Zerbst, by his second wife Beatrix, daughter of Rudolf I, Elector of Saxony and Duke of Saxe- Wittemberg.",
      "John V, Prince of Anhalt-Zerbst\nJohn V of Anhalt-Zerbst (Dessau, 4 September 1504 – Zerbst, 4 February 1551), was a German prince of the House of Ascania and ruler of the principality of Anhalt-Dessau.\nFrom 1544, he assumed rule of the re-created principality of Anhalt-Zerbst.\nJohn was the second (but eldest surviving) son of Ernest I, Prince of Anhalt-Dessau, by his wife Margarete, daughter of Henry I, Duke of Münsterberg-Oels, and granddaughter of George of Poděbrady, King of Bohemia.",
      "Karl I, Prince of Anhalt-Zerbst\nKarl I of Anhalt- Zerbst( 17 November 1534 in Dessau – 4 May 1561 in Zerbst), was a German prince of the House of Ascania and ruler of the principality of Anhalt- Zerbst.\nHe was the eldest son of John V, Prince of Anhalt- Zerbst, by his wife Margaret, daughter of Joachim I Nestor, Elector of Brandenburg.",
      "Bernhard VII, Prince of Anhalt-Zerbst\nBernhard VII of Anhalt- Zerbst( 17 March 1540 – 1 March 1570), was a German prince of the House of Ascania and ruler of the principality of Anhalt- Zerbst.\nHe was born and died in Dessau, and was the third and youngest son of John V, Prince of Anhalt- Zerbst by his wife Margaret, daughter of Joachim I Nestor, Elector of Brandenburg.",
      "Waldemar III, Prince of Anhalt-Zerbst\nWaldemar III, Prince of Anhalt- Zerbst( died 1391) was a German prince of the House of Ascania and ruler of the principality of Anhalt- Zerbst.\nHe was the youngest son of John II, Prince of Anhalt- Zerbst, by his wife Elisabeth, daughter of John I, Count of Henneberg- Schleusingen.",
      "Albert III, Prince of Anhalt-Zerbst\nAlbert III, Prince of Anhalt- Zerbst( died ca. 1 August 1359) was a German prince of the House of Ascania and ruler of the principality of Anhalt- Zerbst.\nHe was the eldest son of Albert II, Prince of Anhalt- Zerbst, by his second wife Beatrix, daughter of Rudolf I, Elector of Saxony and Duke of Saxe- Wittemberg.",
      "Albert II, Prince of Anhalt-Zerbst\nAlbert II, Prince of Anhalt- Zerbst( died 17 July 1362) was a German prince of the House of Ascania and ruler of the principality of Anhalt- Zerbst.\nHe was the third son of Albert I, Prince of Anhalt- Zerbst, but the eldest child born to his second wife Agnes, daughter of Conrad, Margrave of Brandenburg- Stendal.",
      "Waldemar I, Prince of Anhalt-Zerbst\nWaldemar I, Prince of Anhalt- Zerbst( died 7 January 1368) was a German prince of the House of Ascania and ruler of the principality of Anhalt- Zerbst.\nHe was the youngest son of Albert I, Prince of Anhalt- Zerbst, by his second wife Agnes, daughter of Conrad, Margrave of Brandenburg- Stendal.",
      "Ernest I, Prince of Anhalt-Dessau\nErnest I, Prince of Anhalt-Dessau (died Dessau, 12 June 1516), was a German prince of the House of Ascania and ruler of the principality of Anhalt-Dessau.\nHe was the second son of George I, Prince of Anhalt-Dessau, yet the first born by his fourth wife Anna, daughter of Albert VIII, Count of Lindow-Ruppin."
    ],
    "gold_passages": [
      "Ernest I, Prince of Anhalt-Dessau\nErnest I, Prince of Anhalt-Dessau (died Dessau, 12 June 1516), was a German prince of the House of Ascania and ruler of the principality of Anhalt-Dessau.\nHe was the second son of George I, Prince of Anhalt-Dessau, yet the first born by his fourth wife Anna, daughter of Albert VIII, Count of Lindow-Ruppin.",
      "John V, Prince of Anhalt-Zerbst\nJohn V of Anhalt-Zerbst (Dessau, 4 September 1504 – Zerbst, 4 February 1551), was a German prince of the House of Ascania and ruler of the principality of Anhalt-Dessau.\nFrom 1544, he assumed rule of the re-created principality of Anhalt-Zerbst.\nJohn was the second (but eldest surviving) son of Ernest I, Prince of Anhalt-Dessau, by his wife Margarete, daughter of Henry I, Duke of Münsterberg-Oels, and granddaughter of George of Poděbrady, King of Bohemia."
    ]
  },
  {
    "query": "What is the award that the director of film Wearing Velvet Slippers Under A Golden Umbrella won?",
    "gold_answer": "Myanmar Motion Picture Academy Awards",
    "generated_answer": "Katipa phanat see htee hsaung",
    "retrieved_passages": [
      "Wearing Velvet Slippers under a Golden Umbrella\nWearing Velvet Slippers under a Golden Umbrella (Pronounced as Katipa phanat see shwe htee hsaung) is a 1970 Burmese film directed by Maung Wunna starring Myat Mon, Myat Lay and Thet Naung.\nThe film was Maung Wunna's first feature as director and he also wrote the screenplay, based on the novel of the same name by Maung Thara.",
      "G. Marthandan\nG. Marthandan is an Indian film director who works in Malayalam cinema.",
      "Peter Levin\nPeter Levin is an American director of film, television and theatre.",
      "Peter Levin\nPeter Levin is an American director of film, television and theatre.",
      "Peter Levin\nPeter Levin is an American director of film, television and theatre.",
      "Peter Levin\nPeter Levin is an American director of film, television and theatre.",
      "Peter Levin\nPeter Levin is an American director of film, television and theatre.",
      "Wunna\nMaung Wunna  was a two-time Myanmar Motion Picture Academy Awards-winning Burmese director and writer.\nHe came from a family heavily involved in the entertainment industry—his father Thadu was a director and his brother Thu Maung was a prominent singer and actor and Min Lu was a reputed satirist.\nMaung Wunna died of lung cancer in 2011.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris."
    ],
    "gold_passages": [
      "Wunna\nMaung Wunna  was a two-time Myanmar Motion Picture Academy Awards-winning Burmese director and writer.\nHe came from a family heavily involved in the entertainment industry—his father Thadu was a director and his brother Thu Maung was a prominent singer and actor and Min Lu was a reputed satirist.\nMaung Wunna died of lung cancer in 2011.",
      "Wearing Velvet Slippers under a Golden Umbrella\nWearing Velvet Slippers under a Golden Umbrella (Pronounced as Katipa phanat see shwe htee hsaung) is a 1970 Burmese film directed by Maung Wunna starring Myat Mon, Myat Lay and Thet Naung.\nThe film was Maung Wunna's first feature as director and he also wrote the screenplay, based on the novel of the same name by Maung Thara."
    ]
  },
  {
    "query": "Where was the director of film Ronnie Rocket born?",
    "gold_answer": "Missoula, Montana",
    "generated_answer": "Bern, Switzerland",
    "retrieved_passages": [
      "Fred Roy Krug\nFred R. Krug is an American film and television producer- director born in Bern, Switzerland.",
      "Ronnie Rocket\nRonnie Rocket is an unfinished film project written by David Lynch, who also intended to direct it.\nBegun after the success of Lynch's 1977 film \"EraserheadRonnie Rocket\" was shelved after Lynch felt he would be unable to find financial backing for the project.\nHe instead sought out an existing script on which to base his next film, settling on what would become 1980's \"The Elephant Man\".\n\"Ronnie Rocket\" was to feature many of the elements which have since come to be seen as Lynch's hallmarks; including industrial art direction, 1950s popular culture and physical deformity.\nThe script featured a three-foot tall man with control over electricity; Lynch first met Michael J. Anderson when tentatively casting for this role, and later cast him in \"Twin Peaks\" and \"Mulholland Drive\" as a result.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Hanro Smitsman\nHanro Smitsman, born in 1967 in Breda( Netherlands), is a writer and director of film and television.",
      "Lew Landers\nLew Landers( born Louis Friedlander, January 2, 1901 – December 16, 1962) was an American independent film and television director.",
      "Rachel Feldman\nRachel Feldman( born August 22, 1954) is an American director of film and television and screenwriter of television films.",
      "Hassan Zee\nHassan Zee is a Pakistani- American film director who was born in Chakwal, Pakistan.",
      "Mieczysław Krawicz\nMieczysław Krawicz( 1893–1944) was a Polish film director from Warsaw."
    ],
    "gold_passages": [
      "David Lynch\nDavid Keith Lynch (born January 20, 1946) is an American filmmaker, painter, musician, actor, and photographer.\nHe is best known for films such as \"Eraserhead\" (1977), \"Blue Velvet\" (1986) and \"Mulholland Drive\" (2001), often regarded by critics as among the best films of their respective decades, and for his successful 1990–91 television series \"Twin Peaks\", which led to him being labeled \"the first popular Surrealist\" by noted film critic Pauline Kael.\nA recipient of an Academy Honorary Award in 2019, he has received three Academy Award nominations for Best Director, and has won France's César Award for Best Foreign Film twice, as well as the Palme d'Or at the Cannes Film Festival and a Golden Lion award for lifetime achievement at the Venice Film Festival.\nHe has been described by \"The Guardian\" as \"the most important director of this era\", while AllMovie called him \"the Renaissance man of modern American filmmaking\".\nBorn to a middle-class family in Missoula, Montana, Lynch spent his childhood traveling around the United States before he studied painting at the Pennsylvania Academy of Fine Arts in Philadelphia, where he first made the transition to producing short films.\nHe moved to Los Angeles, where he produced his first motion picture, the surrealist horror film \"Eraserhead\" (1977).\nAfter \"Eraserhead\" became a success on the midnight movie circuit, Lynch was employed to direct the biographical film \"The Elephant Man\" (1980), from which he gained mainstream success.\nHe was then employed by the De Laurentiis Entertainment Group and proceeded to make two films: the science-fiction epic \"Dune\" (1984), which proved to be a critical and commercial failure, and then a neo-noir mystery film \"Blue Velvet\" (1986), which stirred controversy over its violence but later grew in critical reputation.\nNext, Lynch created his own television series with Mark Frost, the popular murder mystery entitled \"Twin Peaks\" (1990–1991).\nHe also created a cinematic prequel,  (1992), a road film \"Wild at Heart\" (1990) and a family film \"The Straight Story\" (1999) in the same period.\nTurning further towards surrealist filmmaking, three of his subsequent films operated on dream logic non-linear narrative structures: \"Lost Highway\" (1997), \"Mulholland Drive\" (2001), and \"Inland Empire\" (2006).\nMeanwhile, Lynch embraced the Internet as a medium, producing several web-based shows, such as the animated \"DumbLand\" (2002) and the surreal sitcom \"Rabbits\" (2002).\nLynch and Frost reunited for a third season of \"Twin Peaks\", airing in on Showtime in 2017.\nLynch co-wrote and directed every episode, as well as reprising his role as Gordon Cole.\nLynch's other artistic endeavours include: his work as a musician, encompassing three studio albums—\"BlueBOB\" (2001), \"Crazy Clown Time\" (2011) and \"The Big Dream\" (\n2013)—as well as music and sound design for a variety of his films; painting and photography; writing three books—\"Images\" (1994), \"Catching the Big Fish\" (2006), and \"Room to Dream\" (2018); and directing several music videos and advertisements, including the Dior promotional film \"Lady Blue Shanghai\" (2006).\nAn avid practitioner of Transcendental Meditation (TM), Lynch founded the David Lynch Foundation in 2005, which sought to fund the teaching of TM in schools and has since widened its scope to other at-risk populations, including the homeless, veterans and refugees.\nIn 2019, he received an Academy Honorary Award; his first Oscar win.",
      "Ronnie Rocket\nRonnie Rocket is an unfinished film project written by David Lynch, who also intended to direct it.\nBegun after the success of Lynch's 1977 film \"EraserheadRonnie Rocket\" was shelved after Lynch felt he would be unable to find financial backing for the project.\nHe instead sought out an existing script on which to base his next film, settling on what would become 1980's \"The Elephant Man\".\n\"Ronnie Rocket\" was to feature many of the elements which have since come to be seen as Lynch's hallmarks; including industrial art direction, 1950s popular culture and physical deformity.\nThe script featured a three-foot tall man with control over electricity; Lynch first met Michael J. Anderson when tentatively casting for this role, and later cast him in \"Twin Peaks\" and \"Mulholland Drive\" as a result."
    ]
  },
  {
    "query": "Who is Charles Bretagne Marie De La Trémoille's paternal grandfather?",
    "gold_answer": "Charles Armand René de La Trémoille",
    "generated_answer": "Prince Jean-Bretagne-Charles de La Trémoille",
    "retrieved_passages": [
      "Jean Bretagne Charles de La Trémoille\nPrince Jean-Bretagne-Charles de La Trémoille (5 February 1737 – 19 May 1792), 7th Duke of Thouars, was a French soldier and the son of Charles Armand René de La Trémoille and his wife, Marie Hortense de La Tour d'Auvergne of Bouillon.",
      "Charles Bretagne Marie de La Trémoille\nPrince Charles Bretagne Marie de La Trémoille (24 March 1764 – 10 November 1839), 8th Duke of Thouars, 7th Duke of La Trémoïlle, 10th prince de Tarente, 14th prince de Talmond and 14th Count of Laval, was a French aristocrat and soldier; he was the son of Jean Bretagne Charles de La Trémoille and his wife Princess Marie-Maximilienne of Salm-Kyrburg.",
      "Louis Charles de La Trémoille\nPrince Louis Charles de La Trémoille( 26 October 1838 – 4 July 1911), 9th Duke of Thouars, 8th Duke of La Trémoïlle, 11th prince de Tarente, 15th prince de Talmond and 15th Count of Laval was a French aristocrat and the son of Charles Bretagne Marie de La Trémoille and his third wife, Valentine Eugénie Joséphine Walsh de Serrant.\nLouis Charles was also an archivist, bibliophile and also collector.",
      "Henri de La Trémoille\nHenri de La Trémoille( 22 December 1598 – 21 January 1674) was the 3rd Duke of Thouars, 2nd Duke of La Tremoille, and Prince of Talmond and Taranto.\nHe was the son of Claude de La Trémoille and his wife, Charlotte Brabantina of Nassau, and a descendant of the medieval general Louis de La Trémoille.",
      "Charles Armand René de La Trémoille\nCharles Armand René de La Trémoille (14 January 1708, in Paris – 23 May 1741),\n6th duc de Thouars, was the son of Charles Louis Bretagne de La Trémoille and his wife, Marie Madeleine Motier de la Fayette.\nLa Trémoille was a French soldier and president of the States of Brittany.\nHe joined the military at a young age and became a colonel of the Champagne regiment at the age of eighteen.\nLater, he became governor of Île-de-France.\nHe distinguished himself in the battle of Guastalla, in Italy, and was named shortly thereafter sergeant of the armies of the king.\nLa Trémoille was the author of some works and was elected a member of the Académie française on 13 February 1738.\nOn 29 January 1725 he married his cousin Marie Hortense de La Tour d'Auvergne, the daughter of Marie Armande Victoire de la Trémoïlle (1677–1717) and Emmanuel-Théodose de La Tour d'Auvergne, duc de Bouillon (1668–1730).\nMarie Hortense, like her husband was a granddaughter of Charles Belgique Hollande de La Trémoille.\nFrom this union was born a son:\nJean Bretagne Charles de La Trémoille and a daughter who died in infancy.",
      "Marie Charlotte de La Trémoille\nMarie Charlotte de La Trémoille( 26 January 1632 – 24 August 1682). was a French noblewoman member of the House of La Trémoille and by marriage Duchess of Saxe- Jena.\nBorn in Thouars, she was the fifth of six children born from the marriage of Henri III de La Trémoille, 3rd Duke of Thouars, 2nd Duke of La Tremoille, Prince of Talmond and Taranto, and Marie de La Tour d'Auvergne.",
      "Guillaume Wittouck\nGuillaume Wittouck( 1749- 1829) was a Belgian lawyer and High Magistrate.\nHe was the Grandfather of industrialist Paul Wittouck.",
      "François II de La Trémoille\nFrançois de La Trémoille( 1505 – 1541) was a French nobleman of the La Tremoille family.\nHe was the son of Charles I de la Trémoille( killed in 1515 at the battle of Marignano) and of Louise de Coëtivy.",
      "Louis d'Orléans, Prince of Condé\n\"Louis\" Philippe Marie Léopold d'Orléans (15 November 1845 – 24 May 1866) was a member of the House of Orléans and held the title of Prince of Condé.\nHe was the first member of a royal house to visit the Australian continent.",
      "Charlotte de La Trémoille\n\" Not to be confused with Charlotte Stanley, Countess of Derby.\"\nPrincess Charlotte de La Trémoille( Charlotte Marie Clotilde de La Trémoille; 20 November 1892 – 27 October 1971), 12th Duchess of Thouars, 11th Duchess of La Trémoïlle, 14th Princess de Tarente, 18th princess de Talmond and 18th Countess of Laval was a French noblewoman and the daughter of Prince Louis Charles Marie de La Trémoille and his wife, Hélène Marie Léonie Pillet- Will."
    ],
    "gold_passages": [
      "Charles Bretagne Marie de La Trémoille\nPrince Charles Bretagne Marie de La Trémoille (24 March 1764 – 10 November 1839), 8th Duke of Thouars, 7th Duke of La Trémoïlle, 10th prince de Tarente, 14th prince de Talmond and 14th Count of Laval, was a French aristocrat and soldier; he was the son of Jean Bretagne Charles de La Trémoille and his wife Princess Marie-Maximilienne of Salm-Kyrburg.",
      "Jean Bretagne Charles de La Trémoille\nPrince Jean-Bretagne-Charles de La Trémoille (5 February 1737 – 19 May 1792), 7th Duke of Thouars, was a French soldier and the son of Charles Armand René de La Trémoille and his wife, Marie Hortense de La Tour d'Auvergne of Bouillon."
    ]
  },
  {
    "query": "Where was the father of Ștefan I. Nenițescu born?",
    "gold_answer": "Galați",
    "generated_answer": "Galați",
    "retrieved_passages": [
      "Ioan S. Nenițescu\nIoan S. Nenițescu (April 11, 1854–February 23, 1901) was a Romanian poet and playwright.\nBorn in Galați, his parents were Ștefan Vasiliu, a manual laborer, and his wife Elisabeta (\"née\" Zaharia).\nAfter completing the Alexandru Ioan\nI commercial school in his native town\n, he finished high school, passing the exit examination at Iași.\nHe also audited courses at Iași University's literature faculty.\nNenițescu attended an officers' school, volunteered in the Romanian War of Independence and was wounded at Grivitsa.\nHe then studied at the philosophy faculty of Berlin University, taking a doctorate in 1887 at Leipzig University with a thesis on Baruch Spinoza.\nHe worked as a schoolteacher and inspector in Bucharest.\nHe traveled south of the Danube, a trip that resulted in an ample \"ethnic and statistical study of the AromaniansDe la românii din Turcia Europeană\", 1895).\nHe sat in the Assembly of Deputies for his native Covurlui County, and also served as prefect of Tulcea County in the Dobruja region.\nNenițescu's first work appeared in the Galați newspaper \"Gardistul civic\".\nA member of \"Junimea\", he published numerous poems in its organ \"Convorbiri Literare\".\nHe also contributed to \"AlbinaAmicul copiilorRevista nouăRomânul literarȘezătoarea\" and \"Ziarul presei\".\nWhile in Bucharest from 1884 to 1888, he published \"Țara nouă\" magazine, mainly submitting articles on pedagogy, ethics and sociology.\nHis first book was the 1880 poetry volume \"Flori de primăvară\", followed by \"Șoimii de la Războieni\" (1882) and \"Pui de lei\" (1891).\nOf the plays he wrote, the only one he published was \"Radu de la Afumați\" (1897).\nIn 1896, Nenițescu was elected a corresponding member of the Romanian Academy.\nHe died in Buzău.\nHis son Ștefan also became a poet.",
      "Ștefan I. Nenițescu\nȘtefan I. Nenițescu (October 8, 1897–October 1979) was a Romanian poet and aesthetician.\nBorn in Bucharest, his parents were the poet Ioan S. Nenițescu and his wife Elena (\"née\" Ștefan).\nHe attended Sapienza University of Rome from 1920, as well as the literature and philosophy department of Bucharest University.\nAt first an assistant professor of aesthetics, he later became an associate professor at Bucharest.\nHe served as press secretary and later economic adviser to the Romanian legation in The Hague.\nNenițescu's first publication was a 1915 article about William Shakespeare that appeared in \"Noua revistă română\".\nHis first book of poetry, \"Denii\" (1919), was followed by \"Vrajă\" (1923) and \"Ode italice\" (1925).\nHis single volume of theatre was \"Trei mistere\" (1922).\nFrom 1924, he wrote for \"Gândirea\", and was a founding member of Romania's PEN Club.\nHe also contributed poetry and art criticism to \"Convorbiri LiterareIdeea europeanăVremeaUniversul literarViața RomâneascăAdevărul\" and \"Arta plastică\".\nIn 1925, Nenițescu published a treatise, \"Istoria artei ca filosofie a istoriei\".\nHe translated from Benedetto Croce (\"Aesthetic\", 1922) and Niccolò Machiavelli (\"The Mandrake\", 1926).\nInitially, Nenițescu's poetry was discursive and religious, in line with the \"Gândirist\" current.\nHis verse became progressively more hermetic, as can be seen in the anthology volume\n\"Ani\" (1973).\nIncluding texts published in the 1940s and '50s, it reveals the intellectualized lyric verse of an eminently classical nature.",
      "Dimitrije Nešić\nDimitrije Nešić( 20 October 1836, in Belgrade, Principality of Serbia – 9 May 1904, in Belgrade, Kingdom of Serbia) was a Serbian mathematician, professor at the Lyceum of the Principality of Serbia and president of the Serbian Royal Academy.",
      "Stefan Nemanja\nStefan Nemanja (Serbian Cyrillic: Стефан Немања, ; 1113 – 13 February 1199) was the Grand Prince (Veliki Župan) of the Serbian Grand Principality (also known as Raška, lat. \"\nRascia\") from 1166 to 1196.\nA member of the Vukanović dynasty, Nemanja founded the Nemanjić dynasty, and is remembered for his contributions to Serbian culture and history, founding what would evolve into the Serbian Empire, as well as the national church.\nAccording to the Serbian Academy of Sciences and Arts, Nemanja is also among the most remarkable Serbs for his literary contributions and altruistic attributes.\nIn 1196, after three decades of warfare and negotiations which consolidated Serbia while distinguishing it from both Western and Byzantine spheres of influence, Nemanja abdicated in favor of his middle son Stefan Nemanjić, who became the first King of Serbia.\nNemanja ultimately went to Mount Athos, where he became a monk and took the name of Symeon, joining his youngest son (later known as Saint Sava), who had already become the first archbishop of the Serbian Orthodox Church.\nTogether with his son Sava, Nemanja restored the Hilandar Monastery at Mount Athos from 1198–1199, and issued the \"Charter of Hilandar\".\nThe monastery later became the cradle of the Serbian Orthodox Church.\nThe Serbian Orthodox Church canonized Stefan Nemanja shortly after his death under the name Saint Simeon\nthe Myrrh-streaming (Свети Симеон Мироточиви) after numerous miracles.",
      "Grand Duke Nicholas Konstantinovich of Russia\nGrand Duke Nicholas Constantinovich of Russia( 14 February 1850 – 26 January 1918) was the first- born son of Grand Duke Konstantin Nikolayevich and Grand Duchess Alexandra Iosifovna of Russia and a grandson of Nicholas I of Russia.",
      "Nikolaus, Hereditary Grand Duke of Oldenburg\nNikolaus, Hereditary Grand Duke of Oldenburg( 10 August 18973 April 1970) was the eldest son of Frederick Augustus II, Grand Duke of Oldenburg, who was the last ruling Grand Duke of Oldenburg.\nIn 1931, Nikolaus succeeded to his father's titles and assumed the role of pretender to the Grand Duchy, until his death in 1970.",
      "Catherine of Pomerania, Countess Palatine of Neumarkt\nCatherine of Pomerania\n(German: \"\nKatharina von Pommern\"; c. 1390 - 4 March 1426), was a Pomeranian princess and Countess Palatine of Neumarkt.\nShe was the wife of John, Count Palatine of Neumarkt and the mother of Christopher of Bavaria, who would rule over Denmark, Sweden, and Norway as king of the Kalmar Union.",
      "Anastasia of Serbia\nAna ; 1196–d.\nJune 22, 1200) was the princess consort of the Serbian Principality as the wife of Stefan Nemanja (r. 1166–1196).\nShe was of noble descent.\nAna took monastic vows in 1196 and was baptized \"Anastasia\", after Anastasia of Sirmium.\nShe is venerated by the Serbian Orthodox Church as Saint Anastasija (Света Анастасија) with her feast day on June 22 (Julian calendar).",
      "Prince Nikolaus Wilhelm of Nassau\nPrince Nikolaus Wilhelm of Nassau (20 September 1832 – 17 September 1905), was the only son of William, Duke of Nassau by his second wife Princess Pauline of Württemberg.",
      "Abdul-Vahed Niyazov\n' of Russia."
    ],
    "gold_passages": [
      "Ștefan I. Nenițescu\nȘtefan I. Nenițescu (October 8, 1897–October 1979) was a Romanian poet and aesthetician.\nBorn in Bucharest, his parents were the poet Ioan S. Nenițescu and his wife Elena (\"née\" Ștefan).\nHe attended Sapienza University of Rome from 1920, as well as the literature and philosophy department of Bucharest University.\nAt first an assistant professor of aesthetics, he later became an associate professor at Bucharest.\nHe served as press secretary and later economic adviser to the Romanian legation in The Hague.\nNenițescu's first publication was a 1915 article about William Shakespeare that appeared in \"Noua revistă română\".\nHis first book of poetry, \"Denii\" (1919), was followed by \"Vrajă\" (1923) and \"Ode italice\" (1925).\nHis single volume of theatre was \"Trei mistere\" (1922).\nFrom 1924, he wrote for \"Gândirea\", and was a founding member of Romania's PEN Club.\nHe also contributed poetry and art criticism to \"Convorbiri LiterareIdeea europeanăVremeaUniversul literarViața RomâneascăAdevărul\" and \"Arta plastică\".\nIn 1925, Nenițescu published a treatise, \"Istoria artei ca filosofie a istoriei\".\nHe translated from Benedetto Croce (\"Aesthetic\", 1922) and Niccolò Machiavelli (\"The Mandrake\", 1926).\nInitially, Nenițescu's poetry was discursive and religious, in line with the \"Gândirist\" current.\nHis verse became progressively more hermetic, as can be seen in the anthology volume\n\"Ani\" (1973).\nIncluding texts published in the 1940s and '50s, it reveals the intellectualized lyric verse of an eminently classical nature.",
      "Ioan S. Nenițescu\nIoan S. Nenițescu (April 11, 1854–February 23, 1901) was a Romanian poet and playwright.\nBorn in Galați, his parents were Ștefan Vasiliu, a manual laborer, and his wife Elisabeta (\"née\" Zaharia).\nAfter completing the Alexandru Ioan\nI commercial school in his native town\n, he finished high school, passing the exit examination at Iași.\nHe also audited courses at Iași University's literature faculty.\nNenițescu attended an officers' school, volunteered in the Romanian War of Independence and was wounded at Grivitsa.\nHe then studied at the philosophy faculty of Berlin University, taking a doctorate in 1887 at Leipzig University with a thesis on Baruch Spinoza.\nHe worked as a schoolteacher and inspector in Bucharest.\nHe traveled south of the Danube, a trip that resulted in an ample \"ethnic and statistical study of the AromaniansDe la românii din Turcia Europeană\", 1895).\nHe sat in the Assembly of Deputies for his native Covurlui County, and also served as prefect of Tulcea County in the Dobruja region.\nNenițescu's first work appeared in the Galați newspaper \"Gardistul civic\".\nA member of \"Junimea\", he published numerous poems in its organ \"Convorbiri Literare\".\nHe also contributed to \"AlbinaAmicul copiilorRevista nouăRomânul literarȘezătoarea\" and \"Ziarul presei\".\nWhile in Bucharest from 1884 to 1888, he published \"Țara nouă\" magazine, mainly submitting articles on pedagogy, ethics and sociology.\nHis first book was the 1880 poetry volume \"Flori de primăvară\", followed by \"Șoimii de la Războieni\" (1882) and \"Pui de lei\" (1891).\nOf the plays he wrote, the only one he published was \"Radu de la Afumați\" (1897).\nIn 1896, Nenițescu was elected a corresponding member of the Romanian Academy.\nHe died in Buzău.\nHis son Ștefan also became a poet."
    ]
  },
  {
    "query": "Are North Marion High School (Oregon) and Seoul High School both located in the same country?",
    "gold_answer": "no",
    "generated_answer": "Oregon",
    "retrieved_passages": [
      "Seoul High School\nSeoul High School( Hangul: 서울고등학교) is a public high school located in the heart of Seoul, South Korea.",
      "North Marion High School (Oregon)\nNorth Marion High School is a public high school in Aurora, Oregon, United States.\nThe school is part of the North Marion School District with all four schools being located on the same campus.\nThe school draws students from the cities of Aurora, Hubbard, and Donald as well as the communities of Broadacres and Butteville.",
      "Marion High School (Kansas)\nMarion High School is a public high school in Marion, Kansas, USA.\nIt is one of three schools operated by Marion USD 408, and is the sole high school in the district.",
      "Marion High School (Indiana)\nMarion High School is a high school in Marion, Indiana with more than 1,000 students.",
      "Creswell High School (Oregon)\nCreswell High School( Oregon) is a public high school in Creswell, Oregon, United States.",
      "East High School (Denver)\nDenver East High School is a public high school located in the City Park neighborhood on the east side of Denver, Colorado, United States.\nIt is part of the Denver Public Schools system, and is one of four original high schools in Denver.\nThe other three are North High School, West High School, and South High School.",
      "DeSales High School (Louisville, Kentucky)\nDeSales High School is a private, Roman Catholic, college- preparatory school for boys in Louisville, Kentucky, United States.\nIt was established in 1956 and is located in the Roman Catholic Archdiocese of Louisville.",
      "John Paul II Catholic High School (Schertz, Texas)\nJohn Paul II High School is a private Roman Catholic college preparatory high school in Schertz, Texas.\nIt is operated by the Roman Catholic Archdiocese of San Antonio.",
      "DeLaSalle High School (Minneapolis)\nDeLaSalle High School is a Catholic, college preparatory high school in Minneapolis, Minnesota.\nIt is located on Nicollet Island.",
      "Nazareth Academy (La Grange Park, Illinois)\nNazareth Academy is a Roman Catholic college- preparatory high school located in LaGrange Park, Illinois, United States, in the Roman Catholic Archdiocese of Chicago.\nIt was founded in 1900 by the Sisters of St. Joseph."
    ],
    "gold_passages": [
      "Seoul High School\nSeoul High School( Hangul: 서울고등학교) is a public high school located in the heart of Seoul, South Korea.",
      "North Marion High School (Oregon)\nNorth Marion High School is a public high school in Aurora, Oregon, United States.\nThe school is part of the North Marion School District with all four schools being located on the same campus.\nThe school draws students from the cities of Aurora, Hubbard, and Donald as well as the communities of Broadacres and Butteville."
    ]
  },
  {
    "query": "Which film has the director who was born later, El Extraño Viaje or Love In Pawn?",
    "gold_answer": "El Extraño Viaje",
    "generated_answer": "Love in Pawn",
    "retrieved_passages": [
      "El extraño viaje\nEl extraño viaje is a 1964 Spanish black drama film directed by Fernando Fernán Gómez.\nFamous film director Jess Franco acts as the brother of the protagonist.\nThe film was a huge flop on its limited release.\nIt was voted seventh best Spanish film by professionals and critics in 1996 Spanish cinema centenary.",
      "A Lover in Pawn\nA Lover in Pawn is a 1920 Swedish silent drama film directed by Victor Sjöström.",
      "Love in Pawn\nLove in Pawn is a 1953 British comedy film directed by Charles Saunders and starring Bernard Braden and Barbara Kelly.",
      "Fernando Fernán Gómez\nFernando Fernández Gómez (28 August 1921 – 21 November 2007) better known as Fernando Fernán-Gómez was a Spanish actor, screenwriter, film director, theater director and member of the Royal Spanish Academy for seven years.\nHe was born in Argentina while his mother, Spanish actress Carola Fernán-Gómez, was making a tour in Latin America.\nHe would later use her surname for his stage name when he moved to Spain in 1924.\nAfter the Spanish Civil War he began to study law but interrupted his studies to work in theater.\nIn 1942 he began to act in movies but also continued working on plays.\nHe formed his own theater company and received awards for directing and writing.\nIn the 1950s he began to direct movies, including the film of his novel, \"El viaje a ninguna parte\".\nHe received praise for his 1958 comedy \"La vida por delante\", which led to a sequel, \"La vida alrededor\".\nIn 1977, he won the Silver Bear for Best Actor at the 27th Berlin International Film Festival for his role in \"The Anchorite\".\nHe won the award again at the 35th Berlin International Film Festival in 1985 for his role in \"Stico\" and finally the Honorary Golden Bear at the 55th Berlin International Film Festival in 2005.\nHaving been very much in demand during the 1970s and 1980s, the 1990s was a less active period for him, but towards the end of his life, he enjoyed something of a revival, featuring in three major projects: \"Todo sobre mi madrePlenilunio\", and a starring role in the hit \"La lengua de las mariposas\".\nHe married María Dolores Pradera in 1945; they divorced in 1959.\nHe married Emma Cohen in 2000.\nFernando Fernán Gómez died in Madrid on 21 November 2007 from a heart failure.\nAs he was a lifelong anarchist, his coffin was covered in a black and red anarchist flag.",
      "Luis Saslavsky\nLuis Saslavsky( April 21, 1903 – March 20, 1995) was an Argentine film director, screenwriter and film producer, and one of the influential directors in the Cinema of Argentina of the classic era.\nHe was Jewish.\nSaskavsky was born in Rosario, Santa Fe, Argentina.\nHe directed and wrote over 40 films between 1931 and 1979.\nHe directed films such as Crimen a las tres in 1935 and wrote for films such as Allá en el Norte in 1973.\nHe retired from the industry in 1979.\nHe died in Buenos Aires, aged 91.",
      "Mieczysław Krawicz\nMieczysław Krawicz( 1893–1944) was a Polish film director from Warsaw.",
      "Giuliano Carnimeo\nGiuliano Carnimeo (4 July 1932 – 10 September 2016) was an Italian director and screenwriter, sometimes credited as Anthony Ascott.",
      "El extraño caso de la mujer asesinada\nEl Extraño caso de la mujer asesinada is a 1949 Argentine film.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris."
    ],
    "gold_passages": [
      "Fernando Fernán Gómez\nFernando Fernández Gómez (28 August 1921 – 21 November 2007) better known as Fernando Fernán-Gómez was a Spanish actor, screenwriter, film director, theater director and member of the Royal Spanish Academy for seven years.\nHe was born in Argentina while his mother, Spanish actress Carola Fernán-Gómez, was making a tour in Latin America.\nHe would later use her surname for his stage name when he moved to Spain in 1924.\nAfter the Spanish Civil War he began to study law but interrupted his studies to work in theater.\nIn 1942 he began to act in movies but also continued working on plays.\nHe formed his own theater company and received awards for directing and writing.\nIn the 1950s he began to direct movies, including the film of his novel, \"El viaje a ninguna parte\".\nHe received praise for his 1958 comedy \"La vida por delante\", which led to a sequel, \"La vida alrededor\".\nIn 1977, he won the Silver Bear for Best Actor at the 27th Berlin International Film Festival for his role in \"The Anchorite\".\nHe won the award again at the 35th Berlin International Film Festival in 1985 for his role in \"Stico\" and finally the Honorary Golden Bear at the 55th Berlin International Film Festival in 2005.\nHaving been very much in demand during the 1970s and 1980s, the 1990s was a less active period for him, but towards the end of his life, he enjoyed something of a revival, featuring in three major projects: \"Todo sobre mi madrePlenilunio\", and a starring role in the hit \"La lengua de las mariposas\".\nHe married María Dolores Pradera in 1945; they divorced in 1959.\nHe married Emma Cohen in 2000.\nFernando Fernán Gómez died in Madrid on 21 November 2007 from a heart failure.\nAs he was a lifelong anarchist, his coffin was covered in a black and red anarchist flag.",
      "El extraño viaje\nEl extraño viaje is a 1964 Spanish black drama film directed by Fernando Fernán Gómez.\nFamous film director Jess Franco acts as the brother of the protagonist.\nThe film was a huge flop on its limited release.\nIt was voted seventh best Spanish film by professionals and critics in 1996 Spanish cinema centenary.",
      "Love in Pawn\nLove in Pawn is a 1953 British comedy film directed by Charles Saunders and starring Bernard Braden and Barbara Kelly.",
      "Charles Saunders (director)\nCharles Joel Saunders (8 April 1904 – April 1997) was an English film director and screenwriter who started in the industry as a film editor, and who also contributed to television.\nHe was the brother of the theatrical producer Sir Peter Saunders."
    ]
  },
  {
    "query": "Who is the maternal grandfather of Antiochus X Eusebes?",
    "gold_answer": "Ptolemy IX Lathyros",
    "generated_answer": "Antiochus IX",
    "retrieved_passages": [
      "Antiochus X Eusebes\nAntiochus X Eusebes Philopator (–92 or 88 BC) was a Hellenistic Seleucid monarch who reigned as the King of Syria between 95 BC and 92 BC or 89/88 BC (224 SE (Seleucid year)).\nHe was the son of Antiochus IX and perhaps his Egyptian wife Cleopatra IV.\nHe lived in a period during which there was a general disintegration of Seleucid Syria characterized by civil wars, foreign interference by Ptolemaic Egypt and incursions by the Parthians.\nAntiochus IX was killed in 95BC at the hands of Seleucus VI, the son of his half-brother and rival Antiochus VIII.\nAntiochus X then went to the city of Aradus where he declared himself king.\nHe avenged his father by defeating Seleucus VI, who was eventually killed.\nAntiochus X did not enjoy a stable reign as he had to face three of Seleucus VI's brothers,\nAntiochus XI, Philip I and Demetrius III.\nAntiochus XI defeated AntiochusX and expelled him from the capital Antioch in 93 BC.\nA few months later, AntiochusX regained his position and killed Antiochus XI.\nThis led to both Philip I and Demetrius III becoming involved.\nThe civil war continued but its final outcome is uncertain due to the contradictions between different ancient historians' accounts.\nAntiochusX married his stepmother, Antiochus IX's widow Cleopatra Selene, and had several children with her, including a future king Antiochus XIII.\nThe death of Antiochus X is shrouded in mystery.\nThe year of his demise is traditionally given by modern scholars as 92 BC, but other dates are also possible including the year 224 SE (89/88BC).\nThe most reliable account of his end is that of the first century historian Josephus, who wrote that AntiochusX marched east to fight off the Parthians who were attacking a queen called Laodice; the identity of this queen and who her people were continues to be debated.\nOther accounts exist:\nthe ancient Greek historian Appian has AntiochusX defeated by the Armenian king Tigranes II and losing his kingdom; the third century historian Eusebius wrote that AntiochusX was defeated by his cousins and escaped to the Parthians before asking the Romans for help in having him reinstated on the throne.\nModern scholars prefer the account of Josephus and question practically every aspect of the versions presented by other ancient historians.\nNumismatic evidence shows that AntiochusX was succeeded in Antioch by Demetrius III, who controlled the capital in SE (88/87 BC).",
      "Anacyndaraxes\nAnacyndaraxes was the father of Sardanapalus, king of Assyria.",
      "Eusebius (consul 359)\nFlavius Eusebius( died after AD 371) was a Roman Senator, who was the brother- in- law of the emperor Constantius II.",
      "Laodice of the Sameans\nLaodice was a Queen of an unknown Kingdom in Asia.\nShe lived at the time of the Seleucid king of Syria Antiochus X Eusebes who reigned 95 BC- 92 or 88 BC.",
      "Cleomenes II\nCleomenes II( died 309 BC) was Agiad King of Sparta from 369 to 309 BC.\nThe son of Cleombrotus I, he succeeded his brother Agesipolis II.\nHe was the father of Acrotatus I, the father of Areus I, and of Cleonymus, the father of Leonidas II.",
      "Hubba bint Hulail\nHubba bint Hulail was the grandmother of Hashim ibn' Abd Manaf, thus the great- great- great- grandmother of the Islamic\" Nabī\"( Prophet) Muhammad ibn Abdullah.",
      "Hubba bint Hulail\nHubba bint Hulail was the grandmother of Hashim ibn' Abd Manaf, thus the great- great- great- grandmother of the Islamic\" Nabī\"( Prophet) Muhammad ibn Abdullah.",
      "Tjuyu\nTjuyu( sometimes transliterated as Thuya or Thuyu) was an Egyptian noblewoman and the mother of queen Tiye, and the wife of Yuya.\nShe is the grandmother of Akhenaten, and great grandmother of Tutankhamun.",
      "Tjuyu\nTjuyu( sometimes transliterated as Thuya or Thuyu) was an Egyptian noblewoman and the mother of queen Tiye, and the wife of Yuya.\nShe is the grandmother of Akhenaten, and great grandmother of Tutankhamun.",
      "Cleopatra IV of Egypt\nCleopatra IV  was Queen of Egypt briefly from 116 to 115 BC, jointly with her husband Ptolemy IX Lathyros.\nShe later became queen consort of Syria as the wife of Antiochus IX Cyzicenus."
    ],
    "gold_passages": [
      "Cleopatra IV of Egypt\nCleopatra IV  was Queen of Egypt briefly from 116 to 115 BC, jointly with her husband Ptolemy IX Lathyros.\nShe later became queen consort of Syria as the wife of Antiochus IX Cyzicenus.",
      "Antiochus X Eusebes\nAntiochus X Eusebes Philopator (–92 or 88 BC) was a Hellenistic Seleucid monarch who reigned as the King of Syria between 95 BC and 92 BC or 89/88 BC (224 SE (Seleucid year)).\nHe was the son of Antiochus IX and perhaps his Egyptian wife Cleopatra IV.\nHe lived in a period during which there was a general disintegration of Seleucid Syria characterized by civil wars, foreign interference by Ptolemaic Egypt and incursions by the Parthians.\nAntiochus IX was killed in 95BC at the hands of Seleucus VI, the son of his half-brother and rival Antiochus VIII.\nAntiochus X then went to the city of Aradus where he declared himself king.\nHe avenged his father by defeating Seleucus VI, who was eventually killed.\nAntiochus X did not enjoy a stable reign as he had to face three of Seleucus VI's brothers,\nAntiochus XI, Philip I and Demetrius III.\nAntiochus XI defeated AntiochusX and expelled him from the capital Antioch in 93 BC.\nA few months later, AntiochusX regained his position and killed Antiochus XI.\nThis led to both Philip I and Demetrius III becoming involved.\nThe civil war continued but its final outcome is uncertain due to the contradictions between different ancient historians' accounts.\nAntiochusX married his stepmother, Antiochus IX's widow Cleopatra Selene, and had several children with her, including a future king Antiochus XIII.\nThe death of Antiochus X is shrouded in mystery.\nThe year of his demise is traditionally given by modern scholars as 92 BC, but other dates are also possible including the year 224 SE (89/88BC).\nThe most reliable account of his end is that of the first century historian Josephus, who wrote that AntiochusX marched east to fight off the Parthians who were attacking a queen called Laodice; the identity of this queen and who her people were continues to be debated.\nOther accounts exist:\nthe ancient Greek historian Appian has AntiochusX defeated by the Armenian king Tigranes II and losing his kingdom; the third century historian Eusebius wrote that AntiochusX was defeated by his cousins and escaped to the Parthians before asking the Romans for help in having him reinstated on the throne.\nModern scholars prefer the account of Josephus and question practically every aspect of the versions presented by other ancient historians.\nNumismatic evidence shows that AntiochusX was succeeded in Antioch by Demetrius III, who controlled the capital in SE (88/87 BC)."
    ]
  },
  {
    "query": "Which film has the director died first, Crimen A Las Tres or The Working Class Goes To Heaven?",
    "gold_answer": "The Working Class Goes To Heaven",
    "generated_answer": "Crimen a las tres",
    "retrieved_passages": [
      "Crimen a las tres\nCrimen a las tres is a Argentine crime film directed and written by Luis Saslavsky.",
      "Luis Saslavsky\nLuis Saslavsky( April 21, 1903 – March 20, 1995) was an Argentine film director, screenwriter and film producer, and one of the influential directors in the Cinema of Argentina of the classic era.\nHe was Jewish.\nSaskavsky was born in Rosario, Santa Fe, Argentina.\nHe directed and wrote over 40 films between 1931 and 1979.\nHe directed films such as Crimen a las tres in 1935 and wrote for films such as Allá en el Norte in 1973.\nHe retired from the industry in 1979.\nHe died in Buenos Aires, aged 91.",
      "William C. McGann\nWilliam C. McGann( April 15, 1893 – November 15, 1977) was an American film director.\nHe directed 52 films between 1930 and 1942.\nHe was born in Pittsburgh, Pennsylvania and died in Los Angeles, California.",
      "News in Hell\nNews in Hell is a 1959 Argentine film directed by Román Viñoly Barreto.",
      "The Working Class Goes to Heaven\nThe Working Class Goes to Heaven( released in the US as Lulu the Tool) is a 1971 political drama film directed by Elio Petri.\nIt depicts a factory worker's realisation of his own condition as a simple\" tool\" in the process of production and, implicitly, his struggle with the trade unions.\nThe film competed at the 1972 Cannes Film Festival, where it tied with\" The Mattei Affair\" for the Grand Prix International du Festival, the festival's highest honour.\nIn Italy, it also won the David di Donatello for Best Film.",
      "Lucio Fulci\nLucio Fulci( 17 June 1927 – 13 March 1996) was an Italian film director, screenwriter, producer, and actor.\nAlthough he worked in a wide array of genres through a career spanning nearly five decades, including comedy, spaghetti western, adventure, science fiction and erotica, he garnered an international cult following for his giallo and horror films.\nHis most notable films include the\" Gates of Hell\" trilogy —\" City of the Living Dead\"( 1980),\" The Beyond\"( 1981), and\" The House by the Cemetery\"( 1981) —as well as\" Massacre Time\"( 1966),\" One on Top of the Other\"( 1969),\" A Lizard in a Woman's Skin\"( 1971),\" Do n't Torture a Duckling\"( 1972),\" White Fang\"( 1973),\" Four of the Apocalypse\"( 1975),\" Sette note in nero\"( 1977),\" Zombi 2\"( 1979),\" Contraband\"( 1980),\" The Black Cat\"( 1981),\" The New York Ripper\"( 1982),\" Murder Rock\"( 1984), and\" A Cat in the Brain\"( 1990).\nBecause of the high level of visceral graphic violence present in many of his films, especially\" Zombi 2\" and\" The Beyond\", Fulci is frequently referred to as\" The Godfather of Gore\", a title also given to Herschell Gordon Lewis.\nFulci was in his young adult years a politically active radical for the Italian Communist Party.",
      "Fernando Fernán Gómez\nFernando Fernández Gómez (28 August 1921 – 21 November 2007) better known as Fernando Fernán-Gómez was a Spanish actor, screenwriter, film director, theater director and member of the Royal Spanish Academy for seven years.\nHe was born in Argentina while his mother, Spanish actress Carola Fernán-Gómez, was making a tour in Latin America.\nHe would later use her surname for his stage name when he moved to Spain in 1924.\nAfter the Spanish Civil War he began to study law but interrupted his studies to work in theater.\nIn 1942 he began to act in movies but also continued working on plays.\nHe formed his own theater company and received awards for directing and writing.\nIn the 1950s he began to direct movies, including the film of his novel, \"El viaje a ninguna parte\".\nHe received praise for his 1958 comedy \"La vida por delante\", which led to a sequel, \"La vida alrededor\".\nIn 1977, he won the Silver Bear for Best Actor at the 27th Berlin International Film Festival for his role in \"The Anchorite\".\nHe won the award again at the 35th Berlin International Film Festival in 1985 for his role in \"Stico\" and finally the Honorary Golden Bear at the 55th Berlin International Film Festival in 2005.\nHaving been very much in demand during the 1970s and 1980s, the 1990s was a less active period for him, but towards the end of his life, he enjoyed something of a revival, featuring in three major projects: \"Todo sobre mi madrePlenilunio\", and a starring role in the hit \"La lengua de las mariposas\".\nHe married María Dolores Pradera in 1945; they divorced in 1959.\nHe married Emma Cohen in 2000.\nFernando Fernán Gómez died in Madrid on 21 November 2007 from a heart failure.\nAs he was a lifelong anarchist, his coffin was covered in a black and red anarchist flag.",
      "Carl Boese\nCarl Boese( 26 August 1887 – 6 July 1958) was a German film director, screenwriter and producer.\nHe directed 158 films between 1917 and 1957.",
      "Giuliano Carnimeo\nGiuliano Carnimeo (4 July 1932 – 10 September 2016) was an Italian director and screenwriter, sometimes credited as Anthony Ascott.",
      "Lew Landers\nLew Landers( born Louis Friedlander, January 2, 1901 – December 16, 1962) was an American independent film and television director."
    ],
    "gold_passages": [
      "Crimen a las tres\nCrimen a las tres is a Argentine crime film directed and written by Luis Saslavsky.",
      "The Working Class Goes to Heaven\nThe Working Class Goes to Heaven( released in the US as Lulu the Tool) is a 1971 political drama film directed by Elio Petri.\nIt depicts a factory worker's realisation of his own condition as a simple\" tool\" in the process of production and, implicitly, his struggle with the trade unions.\nThe film competed at the 1972 Cannes Film Festival, where it tied with\" The Mattei Affair\" for the Grand Prix International du Festival, the festival's highest honour.\nIn Italy, it also won the David di Donatello for Best Film.",
      "Elio Petri\nElio Petri( 29 January 1929 – 10 November 1982) was an Italian political filmmaker best known for the 1970 Academy Award- winning film\" Investigation of a Citizen Above Suspicion\".",
      "Luis Saslavsky\nLuis Saslavsky( April 21, 1903 – March 20, 1995) was an Argentine film director, screenwriter and film producer, and one of the influential directors in the Cinema of Argentina of the classic era.\nHe was Jewish.\nSaskavsky was born in Rosario, Santa Fe, Argentina.\nHe directed and wrote over 40 films between 1931 and 1979.\nHe directed films such as Crimen a las tres in 1935 and wrote for films such as Allá en el Norte in 1973.\nHe retired from the industry in 1979.\nHe died in Buenos Aires, aged 91."
    ]
  },
  {
    "query": "Which film has the director born first, Once A Gentleman or The Girl In White?",
    "gold_answer": "Once A Gentleman",
    "generated_answer": "The Girl in White",
    "retrieved_passages": [
      "Once a Gentleman\nOnce a Gentleman is a 1930 American comedy film directed by James Cruze and starring Edward Everett Horton, Lois Wilson and Francis X. Bushman.\nA butler goes on vacation, where he is wrongly supposed to be a wealthy man.",
      "The Girl in White\nThe Girl in White is a 1952 film drama directed by John Sturges.\nIt is based on the memoirs of the pioneering female surgeon Emily Dunning Barringer.",
      "When Were You Born\nWhen Were You Born is a 1938 murder mystery film directed by William C. McGann and starring Anna May Wong as an astrologer who helps the police.\nEach of the twelve principal characters was born under a different astrological sign.",
      "James T. O'Donohoe\nJames T. O'Donohoe( 1898 – 27 August 1928 in Los Angeles, California) born James Thomas Langton O'Donohoe was a screenwriter in the early days of Hollywood, during the silent film era.\nHis films include\" Kindred of the Dust\"( 1922),\" The Lucky Lady\"( 1926),\" What Price Glory?\"( 1926),\" The Spaniard\"( 1926),\" Two Arabian Knights\"( 1927),\" Red Lips\"( 1928), and\" Show Girl\"( 1928).",
      "William C. McGann\nWilliam C. McGann( April 15, 1893 – November 15, 1977) was an American film director.\nHe directed 52 films between 1930 and 1942.\nHe was born in Pittsburgh, Pennsylvania and died in Los Angeles, California.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Hanro Smitsman\nHanro Smitsman, born in 1967 in Breda( Netherlands), is a writer and director of film and television.",
      "David Eady (film director)\nDavid Eady( April 22, 1924- April 5, 2009) was a British film director and producer.\nHe was born in London."
    ],
    "gold_passages": [
      "James Cruze\nJames Cruze( born Jens Vera Cruz Bosen, March 27, 1884 near Ogden, Utah – August 3, 1942 in Hollywood, California) was a silent film actor and film director.",
      "The Girl in White\nThe Girl in White is a 1952 film drama directed by John Sturges.\nIt is based on the memoirs of the pioneering female surgeon Emily Dunning Barringer.",
      "John Sturges\nJohn Eliot Sturges( January 3, 1910 – August 18, 1992) was an American film director.\nHis movies include\" Bad Day at Black Rock\"( 1955),\" Gunfight at the O.K. Corral\"( 1957),\" The Magnificent Seven\"( 1960),\" The Great Escape\"( 1963), and\" Ice Station Zebra\"( 1968).\nIn 2013,\" The Magnificent Seven\" was selected for preservation in the United States National Film Registry by the Library of Congress as being\" culturally, historically, or aesthetically significant\".\nHe was not related to director Preston Sturges.",
      "Once a Gentleman\nOnce a Gentleman is a 1930 American comedy film directed by James Cruze and starring Edward Everett Horton, Lois Wilson and Francis X. Bushman.\nA butler goes on vacation, where he is wrongly supposed to be a wealthy man."
    ]
  },
  {
    "query": "Which film has the director who died earlier, Il Seduttore or The Trial Of Joan Of Arc?",
    "gold_answer": "The Trial Of Joan Of Arc",
    "generated_answer": "The Passion of Joan of Arc",
    "retrieved_passages": [
      "The Trial of Joan of Arc\nThe Trial of Joan of Arc is a 1962 French historical film directed by Robert Bresson.\nJoan of Arc is played by Florence Delay.\nAs with Bresson's most renowned films,\" The Trial of Joan of Arc\" stars non-professional performers and is filmed in an extremely spare, restrained style.\nBresson's screenplay is drawn from the transcriptions of Joan's trial and rehabilitation.\nBresson's\" Joan of Arc\" is often compared with\" The Passion of Joan of Arc\"( 1928) by Carl Theodor Dreyer.\nBresson compared that film unfavorably with his own, expressing his dislike of the actors'\" grotesque buffooneries\" in Dreyer's film.",
      "Jeannette: The Childhood of Joan of Arc\nJeannette: The Childhood of Joan of Arc is a 2017 French musical film directed by Bruno Dumont.\nIt was screened in the Directors' Fortnight section at the 2017 Cannes Film Festival.\nIt was followed two years later by the non-musical sequel\" Joan of Arc\" which premiered at the 2019 Cannes Film Festival, written and directed by Dumont and with Lise Leplat Prudhomme reprising her role.",
      "Giuliano Carnimeo\nGiuliano Carnimeo (4 July 1932 – 10 September 2016) was an Italian director and screenwriter, sometimes credited as Anthony Ascott.",
      "Il seduttore\nIl seduttore( translation:\" The Seducer\") is a 1954 Italian comedy film directed by Franco Rossi.\nIt was adapted from the play by Diego Fabbri.",
      "Robert Bresson\nRobert Bresson( 25 September 1901 – 18 December 1999) was a French film director.\nKnown for his ascetic approach, Bresson contributed notably to the art of cinema; his non-professional actors, ellipses, and sparse use of scoring have led his works to be regarded as preeminent examples of minimalist film.\nBresson is among the most highly regarded French filmmakers of all time.\nHis works\" A Man Escaped\"( 1956),\" Pickpocket\"( 1959) and\" Au hasard Balthazar\"( 1966) were ranked among the 100 greatest films ever made in the 2012\" Sight& Sound\" critics' poll.\nOther films of his, such as\" Mouchette\"( 1967) and\" L' Argent\"( 1983), also received many votes.\nJean- Luc Godard once wrote,\" He is the French cinema, as Dostoevsky is the Russian novel and Mozart is German[\" sic\"] music.\"",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Lionel Royer\nLionel- Noël Royer( December 25, 1852 – 30 June 1926) was a French painter.\nHe was most famous for painting large scenes of the life of Joan of Arc in the in Domrémy.",
      "Jacques Décombe\nJacques Décombe is a French author, actor and director born in 1953."
    ],
    "gold_passages": [
      "Franco Rossi (director)\nFranco Rossi( 19 April 1919, Florence- 5 June 2000, Rome) was an Italian film screenwriter and director, mainly known for having directed the six- hour- long Italian- German- British- Swiss TV mini-series\" Quo Vadis?\" in 1985.",
      "Robert Bresson\nRobert Bresson( 25 September 1901 – 18 December 1999) was a French film director.\nKnown for his ascetic approach, Bresson contributed notably to the art of cinema; his non-professional actors, ellipses, and sparse use of scoring have led his works to be regarded as preeminent examples of minimalist film.\nBresson is among the most highly regarded French filmmakers of all time.\nHis works\" A Man Escaped\"( 1956),\" Pickpocket\"( 1959) and\" Au hasard Balthazar\"( 1966) were ranked among the 100 greatest films ever made in the 2012\" Sight& Sound\" critics' poll.\nOther films of his, such as\" Mouchette\"( 1967) and\" L' Argent\"( 1983), also received many votes.\nJean- Luc Godard once wrote,\" He is the French cinema, as Dostoevsky is the Russian novel and Mozart is German[\" sic\"] music.\"",
      "The Trial of Joan of Arc\nThe Trial of Joan of Arc is a 1962 French historical film directed by Robert Bresson.\nJoan of Arc is played by Florence Delay.\nAs with Bresson's most renowned films,\" The Trial of Joan of Arc\" stars non-professional performers and is filmed in an extremely spare, restrained style.\nBresson's screenplay is drawn from the transcriptions of Joan's trial and rehabilitation.\nBresson's\" Joan of Arc\" is often compared with\" The Passion of Joan of Arc\"( 1928) by Carl Theodor Dreyer.\nBresson compared that film unfavorably with his own, expressing his dislike of the actors'\" grotesque buffooneries\" in Dreyer's film.",
      "Il seduttore\nIl seduttore( translation:\" The Seducer\") is a 1954 Italian comedy film directed by Franco Rossi.\nIt was adapted from the play by Diego Fabbri."
    ]
  },
  {
    "query": "Where was the director of film Thomas Jefferson (Film) born?",
    "gold_answer": "Brooklyn",
    "generated_answer": "Louis Friedlander",
    "retrieved_passages": [
      "Thomas Jefferson (film)\nThomas Jefferson is a 1997 two-part American documentary film directed and produced by Ken Burns.\nIt covers the life and times of Thomas Jefferson, the 3rd President of the United States.\nIn the film Jefferson is portrayed as renaissance man.\nNot only was he a dedicated public servant, but was also a writer, an inventor, and a noted architect.\nBurns captures both the public and private person.",
      "Lew Landers\nLew Landers( born Louis Friedlander, January 2, 1901 – December 16, 1962) was an American independent film and television director.",
      "Thomas Carr (director)\nThomas Carr( July 4, 1907 – April 23, 1997) was an American actor and film director of Hollywood movies and television programs.\nOften billed as\" Tommy Carr\", he later adopted his more formal\" Thomas Carr\" birth name as his billing name.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "David Eady (film director)\nDavid Eady( April 22, 1924- April 5, 2009) was a British film director and producer.\nHe was born in London.",
      "Richard H. Jefferson\nRichard H. Jefferson( born January 20, 1931) is an American politician who served in the Minnesota House of Representatives from 1987 to 1999.",
      "Jason Moore (director)\nJason Moore( born October 22, 1970) is an American director of film, theatre and television.",
      "Atiba Jefferson\nAtiba Jefferson( born 1976) is an American photographer and skateboarder."
    ],
    "gold_passages": [
      "Ken Burns\nKenneth Lauren Burns (born 1953) is an American filmmaker, known for his style of using archival footage and photographs in documentary films.\nHis widely known documentary series include \"The Civil War\" (1990), \"Baseball\" (1994), \"Jazz\" (2001), \"The War\" (2007),  (2009), \"Prohibition\" (2011), \"The Roosevelts\" (2014), \"The Vietnam War\" (2017), and \"Country Music\" (2019).\nHe was also executive producer of both \"The West\" (1996, directed by Stephen Ives), and \"Cancer: The Emperor of All Maladies\" (2015, directed by Barak Goodman).\nBurns' documentaries have earned two Academy Award nominations (for 1981's \"Brooklyn Bridge\" and 1985's \"The Statue of Liberty\") and have won several Emmy Awards, among other honors.",
      "Thomas Jefferson (film)\nThomas Jefferson is a 1997 two-part American documentary film directed and produced by Ken Burns.\nIt covers the life and times of Thomas Jefferson, the 3rd President of the United States.\nIn the film Jefferson is portrayed as renaissance man.\nNot only was he a dedicated public servant, but was also a writer, an inventor, and a noted architect.\nBurns captures both the public and private person."
    ]
  },
  {
    "query": "Why did Grand Duke Kirill Vladimirovich Of Russia's wife die?",
    "gold_answer": "stroke",
    "generated_answer": "Russia’s last Tsar",
    "retrieved_passages": [
      "Grand Duke Kirill Vladimirovich of Russia\nGrand Duke Kirill Vladimirovich of Russia, (\"Kirill Vladimirovich Romanov\"; – 12 October 1938) was a son of Grand Duke Vladimir Alexandrovich of Russia, a grandson of Emperor Alexander II and a first cousin of Nicholas II, Russia’s last Tsar.\nGrand Duke Kirill followed a career in the Russian navy serving during twenty years in the Naval Guards.\nHe took part in the Russo-Japanese War, barely surviving the sinking of the battleship at Port Arthur in April 1904.\nIn 1905, he married his paternal first cousin, Princess Victoria Melita of Saxe-Coburg and Gotha.\nThey wed in defiance of Tsar Nicholas II prohibition.\nIn retaliation, the Tsar stripped Kirill of his offices and honors, also initially banishing the couple from Russia.\nThey had two daughters and settled in Paris before being allowed to visit Russia in 1909.\nIn 1910 they moved to Russia, where Nicholas II recognized their marriage.\nDuring World War I, Grand Duke Kirill was appointed Commander of the Naval Depot of the Guards in 1915 and in 1916, he achieved the rank of rear Admiral in the Imperial Navy.\nDuring the February Revolution of 1917, Kirill marched to the Tauride Palace at the head of the Naval Guards swearing allegiance to the Russian Provisional Government.\nDuring the rule of the provisional governmental in the summer 1917, Kirill escaped to Finland where his wife gave birth to the couple's only son.\nIn exile they lived for some years among his wife's relatives in Germany, and from the late 1920s on an estate they bought in Saint-Briac.\nWith the murder of his cousins Tsar Nicholas II and Grand Duke Michael, Kirill assumed the headship of the Imperial Family of Russia and, as next in line to the throne as the Guardian of the Throne in 1924.\nKirill proclaimed himself emperor in exile in 1926.\nHe worked for the restoration of the monarchy from exile for the rest of his life, but his claims were contested by some factions of the monarchy movement in a division that continues until today.\nHe wrote a book of memoirs, \"My Life in Russia's Service\", published after his death.\nHis granddaughter, Grand Duchess Maria Vladimirovna, is the current claimant to the headship of the House of Romanov.",
      "Grand Duke Andrei Vladimirovich of Russia\nGrand Duke Andrei Vladimirovich of Russia ((14 May 1879 – 30 October 1956) was a son of Grand Duke Vladimir Alexandrovich of Russia, a grandson of Emperor Alexander II and a first cousin of Nicholas II, Russia’s last Tsar.\nIn 1900, he began an affair with the famous ballerina Mathilde Kschessinska, becoming the third grand duke to fall for her.\nGrand Duke Andrei followed a military career and graduated from the Alexandrovskaya Military Law academy in 1905.\nHe occupied different military positions during the reign of Tsar Nicholas II, but with no particular distinction.\nHe became senator in 1911 and was appointed Major General in the Russian Army in 1915.\nHe took part in World War I, but was away from real combat spending most of the conflict at Russia's headquarters or in idle time in Saint Petersburg.\nIn February 1917, shortly before the fall of the Russian monarchy, Grand Duke Andrei left Saint Petersburg to join his mother in Kislovodsk.\nHe remained in the Caucasus for the next three years.\nAfter the October Revolution he was briefly arrested along with his brother, Grand Duke Boris, but they escaped.\nHe departed revolutionary Russia in March 1920, being the last grand duke to leave for exile.\nIn 1921, he married his longtime mistress Mathilde Kschessinska and recognized her son as his.\nThe couple lived in the South of France until 1929 when they moved permanently to Paris, where Kschessinska opened a ballet school.\nAfter World War II, Grand Duke Andrei lived under reduced circumstances.\nUntil his death at age 77, he was the last surviving Russian grand duke born in Imperial Russia.",
      "Princess Victoria Melita of Saxe-Coburg and Gotha\nPrincess Victoria Melita of Saxe-Coburg and Gotha , later Grand Duchess Victoria Feodorovna of Russia (25 November 1876 – 2 March 1936) was the third child and second daughter of Alfred, Duke of Saxe-Coburg and Gotha, and Grand Duchess Maria Alexandrovna of Russia.\nShe was a granddaughter of Queen Victoria of the United Kingdom and Emperor Alexander II of Russia.\nBorn a British princess, Victoria spent her early life in England and lived in Malta for three years, where her father was serving in the Royal Navy.\nIn 1889 the family moved to Coburg, where Victoria's father became the reigning duke in 1893.\nIn her teens Victoria fell in love with her maternal first cousin Grand Duke Kirill Vladimirovich of Russia, but the disapprobation of marriage between first cousins of his faith, Orthodox Christianity, discouraged their romance.\nBowing to family pressure, Victoria married her paternal first cousin, Ernest Louis, Grand Duke of Hesse and by Rhine in 1894, following the wishes of their grandmother, Queen Victoria.\nTheir marriage was a failure.\nVictoria scandalized the royal families of Europe when she divorced her husband in 1901.\nThe couple's only child, Princess Elisabeth of Hesse and by Rhine, died of typhoid fever in 1903.\nVictoria married Grand Duke Kirill Vladimirovich in 1905.\nThey wed without the formal approval of Britain's King Edward VII, required by the Royal Marriages Act 1772, and in defiance of Tsar Nicholas II.\nIn retaliation, the Tsar stripped Kirill of his offices and honours, also initially banishing the couple from Russia.\nThey had two daughters and settled in Paris before being allowed to visit Russia in 1909.\nIn 1910 they moved to Russia, where Nicholas recognized her as Grand Duchess Victoria Feodorovna.\nAfter the fall of the Russian monarchy in 1917, they escaped to Finland (then part of the Russian Empire) where she gave birth to her only son.\nIn exile they lived for some years among her relatives in Germany, and from the late 1920s on an estate they bought in Saint-Briac.\nIn 1926, Kirill proclaimed himself emperor in exile and Victoria supported her husband's claims.\nVictoria died after suffering a stroke while visiting her daughter Maria in Amorbach.",
      "Grand Duke Vyacheslav Konstantinovich of Russia\nGrand Duke Vyacheslav Konstantinovich of Russia,( 13 July 1862 – 27 February 1879), was a Romanov grand duke and the youngest son of Grand Duke Konstantin Nikolayevich of Russia and his wife Princess Alexandra of Saxe- Altenburg.\nThe English form of his first name is Wenceslas.",
      "Grand Duke Nicholas Konstantinovich of Russia\nGrand Duke Nicholas Constantinovich of Russia( 14 February 1850 – 26 January 1918) was the first- born son of Grand Duke Konstantin Nikolayevich and Grand Duchess Alexandra Iosifovna of Russia and a grandson of Nicholas I of Russia.",
      "Prince Karl of Leiningen\nPrince Karl Vladimir Ernst Heinrich of Leiningen( 2 January 1928 – 28 September 1990) was the younger son of Karl, 6th Prince of Leiningen( 1898 – 1946) and Grand Duchess Maria Kirillovna of Russia.\nMaria was the daughter of Princess Victoria Melita of Edinburgh and Saxe- Coburg- Gotha and Cyril Vladimirovich, Grand Duke of Russia.\nAs such, Karl was a great- great- grandson of both Queen Victoria of Great Britain and Emperor Alexander II of Russia( as Victoria Melita and Cyril Vladimirovich were both grandchildren of Alexander II).",
      "Princess Helen of Serbia\nPrincess Helen of Serbia and Yugoslavia (23 October (4 November New Style) 1884 – 16 October 1962) was the daughter of King Peter I of Yugoslavia and his wife Princess Zorka of Montenegro.\nShe was the elder sister of George, Crown Prince of Serbia and King Alexander I of Yugoslavia.\nHelen was also a niece of Anastasia of Montenegro (or \"Stana\"), wife of Grand Duke Nicholas Nikolaevich of Russia, and of Milica of Montenegro, wife of Grand Duke Peter Nicolaievich of Russia, the women who introduced Grigori Rasputin to Tsarina Alexandra.",
      "Maria Teresa, Grand Duchess of Luxembourg\nMaria Teresa, Grand Duchess of Luxembourg( born María Teresa Mestre y Batista; on 22 March 1956), is the spouse of Grand Duke Henri.",
      "Princess Auguste of Bavaria (1875–1964)\nPrincess Auguste of Bavaria( 28 April 1877 – 25 June 1964) was a member of the Bavarian Royal House of Wittelsbach and the spouse of Archduke Joseph August of Austria.",
      "Gülbahar Hatun (wife of Mehmed II)\nGülbahar Hatun( 1432 – 1492) was the consort of Sultan Mehmed II, and mother of Sultan Bayezid II of the Ottoman Empire and the grandmother of Selim I."
    ],
    "gold_passages": [
      "Grand Duke Kirill Vladimirovich of Russia\nGrand Duke Kirill Vladimirovich of Russia, (\"Kirill Vladimirovich Romanov\"; – 12 October 1938) was a son of Grand Duke Vladimir Alexandrovich of Russia, a grandson of Emperor Alexander II and a first cousin of Nicholas II, Russia’s last Tsar.\nGrand Duke Kirill followed a career in the Russian navy serving during twenty years in the Naval Guards.\nHe took part in the Russo-Japanese War, barely surviving the sinking of the battleship at Port Arthur in April 1904.\nIn 1905, he married his paternal first cousin, Princess Victoria Melita of Saxe-Coburg and Gotha.\nThey wed in defiance of Tsar Nicholas II prohibition.\nIn retaliation, the Tsar stripped Kirill of his offices and honors, also initially banishing the couple from Russia.\nThey had two daughters and settled in Paris before being allowed to visit Russia in 1909.\nIn 1910 they moved to Russia, where Nicholas II recognized their marriage.\nDuring World War I, Grand Duke Kirill was appointed Commander of the Naval Depot of the Guards in 1915 and in 1916, he achieved the rank of rear Admiral in the Imperial Navy.\nDuring the February Revolution of 1917, Kirill marched to the Tauride Palace at the head of the Naval Guards swearing allegiance to the Russian Provisional Government.\nDuring the rule of the provisional governmental in the summer 1917, Kirill escaped to Finland where his wife gave birth to the couple's only son.\nIn exile they lived for some years among his wife's relatives in Germany, and from the late 1920s on an estate they bought in Saint-Briac.\nWith the murder of his cousins Tsar Nicholas II and Grand Duke Michael, Kirill assumed the headship of the Imperial Family of Russia and, as next in line to the throne as the Guardian of the Throne in 1924.\nKirill proclaimed himself emperor in exile in 1926.\nHe worked for the restoration of the monarchy from exile for the rest of his life, but his claims were contested by some factions of the monarchy movement in a division that continues until today.\nHe wrote a book of memoirs, \"My Life in Russia's Service\", published after his death.\nHis granddaughter, Grand Duchess Maria Vladimirovna, is the current claimant to the headship of the House of Romanov.",
      "Princess Victoria Melita of Saxe-Coburg and Gotha\nPrincess Victoria Melita of Saxe-Coburg and Gotha , later Grand Duchess Victoria Feodorovna of Russia (25 November 1876 – 2 March 1936) was the third child and second daughter of Alfred, Duke of Saxe-Coburg and Gotha, and Grand Duchess Maria Alexandrovna of Russia.\nShe was a granddaughter of Queen Victoria of the United Kingdom and Emperor Alexander II of Russia.\nBorn a British princess, Victoria spent her early life in England and lived in Malta for three years, where her father was serving in the Royal Navy.\nIn 1889 the family moved to Coburg, where Victoria's father became the reigning duke in 1893.\nIn her teens Victoria fell in love with her maternal first cousin Grand Duke Kirill Vladimirovich of Russia, but the disapprobation of marriage between first cousins of his faith, Orthodox Christianity, discouraged their romance.\nBowing to family pressure, Victoria married her paternal first cousin, Ernest Louis, Grand Duke of Hesse and by Rhine in 1894, following the wishes of their grandmother, Queen Victoria.\nTheir marriage was a failure.\nVictoria scandalized the royal families of Europe when she divorced her husband in 1901.\nThe couple's only child, Princess Elisabeth of Hesse and by Rhine, died of typhoid fever in 1903.\nVictoria married Grand Duke Kirill Vladimirovich in 1905.\nThey wed without the formal approval of Britain's King Edward VII, required by the Royal Marriages Act 1772, and in defiance of Tsar Nicholas II.\nIn retaliation, the Tsar stripped Kirill of his offices and honours, also initially banishing the couple from Russia.\nThey had two daughters and settled in Paris before being allowed to visit Russia in 1909.\nIn 1910 they moved to Russia, where Nicholas recognized her as Grand Duchess Victoria Feodorovna.\nAfter the fall of the Russian monarchy in 1917, they escaped to Finland (then part of the Russian Empire) where she gave birth to her only son.\nIn exile they lived for some years among her relatives in Germany, and from the late 1920s on an estate they bought in Saint-Briac.\nIn 1926, Kirill proclaimed himself emperor in exile and Victoria supported her husband's claims.\nVictoria died after suffering a stroke while visiting her daughter Maria in Amorbach."
    ]
  },
  {
    "query": "Where was the place of death of the director of film Beat Girl?",
    "gold_answer": "Nice",
    "generated_answer": "South Korea",
    "retrieved_passages": [
      "Kim Sung-su (director)\nKim Sung- su( born November 15, 1961) is a South Korean film director, known mainly for the teen film\" Beat\", period epic\" Musa\" and the comedy\" Please Teach Me English\".",
      "G. Marthandan\nG. Marthandan is an Indian film director who works in Malayalam cinema.",
      "M. Venkataraju\nM Venkataraju, was a music director/ composer of Kannada film world.",
      "Mieczysław Krawicz\nMieczysław Krawicz( 1893–1944) was a Polish film director from Warsaw.",
      "Wunna\nMaung Wunna  was a two-time Myanmar Motion Picture Academy Awards-winning Burmese director and writer.\nHe came from a family heavily involved in the entertainment industry—his father Thadu was a director and his brother Thu Maung was a prominent singer and actor and Min Lu was a reputed satirist.\nMaung Wunna died of lung cancer in 2011.",
      "Beat Girl\nBeat Girl is a 1960 British teen exploitation film directed by Edmond T. Gréville.\nThe film was released in the United States under the title Wild for Kicks.\nThe title character of \"Beat Girl\" was played by starlet Gillian Hills, who later went on to have numerous small roles in 1960s and 1970s films, such as \"Blowup\" and \"A Clockwork Orange\", and became a successful ye-ye singer in France.\n\"Beat Girl\" marked the first film roles of British pop idol Adam Faith and actor Peter McEnery, although it was not released until after other films featuring Faith (\"Never Let Go\") and McEnery (\"Tunes of Glory\") had already come out.\nThe film also features Christopher Lee and Nigel Green as strip joint operators, and Oliver Reed in a small role as one of the \"beat\" youth.\nThe original music was composer John Barry's first film commission, and was performed by the John Barry Seven and Orchestra, Adam Faith, and Shirley Anne Field.\nThe \"Beat Girl\" soundtrack was the first British soundtrack album to be released on a vinyl LP, and it reached number 11 on the UK Albums Chart, paving the way for the release of other film soundtrack albums.",
      "Sepideh Farsi\nSepideh Farsi is an Iranian film director, born in Tehran in 1965.",
      "Hassan Zee\nHassan Zee is a Pakistani- American film director who was born in Chakwal, Pakistan.",
      "David Eady (film director)\nDavid Eady( April 22, 1924- April 5, 2009) was a British film director and producer.\nHe was born in London.",
      "Deepak Sareen\nDeepak Sareen is a Bollywood film director and assistant director.\nHis first film as director was\" Ranbhoomi\" and last film as director was\" Albela\"."
    ],
    "gold_passages": [
      "Edmond T. Gréville\nEdmond T. Gréville (real name Edmond Gréville Thonger,\n20 June 1906 Nice – 26 May 1966\n, Nice) was a French film director and screenwriter.\nHe was married to the actress Vanda Gréville.",
      "Beat Girl\nBeat Girl is a 1960 British teen exploitation film directed by Edmond T. Gréville.\nThe film was released in the United States under the title Wild for Kicks.\nThe title character of \"Beat Girl\" was played by starlet Gillian Hills, who later went on to have numerous small roles in 1960s and 1970s films, such as \"Blowup\" and \"A Clockwork Orange\", and became a successful ye-ye singer in France.\n\"Beat Girl\" marked the first film roles of British pop idol Adam Faith and actor Peter McEnery, although it was not released until after other films featuring Faith (\"Never Let Go\") and McEnery (\"Tunes of Glory\") had already come out.\nThe film also features Christopher Lee and Nigel Green as strip joint operators, and Oliver Reed in a small role as one of the \"beat\" youth.\nThe original music was composer John Barry's first film commission, and was performed by the John Barry Seven and Orchestra, Adam Faith, and Shirley Anne Field.\nThe \"Beat Girl\" soundtrack was the first British soundtrack album to be released on a vinyl LP, and it reached number 11 on the UK Albums Chart, paving the way for the release of other film soundtrack albums."
    ]
  },
  {
    "query": "Who died first, Fleetwood Sheppard or George William Whitaker?",
    "gold_answer": "Fleetwood Sheppard",
    "generated_answer": "William Whitaker",
    "retrieved_passages": [
      "William Whitaker (1629–1672)\nWilliam Whitaker( 1629 – 1672) was an English ejected minister.",
      "William Whitaker (geologist)\nWilliam Whitaker was born on 4 May 1836 in London,",
      "Fleetwood Sheppard\nFleetwood Sheppard (sometimes spelled as \"Shepphard,Sheppheard,\" and \"Sheppeard\") (1 January 1634 – 25 August 1698) was a British courtier and literary wit who was instrumental in the courts of Charles II of England and William of Orange.\nHe was an educated man known for his lively wit and honesty, and he was an important figure in the poetry of the 1680s and 1690s.\nHe was born in Oxfordshire, attended Magdalen Hall and Christ Church, Oxford, gaining the Bachelor of Arts in 1654 and Master of Arts in 1657.\nWhen all persons attaining an M.A. were required to join the Church of England, King Charles intervened and said that Sheppard had a background in civil law (having studied at Gray's Inn) and was \"not prepared to take orders, he being a person of much ability\" (Ellis 255).\nInstead, Sheppard became a courtier.\nHe was introduced to Nell Gwynn and became one of her favourite companions, along with Charles Sackville, Lord Buckhurst (later Earl of Dorset).\nHe would remain one of Dorset's closest friends throughout his life.\nWhile satirists and gossips (such as Anthony á Wood) said that Sheppard spent his time as \"a debauchee and atheist, a grand companion,\" others suggested that he was a fundamentally honest man who was always interested in a good joke.\nHe became one of Charles II's dining companions, and when Nell Gwynn gave birth to a male child, he was made the steward of Gwynn's household.\nThis prompted a satirist to accuse him of being the best paid pimp in the land.\nThere is little truth to this charge, however, as Sheppard was not paid by the crown for his services, except for two grants of £200.\nDorset and Sheppard went to Paris together.\nAdditionally, Dorset would travel out to meet Sheppard when the latter went out to the country.\nWhether he and Dorset got in trouble in Paris for some scandalous behaviour, as Wood suggests, or not, it is true that Sheppard lived a very active life.\nHe was stabbed beneath the eye while separating Henry Bulkeley and George Etheridge in a quarrel in a tavern.\nSheppard was not liked by James II, and Sheppard did not like James, either.\nWhen Charles II died, Sheppard went into retirement.\nHowever, when William came to the throne, Sheppard was back at court and back in favour.\nDorset was made the chamberlain of the royal household, and that gave him a great many places to dispense in patronage.\nFor this, he employed Sheppard.\nSheppard received the proceeds from those wishing to purchase places, and he received the favours of those wishing a good word to be placed on their behalf.\nAt the same time, Sheppard was a favourite of the new Queen's, and John Oldmixon said that he made the Queen \"very merry.\"\nIn \"A New Way of Selling Places at Court\" in 1712, Jonathan Swift would say that Fleetwood Sheppard sold places that did not exist and named successors for posts that were not vacant, that he enriched himself greatly.\nIn 1690 he was made a gentleman usher to the king.\nIn 1694 he was knighted, became a gentleman usher to the black rod in the House of Lords, and was inducted as a knight of the garter.\nSheppard was a patron of many poets and one of those who discovered others.\nHe was one of the ones, for example, who \"discoveredParadise Lost\" when Buckhurst bought it from a small stall at a fair.\nHe was also present when Matthew Prior was discovered reading Horace as a tap puller in a bar and sent to school to cultivate his talents.\nHe was also one of the main supports of Robert Gould, as well as John Oldmixon.\nHe may have embraced the Puritan cause around 1695, and some of his old friends were disaffected by this change.\nCharles Gildon, Thomas Rymer, and John Dennis dedicated volumes of literary criticism to Sheppard, and John Wilmot, 2nd Earl of Rochester regarded Sheppard as the only critic he needed for his verses.\nIn his last years, Sheppard was reported dead several times before he died.\nIn 1694, Lord Godolphin heard a report that Sheppard had died, but Sheppard himself responded, saying that he was alive, but that he had suffered from \"the stone\" for twelve to fourteen years.\nIn December 1697, he was again reported as dead.\nIn July 1698, he was \"again\" reported as dead.\nHe did die shortly afterward, but in 1768 a joking \"Annual Register\" announced that Sheppard was still alive, in good health, and 120 years old.",
      "William Whitaker Reed\nWilliam Whitaker Reed (January 23, 1816 - August 21, 1891) was a Tennessee native and a pioneer in the settlement of Bell County, Texas.",
      "Billy Whitaker\nWilliam Whitaker( 1923–1995) was an English professional footballer who played in the Football League, as a defender.",
      "James Corker\nJames Corker or James Cleveland( born 1753 or 1754, died March 24, 1791) was a man of English descent who took part in clan fighting in precolonial Sierra Leone.",
      "Nicholas Sheppard\nNicholas Sheppard( or Shepherd)( died 1587) was an English churchman and academic, Master of St John's College, Cambridge and Archdeacon of Northampton.",
      "George William Whitaker\nGeorge William Whitaker( September 25, 1840 – March 6, 1916) was a prominent Rhode Island landscape painter during the late 19th and early 20th century, known as the\" Dean of Providence painters\" or the\" Dean of Rhode Island Artists.\"",
      "George William Patchett\nGeorge William Patchett was a British motorcycle racer and engineer.",
      "Thomas Scott (diver)\nThomas Scott( 1907- date of death unknown) was an English diver."
    ],
    "gold_passages": [
      "Fleetwood Sheppard\nFleetwood Sheppard (sometimes spelled as \"Shepphard,Sheppheard,\" and \"Sheppeard\") (1 January 1634 – 25 August 1698) was a British courtier and literary wit who was instrumental in the courts of Charles II of England and William of Orange.\nHe was an educated man known for his lively wit and honesty, and he was an important figure in the poetry of the 1680s and 1690s.\nHe was born in Oxfordshire, attended Magdalen Hall and Christ Church, Oxford, gaining the Bachelor of Arts in 1654 and Master of Arts in 1657.\nWhen all persons attaining an M.A. were required to join the Church of England, King Charles intervened and said that Sheppard had a background in civil law (having studied at Gray's Inn) and was \"not prepared to take orders, he being a person of much ability\" (Ellis 255).\nInstead, Sheppard became a courtier.\nHe was introduced to Nell Gwynn and became one of her favourite companions, along with Charles Sackville, Lord Buckhurst (later Earl of Dorset).\nHe would remain one of Dorset's closest friends throughout his life.\nWhile satirists and gossips (such as Anthony á Wood) said that Sheppard spent his time as \"a debauchee and atheist, a grand companion,\" others suggested that he was a fundamentally honest man who was always interested in a good joke.\nHe became one of Charles II's dining companions, and when Nell Gwynn gave birth to a male child, he was made the steward of Gwynn's household.\nThis prompted a satirist to accuse him of being the best paid pimp in the land.\nThere is little truth to this charge, however, as Sheppard was not paid by the crown for his services, except for two grants of £200.\nDorset and Sheppard went to Paris together.\nAdditionally, Dorset would travel out to meet Sheppard when the latter went out to the country.\nWhether he and Dorset got in trouble in Paris for some scandalous behaviour, as Wood suggests, or not, it is true that Sheppard lived a very active life.\nHe was stabbed beneath the eye while separating Henry Bulkeley and George Etheridge in a quarrel in a tavern.\nSheppard was not liked by James II, and Sheppard did not like James, either.\nWhen Charles II died, Sheppard went into retirement.\nHowever, when William came to the throne, Sheppard was back at court and back in favour.\nDorset was made the chamberlain of the royal household, and that gave him a great many places to dispense in patronage.\nFor this, he employed Sheppard.\nSheppard received the proceeds from those wishing to purchase places, and he received the favours of those wishing a good word to be placed on their behalf.\nAt the same time, Sheppard was a favourite of the new Queen's, and John Oldmixon said that he made the Queen \"very merry.\"\nIn \"A New Way of Selling Places at Court\" in 1712, Jonathan Swift would say that Fleetwood Sheppard sold places that did not exist and named successors for posts that were not vacant, that he enriched himself greatly.\nIn 1690 he was made a gentleman usher to the king.\nIn 1694 he was knighted, became a gentleman usher to the black rod in the House of Lords, and was inducted as a knight of the garter.\nSheppard was a patron of many poets and one of those who discovered others.\nHe was one of the ones, for example, who \"discoveredParadise Lost\" when Buckhurst bought it from a small stall at a fair.\nHe was also present when Matthew Prior was discovered reading Horace as a tap puller in a bar and sent to school to cultivate his talents.\nHe was also one of the main supports of Robert Gould, as well as John Oldmixon.\nHe may have embraced the Puritan cause around 1695, and some of his old friends were disaffected by this change.\nCharles Gildon, Thomas Rymer, and John Dennis dedicated volumes of literary criticism to Sheppard, and John Wilmot, 2nd Earl of Rochester regarded Sheppard as the only critic he needed for his verses.\nIn his last years, Sheppard was reported dead several times before he died.\nIn 1694, Lord Godolphin heard a report that Sheppard had died, but Sheppard himself responded, saying that he was alive, but that he had suffered from \"the stone\" for twelve to fourteen years.\nIn December 1697, he was again reported as dead.\nIn July 1698, he was \"again\" reported as dead.\nHe did die shortly afterward, but in 1768 a joking \"Annual Register\" announced that Sheppard was still alive, in good health, and 120 years old.",
      "George William Whitaker\nGeorge William Whitaker( September 25, 1840 – March 6, 1916) was a prominent Rhode Island landscape painter during the late 19th and early 20th century, known as the\" Dean of Providence painters\" or the\" Dean of Rhode Island Artists.\""
    ]
  },
  {
    "query": "Which film has the director born first, The Raven'S Dance or Keïta! L'Héritage Du Griot?",
    "gold_answer": "The Raven'S Dance",
    "generated_answer": "The Raven's Dance",
    "retrieved_passages": [
      "Markku Lehmuskallio\nMarkku Lehmuskallio( born 31 December 1938) is a Finnish film director, cinematographer and screenwriter.\nHe has directed 26 films since 1973.\nHis 1980 film\" The Raven's Dance\" was entered into the 30th Berlin International Film Festival, where it won an Honourable Mention.",
      "The Raven's Dance\nThe Raven's Dance is a 1980 Finnish film directed by Markku Lehmuskallio.\nIt was entered into the 30th Berlin International Film Festival, where it won an Honourable Mention.",
      "Keïta! l'Héritage du griot\nKeïta!\nl'Héritage du griot (English title: \"Keita!\nVoice of the Griot \") is a 1995 Burkinabé drama film directed by Dani Kouyaté and starring Sotigui Kouyaté.",
      "Seydou Boro\nSeydou Boro is a Burkinabé actor, dancer, and choreographer.\nHe played the lead in the 1995 Dani Kouyate- directed film\" Keïta! l' Héritage du griot\".",
      "The Raven (2006 film)\nThe Raven is a 2006 American direct- to- video production horror film directed by Ulli Lommel and references the poem\" The Raven\" by Edgar Allan Poe.\nThe DVD case cover art carries the title,\" Edgar Allan Poe's The Raven\".",
      "Robert Bresson\nRobert Bresson( 25 September 1901 – 18 December 1999) was a French film director.\nKnown for his ascetic approach, Bresson contributed notably to the art of cinema; his non-professional actors, ellipses, and sparse use of scoring have led his works to be regarded as preeminent examples of minimalist film.\nBresson is among the most highly regarded French filmmakers of all time.\nHis works\" A Man Escaped\"( 1956),\" Pickpocket\"( 1959) and\" Au hasard Balthazar\"( 1966) were ranked among the 100 greatest films ever made in the 2012\" Sight& Sound\" critics' poll.\nOther films of his, such as\" Mouchette\"( 1967) and\" L' Argent\"( 1983), also received many votes.\nJean- Luc Godard once wrote,\" He is the French cinema, as Dostoevsky is the Russian novel and Mozart is German[\" sic\"] music.\"",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "When the Raven Flies\nWhen the Raven Flies( original) is a 1984 Icelandic- Swedish adventure film written and directed by Hrafn Gunnlaugsson.\nThe story is set in Viking Age Iceland.\nThe film was selected as the Icelandic entry for the Best Foreign Language Film at the 57th Academy Awards, but was not accepted as a nominee.\nIn 2016, online newspaper Kjarninn voted it as the best Icelandic film of all time.\nAlthough mainly a tale of personal revenge,\" When the Raven Flies\" bears a clear resemblance to the classic Akira Kurosawa film\" Yojimbo\", sharing common plot events, characters and action sequences.\nGunnlaugsson also drew inspiration from the Sagas of Icelanders and aimed to deconstruct the Viking stereotypes, replacing them with more authentic portrayals of the Viking era.\n\" When the Raven Flies\" is the first film of the\" Raven Trilogy\"( also known as the\" Viking Trilogy\") that consists of three Viking films:\" When the Raven Flies\"( 1984, usually known as simply\" The Raven\" or\" Revenge of the Barbarians In the Shadow of the Raven\"( 1987, original Icelandic title:\" Í skugga hrafnsins\") and\" Embla\"( 1991, original Icelandic title:\" Hvíti víkingurinn\"), which is a director's cut of\" The White Viking\"."
    ],
    "gold_passages": [
      "Dani Kouyaté\nDani Kouyaté( born June 4, 1961) is a film director and griot from Burkina Faso, which the BBC describes as\" Africa's most important film- making country\".",
      "Markku Lehmuskallio\nMarkku Lehmuskallio( born 31 December 1938) is a Finnish film director, cinematographer and screenwriter.\nHe has directed 26 films since 1973.\nHis 1980 film\" The Raven's Dance\" was entered into the 30th Berlin International Film Festival, where it won an Honourable Mention.",
      "The Raven's Dance\nThe Raven's Dance is a 1980 Finnish film directed by Markku Lehmuskallio.\nIt was entered into the 30th Berlin International Film Festival, where it won an Honourable Mention.",
      "Keïta! l'Héritage du griot\nKeïta!\nl'Héritage du griot (English title: \"Keita!\nVoice of the Griot \") is a 1995 Burkinabé drama film directed by Dani Kouyaté and starring Sotigui Kouyaté."
    ]
  },
  {
    "query": "When did Jean Martin (Singer)'s husband die?",
    "gold_answer": "1983",
    "generated_answer": "2002",
    "retrieved_passages": [
      "Jean Martin (singer)\nJean Martin (1919–2004) was an American singer and actor.\nBorn in Texas, she moved to New York and worked in radio and television during the 1950s.\nShe was married to William Black, who was the founder of the Chock full o'Nuts restaurant chain and coffee brand.",
      "Carla Martin\nCarla Jean Martin( born c. 1954) is an American lawyer.",
      "Stan Rice\nStan Rice( November 7, 1942 – December 9, 2002) was an American poet and artist.\nHe was the husband of author Anne Rice.",
      "John Litel\nJohn Beach Litel( December 30, 1892 – February 3, 1972) was an American film and television actor.",
      "Edmond T. Gréville\nEdmond T. Gréville (real name Edmond Gréville Thonger,\n20 June 1906 Nice – 26 May 1966\n, Nice) was a French film director and screenwriter.\nHe was married to the actress Vanda Gréville.",
      "John Middleton Murry Jr.\nJohn Middleton Murry Jr. (9 May 1926 – 31 March 2002) was an English writer who used the names Colin Murry and Richard Cowper.",
      "Madame Pasca\nAlice Marie Angèle Pasquier (November 16, 1833 – May 25, 1914), better known by her stage name Madame Pasca and also known as Alix-Marie Pasquier, was a French stage actress.",
      "Jean Pasquerel\nJean Pasquerel( c. 1400) was an Augustinian friar( member of the Order of St. Augustine), almoner and confessor of Joan of Arc.",
      "Marie-Louise Coidavid\nMarie Louise Coidavid( 1778 – March 11, 1851), was the Queen of the Kingdom of Haiti 1811 – 20 as the spouse of Henri I of Haiti.",
      "Julia Crawford Ivers\nJulia Crawford Ivers( October 3, 1869 – May 8, 1930) was an American motion picture pioneer."
    ],
    "gold_passages": [
      "William Black (businessman)\nWilliam Black (c. 1902 – March 7, 1983) was an American businessman and philanthropist who founded Chock full o'Nuts.\nHe was known as a considerate employer who provided benefits, such as medical insurance, pension plans and bonuses, for his predominantly African-American employees.\nHe also donated millions of dollars to medical research.",
      "Jean Martin (singer)\nJean Martin (1919–2004) was an American singer and actor.\nBorn in Texas, she moved to New York and worked in radio and television during the 1950s.\nShe was married to William Black, who was the founder of the Chock full o'Nuts restaurant chain and coffee brand."
    ]
  },
  {
    "query": "Which film has the director who died earlier, Tangled Destinies or The Daltons' Women?",
    "gold_answer": "Tangled Destinies",
    "generated_answer": "Tangled Destinies",
    "retrieved_passages": [
      "Tangled Destinies\nTangled Destinies is a 1932 American film directed by Frank R. Strayer.\nThe film is also known as Who Killed Harvey Forbes?\nin the United Kingdom.",
      "William C. McGann\nWilliam C. McGann( April 15, 1893 – November 15, 1977) was an American film director.\nHe directed 52 films between 1930 and 1942.\nHe was born in Pittsburgh, Pennsylvania and died in Los Angeles, California.",
      "Lew Landers\nLew Landers( born Louis Friedlander, January 2, 1901 – December 16, 1962) was an American independent film and television director.",
      "The Daltons Ride Again\nThe Daltons Ride Again is a 1945 American Western film directed by Ray Taylor.\nIt stars Lon Chaney Jr., Alan Curtis, and Kent Taylor.\nIt was made by Universal Pictures.",
      "The Daltons' Women\nThe Daltons' Women is a 1950 American film directed by Thomas Carr starring Lash LaRue and Al \"Fuzzy\" St. John.\nIt was the seventh of LaRue's films for Ron Ormond's Western Adventures Productions Inc..\nThe film was the first to be released by Howco, Ron Ormond's new film company composed of Ormond and drive-in movie owners Joy N. Houck and J. Francis White, and director Thomas Carr's first film in the Lash LaRue series.\nThe film features appearances by several well known stars such as Jack Holt, Tom Tyler and Tom Neal and a lengthier running time of 77 minutes featuring a multitude of musical numbers, juggling, and a lengthy catfight.\nThough the Women of the title have little to do with the narrative of the film, \"the frontier's first dance hall belles\" were played up in the publicity with the original film trailer giving Lash LaRue last billing.\nThe film was shot at the Iverson Movie Ranch.",
      "Wunna\nMaung Wunna  was a two-time Myanmar Motion Picture Academy Awards-winning Burmese director and writer.\nHe came from a family heavily involved in the entertainment industry—his father Thadu was a director and his brother Thu Maung was a prominent singer and actor and Min Lu was a reputed satirist.\nMaung Wunna died of lung cancer in 2011.",
      "Rachel Feldman\nRachel Feldman( born August 22, 1954) is an American director of film and television and screenwriter of television films.",
      "Mieczysław Krawicz\nMieczysław Krawicz( 1893–1944) was a Polish film director from Warsaw.",
      "Julia Crawford Ivers\nJulia Crawford Ivers( October 3, 1869 – May 8, 1930) was an American motion picture pioneer.",
      "G. Marthandan\nG. Marthandan is an Indian film director who works in Malayalam cinema."
    ],
    "gold_passages": [
      "Tangled Destinies\nTangled Destinies is a 1932 American film directed by Frank R. Strayer.\nThe film is also known as Who Killed Harvey Forbes?\nin the United Kingdom.",
      "The Daltons' Women\nThe Daltons' Women is a 1950 American film directed by Thomas Carr starring Lash LaRue and Al \"Fuzzy\" St. John.\nIt was the seventh of LaRue's films for Ron Ormond's Western Adventures Productions Inc..\nThe film was the first to be released by Howco, Ron Ormond's new film company composed of Ormond and drive-in movie owners Joy N. Houck and J. Francis White, and director Thomas Carr's first film in the Lash LaRue series.\nThe film features appearances by several well known stars such as Jack Holt, Tom Tyler and Tom Neal and a lengthier running time of 77 minutes featuring a multitude of musical numbers, juggling, and a lengthy catfight.\nThough the Women of the title have little to do with the narrative of the film, \"the frontier's first dance hall belles\" were played up in the publicity with the original film trailer giving Lash LaRue last billing.\nThe film was shot at the Iverson Movie Ranch.",
      "Thomas Carr (director)\nThomas Carr( July 4, 1907 – April 23, 1997) was an American actor and film director of Hollywood movies and television programs.\nOften billed as\" Tommy Carr\", he later adopted his more formal\" Thomas Carr\" birth name as his billing name.",
      "Frank R. Strayer\nFrank R. Strayer( September 21, 1891 – February 3, 1964) was an actor, film writer, director and producer.\nHe was active from the mid-1920s until the early 1950s."
    ]
  },
  {
    "query": "Which film was released earlier, Moment Of Danger or The Ballad Of Josie?",
    "gold_answer": "Moment Of Danger",
    "generated_answer": "Moment of Danger",
    "retrieved_passages": [
      "The Ballad of Josie\nThe Ballad of Josie is a 1967 Technicolor American comedy western film directed by Andrew V. McLaglen and starring Doris Day, Peter Graves and George Kennedy.\nIt humorously tackles 1960s themes of feminism in a traditional Western setting.\nThe film featured the last acting role for William Talman.\nIt was filmed on two locations in Thousand Oaks, California: North Ranch and Wildwood Regional Park.",
      "Moment of Danger\nMoment of Danger( also known as Malaga) is a 1960 crime drama film starring Trevor Howard, Dorothy Dandridge and Edmund Purdom.\nIt was filmed in Europe in the late months of 1959.\nThe film is based on the novel by Donald Mackenzie, and it was brought to the screen by David D. Osborn.\nThe film proved to be the final completed film for Dorothy Dandridge.",
      "When Were You Born\nWhen Were You Born is a 1938 murder mystery film directed by William C. McGann and starring Anna May Wong as an astrologer who helps the police.\nEach of the twelve principal characters was born under a different astrological sign.",
      "Battle in Outer Space\nThe film was released theatrically in the United States in the summer of 1960 by Columbia Pictures.",
      "The Wonderful World of Captain Kuhio\nThe film was released in Japan on 10 October 2009.",
      "Julia Crawford Ivers\nJulia Crawford Ivers( October 3, 1869 – May 8, 1930) was an American motion picture pioneer.",
      "William C. McGann\nWilliam C. McGann( April 15, 1893 – November 15, 1977) was an American film director.\nHe directed 52 films between 1930 and 1942.\nHe was born in Pittsburgh, Pennsylvania and died in Los Angeles, California.",
      "The Strange Case of the Man and the Beast\nThe Strange Case of the Man and the Beast( Spanish: El Extraño caso del hombre y la bestia) is a 1951 Argentine film.",
      "Lloyd (film)\nLloyd is a 2001 American comedy film.\nThe film was released on May 4, 2001.",
      "David Lynch\nDavid Keith Lynch (born January 20, 1946) is an American filmmaker, painter, musician, actor, and photographer.\nHe is best known for films such as \"Eraserhead\" (1977), \"Blue Velvet\" (1986) and \"Mulholland Drive\" (2001), often regarded by critics as among the best films of their respective decades, and for his successful 1990–91 television series \"Twin Peaks\", which led to him being labeled \"the first popular Surrealist\" by noted film critic Pauline Kael.\nA recipient of an Academy Honorary Award in 2019, he has received three Academy Award nominations for Best Director, and has won France's César Award for Best Foreign Film twice, as well as the Palme d'Or at the Cannes Film Festival and a Golden Lion award for lifetime achievement at the Venice Film Festival.\nHe has been described by \"The Guardian\" as \"the most important director of this era\", while AllMovie called him \"the Renaissance man of modern American filmmaking\".\nBorn to a middle-class family in Missoula, Montana, Lynch spent his childhood traveling around the United States before he studied painting at the Pennsylvania Academy of Fine Arts in Philadelphia, where he first made the transition to producing short films.\nHe moved to Los Angeles, where he produced his first motion picture, the surrealist horror film \"Eraserhead\" (1977).\nAfter \"Eraserhead\" became a success on the midnight movie circuit, Lynch was employed to direct the biographical film \"The Elephant Man\" (1980), from which he gained mainstream success.\nHe was then employed by the De Laurentiis Entertainment Group and proceeded to make two films: the science-fiction epic \"Dune\" (1984), which proved to be a critical and commercial failure, and then a neo-noir mystery film \"Blue Velvet\" (1986), which stirred controversy over its violence but later grew in critical reputation.\nNext, Lynch created his own television series with Mark Frost, the popular murder mystery entitled \"Twin Peaks\" (1990–1991).\nHe also created a cinematic prequel,  (1992), a road film \"Wild at Heart\" (1990) and a family film \"The Straight Story\" (1999) in the same period.\nTurning further towards surrealist filmmaking, three of his subsequent films operated on dream logic non-linear narrative structures: \"Lost Highway\" (1997), \"Mulholland Drive\" (2001), and \"Inland Empire\" (2006).\nMeanwhile, Lynch embraced the Internet as a medium, producing several web-based shows, such as the animated \"DumbLand\" (2002) and the surreal sitcom \"Rabbits\" (2002).\nLynch and Frost reunited for a third season of \"Twin Peaks\", airing in on Showtime in 2017.\nLynch co-wrote and directed every episode, as well as reprising his role as Gordon Cole.\nLynch's other artistic endeavours include: his work as a musician, encompassing three studio albums—\"BlueBOB\" (2001), \"Crazy Clown Time\" (2011) and \"The Big Dream\" (\n2013)—as well as music and sound design for a variety of his films; painting and photography; writing three books—\"Images\" (1994), \"Catching the Big Fish\" (2006), and \"Room to Dream\" (2018); and directing several music videos and advertisements, including the Dior promotional film \"Lady Blue Shanghai\" (2006).\nAn avid practitioner of Transcendental Meditation (TM), Lynch founded the David Lynch Foundation in 2005, which sought to fund the teaching of TM in schools and has since widened its scope to other at-risk populations, including the homeless, veterans and refugees.\nIn 2019, he received an Academy Honorary Award; his first Oscar win."
    ],
    "gold_passages": [
      "The Ballad of Josie\nThe Ballad of Josie is a 1967 Technicolor American comedy western film directed by Andrew V. McLaglen and starring Doris Day, Peter Graves and George Kennedy.\nIt humorously tackles 1960s themes of feminism in a traditional Western setting.\nThe film featured the last acting role for William Talman.\nIt was filmed on two locations in Thousand Oaks, California: North Ranch and Wildwood Regional Park.",
      "Moment of Danger\nMoment of Danger( also known as Malaga) is a 1960 crime drama film starring Trevor Howard, Dorothy Dandridge and Edmund Purdom.\nIt was filmed in Europe in the late months of 1959.\nThe film is based on the novel by Donald Mackenzie, and it was brought to the screen by David D. Osborn.\nThe film proved to be the final completed film for Dorothy Dandridge."
    ]
  },
  {
    "query": "What nationality is the director of film World And Time Enough?",
    "gold_answer": "United States",
    "generated_answer": "Kannada",
    "retrieved_passages": [
      "M. Venkataraju\nM Venkataraju, was a music director/ composer of Kannada film world.",
      "Hanro Smitsman\nHanro Smitsman, born in 1967 in Breda( Netherlands), is a writer and director of film and television.",
      "World and Time Enough\nWorld and Time\nEnough is a 1994 independent gay-themed romantic comedy-drama written and directed by Eric Mueller and starring Gregory Giles, Matt Guidry and Kraig Swartz.\nIt was filmed on location in Edina and Minneapolis, Minnesota.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Hassan Zee\nHassan Zee is a Pakistani- American film director who was born in Chakwal, Pakistan.",
      "G. Marthandan\nG. Marthandan is an Indian film director who works in Malayalam cinema.",
      "Gu Changwei\nGu Changwei (born 12 December 1957) is a Chinese cinematographer and film director.\nGu was born in Xi'an, Shaanxi in the People's Republic of China.\nGu is considered one of the major Chinese cinematographers working today.",
      "Dana Blankstein\nDana Blankstein- Cohen( born March 3, 1981) is the director of the Israeli Academy of Film and Television.\nShe is a film director, and an Israeli culture entrepreneur."
    ],
    "gold_passages": [
      "World and Time Enough\nWorld and Time\nEnough is a 1994 independent gay-themed romantic comedy-drama written and directed by Eric Mueller and starring Gregory Giles, Matt Guidry and Kraig Swartz.\nIt was filmed on location in Edina and Minneapolis, Minnesota.",
      "Eric Mueller\nEric C. Mueller (born November 6, 1970) is a former Olympic and National team rower, representing the United States at the 1996 and 2000 Olympics.\nHe was born in Kansas City, Missouri.\nMueller, one of the most successful men's rowers in Wisconsin history, begins his third season as the Badgers' freshmen coach.\nMueller returns to Madison for the second time as an assistant coach.\nHe spent 1998–99 as the assistant varsity coach, before leaving to train for the 2000 Olympic Summer Games in Sydney, Australia.\nDuring his previous stint, he was responsible for the Badgers' small boats and led them to four gold medals and one silver medal at the Intercollegiate Rowing Association national championships.\nThe result helped Wisconsin begin a four-year run as winners of the Ten Eyck Trophy as national team points champion.\nSince his return, the UW freshmen have improved from a bottom six national finish in the year before his joining the program to a return to the national grand finals.\nAs a rower, Mueller secured three letters at Wisconsin while a member of the varsity eight from 1991–93.\nAt national championships during his career, the boat placed sixth, once, and ninth, twice.\nA Cedarburg, native\n, Mueller earned a bachelor's degree in mechanical engineering from Wisconsin in 1994.\nFollowing his Badger career, Mueller went on to win an Olympic silver medal in the men's quadruple sculls in 1996 in Atlanta.\nHe also placed fifth at the 2000 Olympics with the men's four.\nU.S. national team member in 1995, ‘96, ‘00, ‘01 and ‘02\n, he was part of the men's eight champion at the 2002 World Cup in Lucerne, Switzerland, and finished third at the 2002 World Championships in Seville, Spain.\nHis men's four took fourth at the 2001 World Championships, while his men's eight was a bronze medalist at the 2000 World Cup, again in Lucerne.\nHe also won a bronze medal with the men's quadruple sculls in Lucerne at the 1996 World Cup."
    ]
  },
  {
    "query": "Which film has the director died earlier, Poker In Bed or The Machine To Kill Bad People?",
    "gold_answer": "The Machine To Kill Bad People",
    "generated_answer": "La Macchina ammazzacattivi",
    "retrieved_passages": [
      "Poker in Bed\nLa signora gioca bene a scopa?, internationally released as Poker in Bed, is a 1974 commedia sexy all'italiana directed by Giuliano Carnimeo.",
      "The Machine to Kill Bad People\nThe Machine to Kill Bad People( Italian: La Macchina ammazzacattivi) is a 1952 Italian fantasy comedy film directed by Roberto Rossellini and featuring Marilyn Buferd, William Tubbs and Clara Bindi.\nIt is part of the tradition of neorealism of the post-war years.\nHaving helped neorealism gain international recognition with his 1945 work\" Rome, Open City\", Rossellini was trying to branch out into different styles.",
      "Tangled Destinies\nTangled Destinies is a 1932 American film directed by Frank R. Strayer.\nThe film is also known as Who Killed Harvey Forbes?\nin the United Kingdom.",
      "William C. McGann\nWilliam C. McGann( April 15, 1893 – November 15, 1977) was an American film director.\nHe directed 52 films between 1930 and 1942.\nHe was born in Pittsburgh, Pennsylvania and died in Los Angeles, California.",
      "Lucio Fulci\nLucio Fulci( 17 June 1927 – 13 March 1996) was an Italian film director, screenwriter, producer, and actor.\nAlthough he worked in a wide array of genres through a career spanning nearly five decades, including comedy, spaghetti western, adventure, science fiction and erotica, he garnered an international cult following for his giallo and horror films.\nHis most notable films include the\" Gates of Hell\" trilogy —\" City of the Living Dead\"( 1980),\" The Beyond\"( 1981), and\" The House by the Cemetery\"( 1981) —as well as\" Massacre Time\"( 1966),\" One on Top of the Other\"( 1969),\" A Lizard in a Woman's Skin\"( 1971),\" Do n't Torture a Duckling\"( 1972),\" White Fang\"( 1973),\" Four of the Apocalypse\"( 1975),\" Sette note in nero\"( 1977),\" Zombi 2\"( 1979),\" Contraband\"( 1980),\" The Black Cat\"( 1981),\" The New York Ripper\"( 1982),\" Murder Rock\"( 1984), and\" A Cat in the Brain\"( 1990).\nBecause of the high level of visceral graphic violence present in many of his films, especially\" Zombi 2\" and\" The Beyond\", Fulci is frequently referred to as\" The Godfather of Gore\", a title also given to Herschell Gordon Lewis.\nFulci was in his young adult years a politically active radical for the Italian Communist Party.",
      "A Lover in Pawn\nA Lover in Pawn is a 1920 Swedish silent drama film directed by Victor Sjöström.",
      "A Quiet Place to Kill\nA Quiet Place to Kill is a 1970\" giallo\" film directed by Umberto Lenzi.",
      "The Castle of Fu Manchu\nThe Castle of Fu Manchu( also known as The Torture Chamber of Dr. Fu Manchu and also known by its German title Die Folterkammer des Dr. Fu Man Chu) is a 1969 film and the fifth and final Dr. Fu Manchu film with Christopher Lee portraying the title character.",
      "Carl Boese\nCarl Boese( 26 August 1887 – 6 July 1958) was a German film director, screenwriter and producer.\nHe directed 158 films between 1917 and 1957.",
      "News in Hell\nNews in Hell is a 1959 Argentine film directed by Román Viñoly Barreto."
    ],
    "gold_passages": [
      "Giuliano Carnimeo\nGiuliano Carnimeo (4 July 1932 – 10 September 2016) was an Italian director and screenwriter, sometimes credited as Anthony Ascott.",
      "The Machine to Kill Bad People\nThe Machine to Kill Bad People( Italian: La Macchina ammazzacattivi) is a 1952 Italian fantasy comedy film directed by Roberto Rossellini and featuring Marilyn Buferd, William Tubbs and Clara Bindi.\nIt is part of the tradition of neorealism of the post-war years.\nHaving helped neorealism gain international recognition with his 1945 work\" Rome, Open City\", Rossellini was trying to branch out into different styles.",
      "Roberto Rossellini\nRoberto Gastone Zeffiro Rossellini( 8 May 1906 – 3 June 1977) was an Italian film director, screenwriter, and producer.\nRossellini was one of the directors of the Italian neorealist cinema, contributing to the movement with films such as\" Rome, Open City\"( 1945),\" Paisan\"( 1946),\" Germany, Year Zero\"( 1948), and\" General Della Rovere\"( 1959).",
      "Poker in Bed\nLa signora gioca bene a scopa?, internationally released as Poker in Bed, is a 1974 commedia sexy all'italiana directed by Giuliano Carnimeo."
    ]
  },
  {
    "query": "Which film whose director is younger, Heads I Win, Tails You Lose or The Incredible Sarah?",
    "gold_answer": "Heads I Win, Tails You Lose",
    "generated_answer": "Rachel Feldman",
    "retrieved_passages": [
      "Heads I Win, Tails You Lose\nHeads I Win, Tails You Lose( also known as\" Heads or Tails\") is a 1982 Italian comedy film written and directed by Nanni Loy.\nThe film consists in two back- to- back stories that deals with two\" taboo\" themes, the celibacy of the clergy in the episode of Renato Pozzetto and the homosexuality in the one with Nino Manfredi.",
      "Hanro Smitsman\nHanro Smitsman, born in 1967 in Breda( Netherlands), is a writer and director of film and television.",
      "Rachel Feldman\nRachel Feldman( born August 22, 1954) is an American director of film and television and screenwriter of television films.",
      "William C. McGann\nWilliam C. McGann( April 15, 1893 – November 15, 1977) was an American film director.\nHe directed 52 films between 1930 and 1942.\nHe was born in Pittsburgh, Pennsylvania and died in Los Angeles, California.",
      "The Incredible Sarah\nThe Incredible Sarah is a 1976 British drama film directed by Richard Fleischer and starring Glenda Jackson.\nIt presents a dramatization of the acting career of Sarah Bernhardt.",
      "Charles Saunders (director)\nCharles Joel Saunders (8 April 1904 – April 1997) was an English film director and screenwriter who started in the industry as a film editor, and who also contributed to television.\nHe was the brother of the theatrical producer Sir Peter Saunders.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Peter Levin\nPeter Levin is an American director of film, television and theatre."
    ],
    "gold_passages": [
      "The Incredible Sarah\nThe Incredible Sarah is a 1976 British drama film directed by Richard Fleischer and starring Glenda Jackson.\nIt presents a dramatization of the acting career of Sarah Bernhardt.",
      "Nanni Loy\nNanni Loy( born Giovanni Loi; 23 October 1925 – 21 August 1995) was an Italian film, theatre and TV director.\nSpecifically, Nanni Loy was Sardinian, and one of several notable Sardinian film makers, including Franco Solinas.\nLoy was born in Cagliari, Sardinia: his father was Guglielmo Loy- Donà, a lawyer issue from a distinguished Sardinian- Venetian family, and his mother was the noblewoman Donna Anna Sanjust of the Marquesses of Neoneli.\nRosetta Loy, an Italian novelist, is his sister- in- law.\nHe became famous for introducing in Italy the candid camera with his show\" Specchio segreto\"( Secret mirror) in 1965.\nHis 1962 film\" The Four Days of Naples\" was nominated for two Academy Awards.\nIt also won the FIPRESCI Prize at the 3rd Moscow International Film Festival in 1963.\nHis 1971 film\" Detenuto in attesa di giudizio\" was entered into the 22nd Berlin International Film Festival.\nThe star, Alberto Sordi, won the Silver Bear for Best Actor award.\nHe specialized in comedy films such as\" Padre di famiglia\" but he also shot film dealing with social themes(\" Detenuto in attesa di giudizio\" and\" Sistemo l' America e torno\").\nLoy died at Fregene, near Rome, in 1995.",
      "Richard Fleischer\nRichard O. Fleischer( December 8, 1916 – March 25, 2006) was an American film director known for such movies as\" The Narrow Margin\"( 1952),\" 20,000 Leagues Under the Sea\"( 1954),\" Fantastic Voyage\"( 1966), the Oscar- award winning musical film\" Doctor Dolittle\"( 1967) and\" Soylent Green\"( 1973).",
      "Heads I Win, Tails You Lose\nHeads I Win, Tails You Lose( also known as\" Heads or Tails\") is a 1982 Italian comedy film written and directed by Nanni Loy.\nThe film consists in two back- to- back stories that deals with two\" taboo\" themes, the celibacy of the clergy in the episode of Renato Pozzetto and the homosexuality in the one with Nino Manfredi."
    ]
  },
  {
    "query": "Who is Catherine Of Pomerania, Countess Palatine Of Neumarkt's father-in-law?",
    "gold_answer": "Rupert",
    "generated_answer": "John, Count Palatine of Neumarkt",
    "retrieved_passages": [
      "Catherine of Pomerania, Countess Palatine of Neumarkt\nCatherine of Pomerania\n(German: \"\nKatharina von Pommern\"; c. 1390 - 4 March 1426), was a Pomeranian princess and Countess Palatine of Neumarkt.\nShe was the wife of John, Count Palatine of Neumarkt and the mother of Christopher of Bavaria, who would rule over Denmark, Sweden, and Norway as king of the Kalmar Union.",
      "Countess Palatine Magdalene Catherine of Zweibrücken\nMagdalena Catherine, Countess Palatine of Zweibrücken( 26 April 1607, Zweibrücken – 20 January 1648, Strasbourg) was a Countess Palatine of Zweibrücken by birth and by marriage Duchess and Countess Palatine of Birkenfeld.",
      "Countess Palatine Anna Magdalena of Birkenfeld-Bischweiler\nCountess Palatine Anna Magdalena of Birkenfeld- Bischweiler( 14 February 1640, Strasbourg – 12 December 1693, Babenhausen) was a daughter of Christian I, Count Palatine of Birkenfeld- Bischweiler( 1598 – 1654) and his first wife, Countess Palatine Magdalene Catherine of Zweibrücken( 1606 – 1648).",
      "Countess Palatine Dorothea Catherine of Birkenfeld-Bischweiler\nCountess Palatine Dorothea Catherine of Birkenfeld-Bischweiler (3 July 1634 – 7 December 1715) was a Countess Palatine of Zweibrücken-Birkenfeld-Bischweiler by birth and, by marriage, Countess of Nassau-Ottweiler.",
      "Countess Palatine Anna Maria of Neuburg\nCountess Palatine Anna Maria of Neuburg( 18 August 1575, Neuburg an der Donau – 11 February 1643, Dornburg) was Countess Palatine of Neuburg and by marriage Duchess of Saxe- Weimar.",
      "Gertrude of Bavaria\nGertrude of Saxony and Bavaria( 1152/55–1197) was Duchess of Swabia as the spouse of Duke Frederick IV, and Queen of Denmark as the spouse of King Canute VI.",
      "Elisabeth of Hesse, Countess Palatine of Zweibrücken\nElisabeth of Hesse (4 March 1503 – 4 January 1563, Lauingen) was a Landgravine of Hesse by birth and by marriage Countess Palatine of Zweibrücken and later Countess Palatine of Simmern.",
      "John, Count Palatine of Neumarkt\nJohn (Johann von Pfalz-Neumarkt; 1383 – 14 March 1443) was the Count Palatine of Neumarkt from 1410 to his death.\nThe son of Rupert III of the Palatinate, he married Catherine of Pomerania in 1407.\nHe is mainly known for his crushing victory against the Hussites at the Battle of Hiltersried in 1433.",
      "Princess Auguste of Bavaria (1875–1964)\nPrincess Auguste of Bavaria( 28 April 1877 – 25 June 1964) was a member of the Bavarian Royal House of Wittelsbach and the spouse of Archduke Joseph August of Austria.",
      "Countess Palatine Barbara of Zweibrücken-Neuburg\nCountess Palatine Barbara of Zweibrücken-Neuburg (27 July 1559 – 5 March 1618) was a Countess Palatine of Zweibrücken by birth and by marriage Countess of Oettingen-Oettingen."
    ],
    "gold_passages": [
      "Catherine of Pomerania, Countess Palatine of Neumarkt\nCatherine of Pomerania\n(German: \"\nKatharina von Pommern\"; c. 1390 - 4 March 1426), was a Pomeranian princess and Countess Palatine of Neumarkt.\nShe was the wife of John, Count Palatine of Neumarkt and the mother of Christopher of Bavaria, who would rule over Denmark, Sweden, and Norway as king of the Kalmar Union.",
      "John, Count Palatine of Neumarkt\nJohn (Johann von Pfalz-Neumarkt; 1383 – 14 March 1443) was the Count Palatine of Neumarkt from 1410 to his death.\nThe son of Rupert III of the Palatinate, he married Catherine of Pomerania in 1407.\nHe is mainly known for his crushing victory against the Hussites at the Battle of Hiltersried in 1433."
    ]
  },
  {
    "query": "Who is Marie Zéphyrine Of France's paternal grandmother?",
    "gold_answer": "Marie Leszczyńska",
    "generated_answer": "Maria Josepha of Saxony",
    "retrieved_passages": [
      "Marie Zéphyrine of France\nMarie Zéphyrine of France (26 August 1750 – 2 September 1755) was a French princess, the daughter of Louis, Dauphin of France, and Maria Josepha of Saxony.\nMarie Zéphyrine, known as \"Madame Royale\" or \"la Petite Madame\", was born at the Palace of Versailles and was named after St Zephyrinus, on whose feast day she was born.\nHer birth was greeted with caution; in the previous two years, Maria Josepha had suffered stillbirths and her health was of a fragile nature.\nLouis XV, on the other hand, had hoped for a grandson.\nMarie Isabelle de Rohan served as Marie Zéphyrine's governess.\nMarie Zéphyrine died at Versailles due to an attack of convulsions, in the early hours of the morning of 2 September, having been baptised just days before by the Abbot of Chabannes.\nShe was not officially mourned; a French princess could only be mourned if she was over the age of 7.\nShe was buried at the Royal Basilica of Saint Denis outside the capital of Paris.",
      "Princess Marie of Hanover\nPrincess Marie of Hanover (2 December 1849 – 4 June 1904) was the younger daughter of King George V of Hanover and of his wife, Princess Marie of Saxe-Altenburg.",
      "Marie Charlotte de La Trémoille\nMarie Charlotte de La Trémoille( 26 January 1632 – 24 August 1682). was a French noblewoman member of the House of La Trémoille and by marriage Duchess of Saxe- Jena.\nBorn in Thouars, she was the fifth of six children born from the marriage of Henri III de La Trémoille, 3rd Duke of Thouars, 2nd Duke of La Tremoille, Prince of Talmond and Taranto, and Marie de La Tour d'Auvergne.",
      "Princess Auguste of Bavaria (1875–1964)\nPrincess Auguste of Bavaria( 28 April 1877 – 25 June 1964) was a member of the Bavarian Royal House of Wittelsbach and the spouse of Archduke Joseph August of Austria.",
      "Guillaume Wittouck\nGuillaume Wittouck( 1749- 1829) was a Belgian lawyer and High Magistrate.\nHe was the Grandfather of industrialist Paul Wittouck.",
      "Maria Teresa, Grand Duchess of Luxembourg\nMaria Teresa, Grand Duchess of Luxembourg( born María Teresa Mestre y Batista; on 22 March 1956), is the spouse of Grand Duke Henri.",
      "Marie-Louise Coidavid\nMarie Louise Coidavid( 1778 – March 11, 1851), was the Queen of the Kingdom of Haiti 1811 – 20 as the spouse of Henri I of Haiti.",
      "Countess Palatine Magdalene Catherine of Zweibrücken\nMagdalena Catherine, Countess Palatine of Zweibrücken( 26 April 1607, Zweibrücken – 20 January 1648, Strasbourg) was a Countess Palatine of Zweibrücken by birth and by marriage Duchess and Countess Palatine of Birkenfeld.",
      "Jean Bretagne Charles de La Trémoille\nPrince Jean-Bretagne-Charles de La Trémoille (5 February 1737 – 19 May 1792), 7th Duke of Thouars, was a French soldier and the son of Charles Armand René de La Trémoille and his wife, Marie Hortense de La Tour d'Auvergne of Bouillon.",
      "Diana Guardato\nDiana Guardato was a member of the aristocratic Patrician Guardato family, and had three children with King Ferdinand I: Diana Guardato is the 16th- Great Grandmother of His Royal Highness Albert II of Belgium, 15th- Great Grandmother of His Majesty Juan Carlos\nI of Spain, 17th- Great Grandmother of Philippe of Belgium, 14th- Great Grandmother of His Majesty Manuel II of Portugal, 16th- Great Grandmother of Grand Duke Henri, as well as many others."
    ],
    "gold_passages": [
      "Louis, Dauphin of France (son of Louis XV)\nLouis, Dauphin of France (4 September 1729 – 20 December 1765) was the elder and only surviving son of King Louis XV of France and his wife, Queen Marie Leszczyńska.\nHe had a younger brother, Philippe, who died as a toddler.\nAs a son of the king, Louis was a \"fils de France\".\nAs heir apparent, he became Dauphin of France.\nHowever, he died before ascending to the throne.\nThree of his sons became kings of France:\nLouis XVI (reign: 1774–1792), Louis XVIII (reign: 1814–1815; 1815–1824) and Charles X (reign: 1824–1830).",
      "Marie Zéphyrine of France\nMarie Zéphyrine of France (26 August 1750 – 2 September 1755) was a French princess, the daughter of Louis, Dauphin of France, and Maria Josepha of Saxony.\nMarie Zéphyrine, known as \"Madame Royale\" or \"la Petite Madame\", was born at the Palace of Versailles and was named after St Zephyrinus, on whose feast day she was born.\nHer birth was greeted with caution; in the previous two years, Maria Josepha had suffered stillbirths and her health was of a fragile nature.\nLouis XV, on the other hand, had hoped for a grandson.\nMarie Isabelle de Rohan served as Marie Zéphyrine's governess.\nMarie Zéphyrine died at Versailles due to an attack of convulsions, in the early hours of the morning of 2 September, having been baptised just days before by the Abbot of Chabannes.\nShe was not officially mourned; a French princess could only be mourned if she was over the age of 7.\nShe was buried at the Royal Basilica of Saint Denis outside the capital of Paris."
    ]
  },
  {
    "query": "Which film has the director died earlier, Condemned Women or Faces In The Dark?",
    "gold_answer": "Condemned Women",
    "generated_answer": "Condemned Women",
    "retrieved_passages": [
      "Condemned Women\nCondemned Women is a 1938 American drama film directed by Lew Landers and written by Lionel Houser.\nThe film stars Sally Eilers, Louis Hayward, Anne Shirley, Esther Dale and Lee Patrick.\nThe film was released on March 18, 1938.",
      "William C. McGann\nWilliam C. McGann( April 15, 1893 – November 15, 1977) was an American film director.\nHe directed 52 films between 1930 and 1942.\nHe was born in Pittsburgh, Pennsylvania and died in Los Angeles, California.",
      "Lucio Fulci\nLucio Fulci( 17 June 1927 – 13 March 1996) was an Italian film director, screenwriter, producer, and actor.\nAlthough he worked in a wide array of genres through a career spanning nearly five decades, including comedy, spaghetti western, adventure, science fiction and erotica, he garnered an international cult following for his giallo and horror films.\nHis most notable films include the\" Gates of Hell\" trilogy —\" City of the Living Dead\"( 1980),\" The Beyond\"( 1981), and\" The House by the Cemetery\"( 1981) —as well as\" Massacre Time\"( 1966),\" One on Top of the Other\"( 1969),\" A Lizard in a Woman's Skin\"( 1971),\" Do n't Torture a Duckling\"( 1972),\" White Fang\"( 1973),\" Four of the Apocalypse\"( 1975),\" Sette note in nero\"( 1977),\" Zombi 2\"( 1979),\" Contraband\"( 1980),\" The Black Cat\"( 1981),\" The New York Ripper\"( 1982),\" Murder Rock\"( 1984), and\" A Cat in the Brain\"( 1990).\nBecause of the high level of visceral graphic violence present in many of his films, especially\" Zombi 2\" and\" The Beyond\", Fulci is frequently referred to as\" The Godfather of Gore\", a title also given to Herschell Gordon Lewis.\nFulci was in his young adult years a politically active radical for the Italian Communist Party.",
      "Carl Boese\nCarl Boese( 26 August 1887 – 6 July 1958) was a German film director, screenwriter and producer.\nHe directed 158 films between 1917 and 1957.",
      "Mieczysław Krawicz\nMieczysław Krawicz( 1893–1944) was a Polish film director from Warsaw.",
      "Lew Landers\nLew Landers( born Louis Friedlander, January 2, 1901 – December 16, 1962) was an American independent film and television director.",
      "Giuliano Carnimeo\nGiuliano Carnimeo (4 July 1932 – 10 September 2016) was an Italian director and screenwriter, sometimes credited as Anthony Ascott.",
      "News in Hell\nNews in Hell is a 1959 Argentine film directed by Román Viñoly Barreto.",
      "Tangled Destinies\nTangled Destinies is a 1932 American film directed by Frank R. Strayer.\nThe film is also known as Who Killed Harvey Forbes?\nin the United Kingdom.",
      "Wunna\nMaung Wunna  was a two-time Myanmar Motion Picture Academy Awards-winning Burmese director and writer.\nHe came from a family heavily involved in the entertainment industry—his father Thadu was a director and his brother Thu Maung was a prominent singer and actor and Min Lu was a reputed satirist.\nMaung Wunna died of lung cancer in 2011."
    ],
    "gold_passages": [
      "David Eady (film director)\nDavid Eady( April 22, 1924- April 5, 2009) was a British film director and producer.\nHe was born in London.",
      "Condemned Women\nCondemned Women is a 1938 American drama film directed by Lew Landers and written by Lionel Houser.\nThe film stars Sally Eilers, Louis Hayward, Anne Shirley, Esther Dale and Lee Patrick.\nThe film was released on March 18, 1938.",
      "Faces in the Dark\nFaces in the Dark is a 1960 British thriller film directed by David Eady and starring John Gregson, Mai Zetterling and John Ireland.\nThe film is based on the 1952 novel\" Les Visages de l'ombre\" by Boileau- Narcejac.\nIt was shot at Shepperton Studios with sets designed by the art director Anthony Masters.",
      "Lew Landers\nLew Landers( born Louis Friedlander, January 2, 1901 – December 16, 1962) was an American independent film and television director."
    ]
  },
  {
    "query": "Who is the spouse of the director of film Eden And After?",
    "gold_answer": "Catherine Robbe-Grillet",
    "generated_answer": "Rachel Feldman",
    "retrieved_passages": [
      "Eden and After\nEden and After  is a 1970 French-Czechoslovak drama art film directed by Alain Robbe-Grillet.\nIt was entered into the 20th Berlin International Film Festival.",
      "Catherine Jourdan\nCatherine Jourdan( 12 October 1948 – 18 February 2011) was a French actress.\nShe appeared in 22 films and television shows between 1967 and 1989.\nShe starred in the 1970 film\" Eden and After\", which was entered into the 20th Berlin International Film Festival.",
      "Rachel Feldman\nRachel Feldman( born August 22, 1954) is an American director of film and television and screenwriter of television films.",
      "Dana Blankstein\nDana Blankstein- Cohen( born March 3, 1981) is the director of the Israeli Academy of Film and Television.\nShe is a film director, and an Israeli culture entrepreneur.",
      "Dana Blankstein\nDana Blankstein- Cohen( born March 3, 1981) is the director of the Israeli Academy of Film and Television.\nShe is a film director, and an Israeli culture entrepreneur.",
      "Dana Blankstein\nDana Blankstein- Cohen( born March 3, 1981) is the director of the Israeli Academy of Film and Television.\nShe is a film director, and an Israeli culture entrepreneur.",
      "Dana Blankstein\nDana Blankstein- Cohen( born March 3, 1981) is the director of the Israeli Academy of Film and Television.\nShe is a film director, and an Israeli culture entrepreneur.",
      "Dana Blankstein\nDana Blankstein- Cohen( born March 3, 1981) is the director of the Israeli Academy of Film and Television.\nShe is a film director, and an Israeli culture entrepreneur.",
      "Dana Blankstein\nDana Blankstein- Cohen( born March 3, 1981) is the director of the Israeli Academy of Film and Television.\nShe is a film director, and an Israeli culture entrepreneur.",
      "Hassan Zee\nHassan Zee is a Pakistani- American film director who was born in Chakwal, Pakistan."
    ],
    "gold_passages": [
      "Eden and After\nEden and After  is a 1970 French-Czechoslovak drama art film directed by Alain Robbe-Grillet.\nIt was entered into the 20th Berlin International Film Festival.",
      "Alain Robbe-Grillet\nAlain Robbe-Grillet (18 August 1922 – 18 February 2008) was a French writer and filmmaker.\nHe was one of the figures most associated with the \"Nouveau Roman\" (new novel) trend of the 1960s, along with Nathalie Sarraute, Michel Butor and Claude Simon.\nAlain Robbe-Grillet was elected a member of the Académie française on 25 March 2004, succeeding Maurice Rheims at seat No. 32.\nHe was married to Catherine Robbe-Grillet (née Rstakian)."
    ]
  },
  {
    "query": "Where was the place of death of Anastasia Of Serbia's husband?",
    "gold_answer": "Hilandar",
    "generated_answer": "June 22, 1200",
    "retrieved_passages": [
      "Anastasia of Serbia\nAna ; 1196–d.\nJune 22, 1200) was the princess consort of the Serbian Principality as the wife of Stefan Nemanja (r. 1166–1196).\nShe was of noble descent.\nAna took monastic vows in 1196 and was baptized \"Anastasia\", after Anastasia of Sirmium.\nShe is venerated by the Serbian Orthodox Church as Saint Anastasija (Света Анастасија) with her feast day on June 22 (Julian calendar).",
      "Princess Helen of Serbia\nPrincess Helen of Serbia and Yugoslavia (23 October (4 November New Style) 1884 – 16 October 1962) was the daughter of King Peter I of Yugoslavia and his wife Princess Zorka of Montenegro.\nShe was the elder sister of George, Crown Prince of Serbia and King Alexander I of Yugoslavia.\nHelen was also a niece of Anastasia of Montenegro (or \"Stana\"), wife of Grand Duke Nicholas Nikolaevich of Russia, and of Milica of Montenegro, wife of Grand Duke Peter Nicolaievich of Russia, the women who introduced Grigori Rasputin to Tsarina Alexandra.",
      "Princess Victoria Melita of Saxe-Coburg and Gotha\nPrincess Victoria Melita of Saxe-Coburg and Gotha , later Grand Duchess Victoria Feodorovna of Russia (25 November 1876 – 2 March 1936) was the third child and second daughter of Alfred, Duke of Saxe-Coburg and Gotha, and Grand Duchess Maria Alexandrovna of Russia.\nShe was a granddaughter of Queen Victoria of the United Kingdom and Emperor Alexander II of Russia.\nBorn a British princess, Victoria spent her early life in England and lived in Malta for three years, where her father was serving in the Royal Navy.\nIn 1889 the family moved to Coburg, where Victoria's father became the reigning duke in 1893.\nIn her teens Victoria fell in love with her maternal first cousin Grand Duke Kirill Vladimirovich of Russia, but the disapprobation of marriage between first cousins of his faith, Orthodox Christianity, discouraged their romance.\nBowing to family pressure, Victoria married her paternal first cousin, Ernest Louis, Grand Duke of Hesse and by Rhine in 1894, following the wishes of their grandmother, Queen Victoria.\nTheir marriage was a failure.\nVictoria scandalized the royal families of Europe when she divorced her husband in 1901.\nThe couple's only child, Princess Elisabeth of Hesse and by Rhine, died of typhoid fever in 1903.\nVictoria married Grand Duke Kirill Vladimirovich in 1905.\nThey wed without the formal approval of Britain's King Edward VII, required by the Royal Marriages Act 1772, and in defiance of Tsar Nicholas II.\nIn retaliation, the Tsar stripped Kirill of his offices and honours, also initially banishing the couple from Russia.\nThey had two daughters and settled in Paris before being allowed to visit Russia in 1909.\nIn 1910 they moved to Russia, where Nicholas recognized her as Grand Duchess Victoria Feodorovna.\nAfter the fall of the Russian monarchy in 1917, they escaped to Finland (then part of the Russian Empire) where she gave birth to her only son.\nIn exile they lived for some years among her relatives in Germany, and from the late 1920s on an estate they bought in Saint-Briac.\nIn 1926, Kirill proclaimed himself emperor in exile and Victoria supported her husband's claims.\nVictoria died after suffering a stroke while visiting her daughter Maria in Amorbach.",
      "Grand Duke Nicholas Konstantinovich of Russia\nGrand Duke Nicholas Constantinovich of Russia( 14 February 1850 – 26 January 1918) was the first- born son of Grand Duke Konstantin Nikolayevich and Grand Duchess Alexandra Iosifovna of Russia and a grandson of Nicholas I of Russia.",
      "Catherine of Pomerania, Countess Palatine of Neumarkt\nCatherine of Pomerania\n(German: \"\nKatharina von Pommern\"; c. 1390 - 4 March 1426), was a Pomeranian princess and Countess Palatine of Neumarkt.\nShe was the wife of John, Count Palatine of Neumarkt and the mother of Christopher of Bavaria, who would rule over Denmark, Sweden, and Norway as king of the Kalmar Union.",
      "Dimitrije Nešić\nDimitrije Nešić( 20 October 1836, in Belgrade, Principality of Serbia – 9 May 1904, in Belgrade, Kingdom of Serbia) was a Serbian mathematician, professor at the Lyceum of the Principality of Serbia and president of the Serbian Royal Academy.",
      "Grand Duke Vyacheslav Konstantinovich of Russia\nGrand Duke Vyacheslav Konstantinovich of Russia,( 13 July 1862 – 27 February 1879), was a Romanov grand duke and the youngest son of Grand Duke Konstantin Nikolayevich of Russia and his wife Princess Alexandra of Saxe- Altenburg.\nThe English form of his first name is Wenceslas.",
      "Slavica Đukić Dejanović\nSlavica Đukić Dejanović( born 4 July 1951) is a Serbian politician, current Minister without portfolio in the Government of Serbia, and former Minister of Health in the Government of Serbia, acting Head of State of Serbia and President of the National Assembly of Serbia, and a long- time member of the Socialist Party of Serbia.\nDejanović is the second woman at the head of the National Assembly of Serbia, after Nataša Mićić, who was President of Parliament 2001- 2004, and the first one in the independent Serbia.\nIn that role she was also the Acting President of Serbia following the resignation of Boris Tadić in 2012 and was the first woman to hold the post of Head of State of Serbia since independence in 2006.",
      "Grand Duke Andrei Vladimirovich of Russia\nGrand Duke Andrei Vladimirovich of Russia ((14 May 1879 – 30 October 1956) was a son of Grand Duke Vladimir Alexandrovich of Russia, a grandson of Emperor Alexander II and a first cousin of Nicholas II, Russia’s last Tsar.\nIn 1900, he began an affair with the famous ballerina Mathilde Kschessinska, becoming the third grand duke to fall for her.\nGrand Duke Andrei followed a military career and graduated from the Alexandrovskaya Military Law academy in 1905.\nHe occupied different military positions during the reign of Tsar Nicholas II, but with no particular distinction.\nHe became senator in 1911 and was appointed Major General in the Russian Army in 1915.\nHe took part in World War I, but was away from real combat spending most of the conflict at Russia's headquarters or in idle time in Saint Petersburg.\nIn February 1917, shortly before the fall of the Russian monarchy, Grand Duke Andrei left Saint Petersburg to join his mother in Kislovodsk.\nHe remained in the Caucasus for the next three years.\nAfter the October Revolution he was briefly arrested along with his brother, Grand Duke Boris, but they escaped.\nHe departed revolutionary Russia in March 1920, being the last grand duke to leave for exile.\nIn 1921, he married his longtime mistress Mathilde Kschessinska and recognized her son as his.\nThe couple lived in the South of France until 1929 when they moved permanently to Paris, where Kschessinska opened a ballet school.\nAfter World War II, Grand Duke Andrei lived under reduced circumstances.\nUntil his death at age 77, he was the last surviving Russian grand duke born in Imperial Russia.",
      "Sophia Magdalena of Denmark\nSophia Magdalena of Denmark (3 July 1746 – 21 August 1813) was Queen of Sweden as the spouse of King Gustav III."
    ],
    "gold_passages": [
      "Anastasia of Serbia\nAna ; 1196–d.\nJune 22, 1200) was the princess consort of the Serbian Principality as the wife of Stefan Nemanja (r. 1166–1196).\nShe was of noble descent.\nAna took monastic vows in 1196 and was baptized \"Anastasia\", after Anastasia of Sirmium.\nShe is venerated by the Serbian Orthodox Church as Saint Anastasija (Света Анастасија) with her feast day on June 22 (Julian calendar).",
      "Stefan Nemanja\nStefan Nemanja (Serbian Cyrillic: Стефан Немања, ; 1113 – 13 February 1199) was the Grand Prince (Veliki Župan) of the Serbian Grand Principality (also known as Raška, lat. \"\nRascia\") from 1166 to 1196.\nA member of the Vukanović dynasty, Nemanja founded the Nemanjić dynasty, and is remembered for his contributions to Serbian culture and history, founding what would evolve into the Serbian Empire, as well as the national church.\nAccording to the Serbian Academy of Sciences and Arts, Nemanja is also among the most remarkable Serbs for his literary contributions and altruistic attributes.\nIn 1196, after three decades of warfare and negotiations which consolidated Serbia while distinguishing it from both Western and Byzantine spheres of influence, Nemanja abdicated in favor of his middle son Stefan Nemanjić, who became the first King of Serbia.\nNemanja ultimately went to Mount Athos, where he became a monk and took the name of Symeon, joining his youngest son (later known as Saint Sava), who had already become the first archbishop of the Serbian Orthodox Church.\nTogether with his son Sava, Nemanja restored the Hilandar Monastery at Mount Athos from 1198–1199, and issued the \"Charter of Hilandar\".\nThe monastery later became the cradle of the Serbian Orthodox Church.\nThe Serbian Orthodox Church canonized Stefan Nemanja shortly after his death under the name Saint Simeon\nthe Myrrh-streaming (Свети Симеон Мироточиви) after numerous miracles."
    ]
  },
  {
    "query": "Are Fire In Hell and The Tiger: An Old Hunter'S Tale from the same country?",
    "gold_answer": "yes",
    "generated_answer": "South Korean",
    "retrieved_passages": [
      "The Tiger: An Old Hunter's Tale\nThe Tiger( also known as\" The Tiger: An Old Hunter's Tale\",; lit.\" Big Tiger\") is a 2015 South Korean period action drama film about a hunter prepared to kill the last tiger of Joseon.",
      "Fire in Hell\nFire in Hell is a 2014 South Korean drama film written and directed by South Korean indie provocateur Lee Sang- woo.\nBased on a true story, it made its world premiere at the 13th Jeonju International Film Festival and its international premiere at the 34th Moscow International Film Festival in 2012.",
      "India: Kingdom of the Tiger\nIndia: Kingdom of the Tiger is a 2002 IMAX documentary, based on the writings of Jim Corbett.\nThe film was directed by Bruce Neibaur.\nIt depicts man-eating tigers and the conservation efforts of the tiger in India.",
      "Return of the Tiger\nReturn of the Tiger is a 1978 martial arts Bruceploitation film starring Bruce Li and a sequel to Exit the Dragon, Enter the Tiger.",
      "Burn in Hell\nBurn in Hell may refer to:",
      "Hell and High Water\nHell and High Water may refer to:",
      "Hell and Back\nHell and Back or Hell and Back Again or To Hell and Back may refer to:",
      "Lucio Fulci\nLucio Fulci( 17 June 1927 – 13 March 1996) was an Italian film director, screenwriter, producer, and actor.\nAlthough he worked in a wide array of genres through a career spanning nearly five decades, including comedy, spaghetti western, adventure, science fiction and erotica, he garnered an international cult following for his giallo and horror films.\nHis most notable films include the\" Gates of Hell\" trilogy —\" City of the Living Dead\"( 1980),\" The Beyond\"( 1981), and\" The House by the Cemetery\"( 1981) —as well as\" Massacre Time\"( 1966),\" One on Top of the Other\"( 1969),\" A Lizard in a Woman's Skin\"( 1971),\" Do n't Torture a Duckling\"( 1972),\" White Fang\"( 1973),\" Four of the Apocalypse\"( 1975),\" Sette note in nero\"( 1977),\" Zombi 2\"( 1979),\" Contraband\"( 1980),\" The Black Cat\"( 1981),\" The New York Ripper\"( 1982),\" Murder Rock\"( 1984), and\" A Cat in the Brain\"( 1990).\nBecause of the high level of visceral graphic violence present in many of his films, especially\" Zombi 2\" and\" The Beyond\", Fulci is frequently referred to as\" The Godfather of Gore\", a title also given to Herschell Gordon Lewis.\nFulci was in his young adult years a politically active radical for the Italian Communist Party.",
      "2008 in comics\n\" Reign in Hell\"",
      "The Strange Case of the Man and the Beast\nThe Strange Case of the Man and the Beast( Spanish: El Extraño caso del hombre y la bestia) is a 1951 Argentine film."
    ],
    "gold_passages": [
      "Fire in Hell\nFire in Hell is a 2014 South Korean drama film written and directed by South Korean indie provocateur Lee Sang- woo.\nBased on a true story, it made its world premiere at the 13th Jeonju International Film Festival and its international premiere at the 34th Moscow International Film Festival in 2012.",
      "The Tiger: An Old Hunter's Tale\nThe Tiger( also known as\" The Tiger: An Old Hunter's Tale\",; lit.\" Big Tiger\") is a 2015 South Korean period action drama film about a hunter prepared to kill the last tiger of Joseon."
    ]
  },
  {
    "query": "Which film was released more recently, Lo Zappatore or Placer Sangriento?",
    "gold_answer": "Placer Sangriento",
    "generated_answer": "Placer sangriento",
    "retrieved_passages": [
      "Placer sangriento\nPlacer sangriento is a 1967 Argentine film.",
      "Lo Zappatore\nLo Zappatore is a 1950 Italian film directed by Rate Furlan.",
      "Roberto Rossellini\nRoberto Gastone Zeffiro Rossellini( 8 May 1906 – 3 June 1977) was an Italian film director, screenwriter, and producer.\nRossellini was one of the directors of the Italian neorealist cinema, contributing to the movement with films such as\" Rome, Open City\"( 1945),\" Paisan\"( 1946),\" Germany, Year Zero\"( 1948), and\" General Della Rovere\"( 1959).",
      "Escala en la ciudad\nEscala en la ciudad(\" A stop in the city\") is a Argentine film directed and written by Alberto De Zavalia with Carlos Aden.\nIt was produced by SIFAL, a production company run by de Zavalia and his partner Luis Saslavsky.\nThe production company disbanded the following year, after de Zavalia had made\" Escala en la ciudad\", his feature film debut, and Saslavsky had completed his second and most famous movie,\" Crimen a las tres\".",
      "Fernando Fernán Gómez\nFernando Fernández Gómez (28 August 1921 – 21 November 2007) better known as Fernando Fernán-Gómez was a Spanish actor, screenwriter, film director, theater director and member of the Royal Spanish Academy for seven years.\nHe was born in Argentina while his mother, Spanish actress Carola Fernán-Gómez, was making a tour in Latin America.\nHe would later use her surname for his stage name when he moved to Spain in 1924.\nAfter the Spanish Civil War he began to study law but interrupted his studies to work in theater.\nIn 1942 he began to act in movies but also continued working on plays.\nHe formed his own theater company and received awards for directing and writing.\nIn the 1950s he began to direct movies, including the film of his novel, \"El viaje a ninguna parte\".\nHe received praise for his 1958 comedy \"La vida por delante\", which led to a sequel, \"La vida alrededor\".\nIn 1977, he won the Silver Bear for Best Actor at the 27th Berlin International Film Festival for his role in \"The Anchorite\".\nHe won the award again at the 35th Berlin International Film Festival in 1985 for his role in \"Stico\" and finally the Honorary Golden Bear at the 55th Berlin International Film Festival in 2005.\nHaving been very much in demand during the 1970s and 1980s, the 1990s was a less active period for him, but towards the end of his life, he enjoyed something of a revival, featuring in three major projects: \"Todo sobre mi madrePlenilunio\", and a starring role in the hit \"La lengua de las mariposas\".\nHe married María Dolores Pradera in 1945; they divorced in 1959.\nHe married Emma Cohen in 2000.\nFernando Fernán Gómez died in Madrid on 21 November 2007 from a heart failure.\nAs he was a lifelong anarchist, his coffin was covered in a black and red anarchist flag.",
      "El extraño caso de la mujer asesinada\nEl Extraño caso de la mujer asesinada is a 1949 Argentine film.",
      "La Leona (film)\nLa Leona is a 1964 Argentine film directed by and starring Armando Bo with Isabel Sarli.",
      "Lucio Fulci\nLucio Fulci( 17 June 1927 – 13 March 1996) was an Italian film director, screenwriter, producer, and actor.\nAlthough he worked in a wide array of genres through a career spanning nearly five decades, including comedy, spaghetti western, adventure, science fiction and erotica, he garnered an international cult following for his giallo and horror films.\nHis most notable films include the\" Gates of Hell\" trilogy —\" City of the Living Dead\"( 1980),\" The Beyond\"( 1981), and\" The House by the Cemetery\"( 1981) —as well as\" Massacre Time\"( 1966),\" One on Top of the Other\"( 1969),\" A Lizard in a Woman's Skin\"( 1971),\" Do n't Torture a Duckling\"( 1972),\" White Fang\"( 1973),\" Four of the Apocalypse\"( 1975),\" Sette note in nero\"( 1977),\" Zombi 2\"( 1979),\" Contraband\"( 1980),\" The Black Cat\"( 1981),\" The New York Ripper\"( 1982),\" Murder Rock\"( 1984), and\" A Cat in the Brain\"( 1990).\nBecause of the high level of visceral graphic violence present in many of his films, especially\" Zombi 2\" and\" The Beyond\", Fulci is frequently referred to as\" The Godfather of Gore\", a title also given to Herschell Gordon Lewis.\nFulci was in his young adult years a politically active radical for the Italian Communist Party.",
      "Nanni Loy\nNanni Loy( born Giovanni Loi; 23 October 1925 – 21 August 1995) was an Italian film, theatre and TV director.\nSpecifically, Nanni Loy was Sardinian, and one of several notable Sardinian film makers, including Franco Solinas.\nLoy was born in Cagliari, Sardinia: his father was Guglielmo Loy- Donà, a lawyer issue from a distinguished Sardinian- Venetian family, and his mother was the noblewoman Donna Anna Sanjust of the Marquesses of Neoneli.\nRosetta Loy, an Italian novelist, is his sister- in- law.\nHe became famous for introducing in Italy the candid camera with his show\" Specchio segreto\"( Secret mirror) in 1965.\nHis 1962 film\" The Four Days of Naples\" was nominated for two Academy Awards.\nIt also won the FIPRESCI Prize at the 3rd Moscow International Film Festival in 1963.\nHis 1971 film\" Detenuto in attesa di giudizio\" was entered into the 22nd Berlin International Film Festival.\nThe star, Alberto Sordi, won the Silver Bear for Best Actor award.\nHe specialized in comedy films such as\" Padre di famiglia\" but he also shot film dealing with social themes(\" Detenuto in attesa di giudizio\" and\" Sistemo l' America e torno\").\nLoy died at Fregene, near Rome, in 1995.",
      "Crimen a las tres\nCrimen a las tres is a Argentine crime film directed and written by Luis Saslavsky."
    ],
    "gold_passages": [
      "Placer sangriento\nPlacer sangriento is a 1967 Argentine film.",
      "Lo Zappatore\nLo Zappatore is a 1950 Italian film directed by Rate Furlan."
    ]
  },
  {
    "query": "Was Şemsettin Baş or Gwenc'Hlan Le Scouëzec born first?",
    "gold_answer": "Gwenc'Hlan Le Scouëzec",
    "generated_answer": "Maurice Le Scouzec",
    "retrieved_passages": [
      "Gwenc'hlan Le Scouëzec\nLoïc Gwenc'hlan Le Scouëzec( 11 November 1929, Plouescat, Finistère – 6 February 2008) was a Breton writer and Grand Druid of Brittany.",
      "Maurice Le Scouëzec\nMaurice Le Scouëzec, was born in Mans on 1 October 1881 and died at Douarnenez on the 1 May 1940.\nHe was a French artist, engraver, illustrator and writer.",
      "Guillaume Wittouck\nGuillaume Wittouck( 1749- 1829) was a Belgian lawyer and High Magistrate.\nHe was the Grandfather of industrialist Paul Wittouck.",
      "Jean Bretagne Charles de La Trémoille\nPrince Jean-Bretagne-Charles de La Trémoille (5 February 1737 – 19 May 1792), 7th Duke of Thouars, was a French soldier and the son of Charles Armand René de La Trémoille and his wife, Marie Hortense de La Tour d'Auvergne of Bouillon.",
      "Madame Pasca\nAlice Marie Angèle Pasquier (November 16, 1833 – May 25, 1914), better known by her stage name Madame Pasca and also known as Alix-Marie Pasquier, was a French stage actress.",
      "Marie Charlotte de La Trémoille\nMarie Charlotte de La Trémoille( 26 January 1632 – 24 August 1682). was a French noblewoman member of the House of La Trémoille and by marriage Duchess of Saxe- Jena.\nBorn in Thouars, she was the fifth of six children born from the marriage of Henri III de La Trémoille, 3rd Duke of Thouars, 2nd Duke of La Tremoille, Prince of Talmond and Taranto, and Marie de La Tour d'Auvergne.",
      "Takayama Tomoteru\nHe was the father of Takayama Ukon, and was a Kirishitan.",
      "Louis d'Orléans, Prince of Condé\n\"Louis\" Philippe Marie Léopold d'Orléans (15 November 1845 – 24 May 1866) was a member of the House of Orléans and held the title of Prince of Condé.\nHe was the first member of a royal house to visit the Australian continent.",
      "Louis Philippe, Crown Prince of Belgium\nLouis- Philippe, Crown Prince of Belgium( Louis Philippe Léopold Victor Ernest; 24 July 1833 – 16 May 1834), was the eldest child and heir- apparent of King Leopold I of the Belgians and his second wife, Princess Louise d'Orléans.",
      "Napoléon Alexandre Berthier, 2nd Prince of Wagram\nNapoléon Alexandre Louis Joseph Berthier, 2nd Prince of Wagram (11 September 1810, Paris10 February 1887, Paris) was a French politician and nobleman.\nSon of Louis-Alexandre Berthier, 1st Prince of Wagram, and Duchess Maria Elisabeth in Bavaria (and by his mother, grandnephew of King Maximilian I of Bavaria)."
    ],
    "gold_passages": [
      "Gwenc'hlan Le Scouëzec\nLoïc Gwenc'hlan Le Scouëzec( 11 November 1929, Plouescat, Finistère – 6 February 2008) was a Breton writer and Grand Druid of Brittany.",
      "Şemsettin Baş\nŞemsettin Baş( born January 4, 1973 in Istanbul, Turkey) is a retired Turkish professional basketball player.\nAt 6 ft 5.75 in( 1.97 m), he played as a shooting guard and small forward."
    ]
  },
  {
    "query": "Which film has the director born later, Bhoomiyude Avakashikal or The Majesty Of The Law?",
    "gold_answer": "Bhoomiyude Avakashikal",
    "generated_answer": "The Inheritors of the Earth",
    "retrieved_passages": [
      "M. Venkataraju\nM Venkataraju, was a music director/ composer of Kannada film world.",
      "Bhoomiyude Avakashikal\nBhoomiyude Avakashikal\n( English:\" The Inheritors of the Earth\") is a 2012 Malayalam feature film written and directed by T. V. Chandran.\nThe film stars Kailash in the lead role along with Sreenivasan and Mythili who play pivotal supporting roles.\nThe film was produced by Anand Kumar under the banner of Yes Cinema and it was mainly shot in Nelliyampathi, Ottappalam and Shoranur in Kerala.\n\" Bhoomiyude Avakashikal\" is the third and last installment of T. V. Chandran's trilogy on 2002 Gujarat riots.\nThe first one was,\" Kathavasheshan\"( 2004), it was followed by\" Vilapangalkkappuram\"( 2008).\nThe narratives of all these films begin on the same day, 28 February 2002, that is, on the day after the Godhra train burning in Gujarat.\n\" Bhoomiyude Avakashikal\" tells the story of Mohanachandran Nair, who is driven away from Ahmadabad following the Gujarat riots and who eventually loses his job and even his identity and ultimately lands up in a secluded house in Kerala, in the company of insects and animals with whom he shares his thoughts, concerns, doubts and frustrations.\nThe film was shot digitally to reduce costs as it was required to film several insects and animals in their natural habitat.\nThe film premiered at the 43rd International Film Festival of India on 27 November 2012.\nIt was also an official selection for the International Film Festival of Kerala.",
      "G. Marthandan\nG. Marthandan is an Indian film director who works in Malayalam cinema.",
      "T. V. Chandran\nT. V. Chandran( born 23 November 1950) is an Indian film director, screenwriter, and actor, predominantly working in Malayalam cinema.\nBorn in a Malayali family in Telicherry, Chandran worked as a Reserve Bank of India employee before entering into the film industry.\nHe started his film career as an assistant director to P. A. Backer.\nHe also acted the lead role in Backer's highly acclaimed political drama\" Kabani Nadi Chuvannappol\"( 1975).\nHe made his directorial debut with the unreleased feature\" Krishnan Kutty\"( 1981), and followed this with the Tamil film\" Hemavin Kadhalargal\"( 1985).\nChandran came into prominence after\" Alicinte Anveshanam\"( 1989), which was nominated for the Golden Leopard at the Locarno International Film Festival.\nThis was followed with\" Ponthan Mada\"( 1993), his most famous film to- date.\nChandran is most known for his art- house films which have references to history and undertones of politics and feminism.\nHe is also known for his trilogy on 2002 Gujarat riots, consisting of\" Kathavasheshan\"( 2004),\" Vilapangalkappuram\"( 2008) and\" Bhoomiyude Avakashikal\"( 2012).\nOther highly acclaimed films include\" Mangamma\"( 1997),\" Dany\"( 2001) and( 2003).\nChandran is widely regarded as one of the finest directors in Indian cinema and is widely credited with having revolutionised parallel cinema with his complex- structured art- house films.\nChandran has won several film awards including six National Film Awards and ten Kerala State Film Awards.\nIn addition to these, he is a recipient of a number of awards at various International film festivals.",
      "Mieczysław Krawicz\nMieczysław Krawicz( 1893–1944) was a Polish film director from Warsaw.",
      "Hassan Zee\nHassan Zee is a Pakistani- American film director who was born in Chakwal, Pakistan.",
      "Deepak Sareen\nDeepak Sareen is a Bollywood film director and assistant director.\nHis first film as director was\" Ranbhoomi\" and last film as director was\" Albela\".",
      "David Eady (film director)\nDavid Eady( April 22, 1924- April 5, 2009) was a British film director and producer.\nHe was born in London.",
      "Dana Blankstein\nDana Blankstein- Cohen( born March 3, 1981) is the director of the Israeli Academy of Film and Television.\nShe is a film director, and an Israeli culture entrepreneur.",
      "Dana Blankstein\nDana Blankstein- Cohen( born March 3, 1981) is the director of the Israeli Academy of Film and Television.\nShe is a film director, and an Israeli culture entrepreneur."
    ],
    "gold_passages": [
      "Julia Crawford Ivers\nJulia Crawford Ivers( October 3, 1869 – May 8, 1930) was an American motion picture pioneer.",
      "Bhoomiyude Avakashikal\nBhoomiyude Avakashikal\n( English:\" The Inheritors of the Earth\") is a 2012 Malayalam feature film written and directed by T. V. Chandran.\nThe film stars Kailash in the lead role along with Sreenivasan and Mythili who play pivotal supporting roles.\nThe film was produced by Anand Kumar under the banner of Yes Cinema and it was mainly shot in Nelliyampathi, Ottappalam and Shoranur in Kerala.\n\" Bhoomiyude Avakashikal\" is the third and last installment of T. V. Chandran's trilogy on 2002 Gujarat riots.\nThe first one was,\" Kathavasheshan\"( 2004), it was followed by\" Vilapangalkkappuram\"( 2008).\nThe narratives of all these films begin on the same day, 28 February 2002, that is, on the day after the Godhra train burning in Gujarat.\n\" Bhoomiyude Avakashikal\" tells the story of Mohanachandran Nair, who is driven away from Ahmadabad following the Gujarat riots and who eventually loses his job and even his identity and ultimately lands up in a secluded house in Kerala, in the company of insects and animals with whom he shares his thoughts, concerns, doubts and frustrations.\nThe film was shot digitally to reduce costs as it was required to film several insects and animals in their natural habitat.\nThe film premiered at the 43rd International Film Festival of India on 27 November 2012.\nIt was also an official selection for the International Film Festival of Kerala.",
      "T. V. Chandran\nT. V. Chandran( born 23 November 1950) is an Indian film director, screenwriter, and actor, predominantly working in Malayalam cinema.\nBorn in a Malayali family in Telicherry, Chandran worked as a Reserve Bank of India employee before entering into the film industry.\nHe started his film career as an assistant director to P. A. Backer.\nHe also acted the lead role in Backer's highly acclaimed political drama\" Kabani Nadi Chuvannappol\"( 1975).\nHe made his directorial debut with the unreleased feature\" Krishnan Kutty\"( 1981), and followed this with the Tamil film\" Hemavin Kadhalargal\"( 1985).\nChandran came into prominence after\" Alicinte Anveshanam\"( 1989), which was nominated for the Golden Leopard at the Locarno International Film Festival.\nThis was followed with\" Ponthan Mada\"( 1993), his most famous film to- date.\nChandran is most known for his art- house films which have references to history and undertones of politics and feminism.\nHe is also known for his trilogy on 2002 Gujarat riots, consisting of\" Kathavasheshan\"( 2004),\" Vilapangalkappuram\"( 2008) and\" Bhoomiyude Avakashikal\"( 2012).\nOther highly acclaimed films include\" Mangamma\"( 1997),\" Dany\"( 2001) and( 2003).\nChandran is widely regarded as one of the finest directors in Indian cinema and is widely credited with having revolutionised parallel cinema with his complex- structured art- house films.\nChandran has won several film awards including six National Film Awards and ten Kerala State Film Awards.\nIn addition to these, he is a recipient of a number of awards at various International film festivals.",
      "The Majesty of the Law\nThe Majesty of the Law is a 1915 American drama silent film written and directed by Julia Crawford Ivers.\nThe film stars George Fawcett( in his film debut), Jane Wolfe, William Desmond, Myrtle Stedman, John Oaker and Charlie Ruggles.\nThe film was released on August 26, 1915, by Paramount Pictures."
    ]
  },
  {
    "query": "Who is Cornelia (Wife Of Caesar)'s child-in-law?",
    "gold_answer": "Pompey",
    "generated_answer": "Julia",
    "retrieved_passages": [
      "Cornelia (wife of Caesar)\nCornelia (c. 97 – c. 69 BC) was the first or second wife of Caesar, and the mother of his only daughter, Julia.\nA daughter of Lucius Cornelius Cinna, Cornelia was related by birth or marriage to many of the most influential figures of the late Republic.",
      "Julia (daughter of Caesar)\nJulia (c. 76 BC – 54 BC) was the daughter of Roman dictator Julius Caesar by his first or second wife Cornelia, and his only child from his marriages.\nJulia became the fourth wife of Pompey the Great and was renowned for her beauty and virtue.",
      "Eusebius (consul 359)\nFlavius Eusebius( died after AD 371) was a Roman Senator, who was the brother- in- law of the emperor Constantius II.",
      "Hannah Arnold\nHannah Arnold, also known as Hannah Waterman King, was the grandmother of Benedict Arnolds children.",
      "Hannah Arnold\nHannah Arnold, also known as Hannah Waterman King, was the grandmother of Benedict Arnolds children.",
      "Cleopatra IV of Egypt\nCleopatra IV  was Queen of Egypt briefly from 116 to 115 BC, jointly with her husband Ptolemy IX Lathyros.\nShe later became queen consort of Syria as the wife of Antiochus IX Cyzicenus.",
      "Laodice of the Sameans\nLaodice was a Queen of an unknown Kingdom in Asia.\nShe lived at the time of the Seleucid king of Syria Antiochus X Eusebes who reigned 95 BC- 92 or 88 BC.",
      "Cleomenes II\nCleomenes II( died 309 BC) was Agiad King of Sparta from 369 to 309 BC.\nThe son of Cleombrotus I, he succeeded his brother Agesipolis II.\nHe was the father of Acrotatus I, the father of Areus I, and of Cleonymus, the father of Leonidas II.",
      "Diana Guardato\nDiana Guardato was a member of the aristocratic Patrician Guardato family, and had three children with King Ferdinand I: Diana Guardato is the 16th- Great Grandmother of His Royal Highness Albert II of Belgium, 15th- Great Grandmother of His Majesty Juan Carlos\nI of Spain, 17th- Great Grandmother of Philippe of Belgium, 14th- Great Grandmother of His Majesty Manuel II of Portugal, 16th- Great Grandmother of Grand Duke Henri, as well as many others.",
      "Tjuyu\nTjuyu( sometimes transliterated as Thuya or Thuyu) was an Egyptian noblewoman and the mother of queen Tiye, and the wife of Yuya.\nShe is the grandmother of Akhenaten, and great grandmother of Tutankhamun."
    ],
    "gold_passages": [
      "Julia (daughter of Caesar)\nJulia (c. 76 BC – 54 BC) was the daughter of Roman dictator Julius Caesar by his first or second wife Cornelia, and his only child from his marriages.\nJulia became the fourth wife of Pompey the Great and was renowned for her beauty and virtue.",
      "Cornelia (wife of Caesar)\nCornelia (c. 97 – c. 69 BC) was the first or second wife of Caesar, and the mother of his only daughter, Julia.\nA daughter of Lucius Cornelius Cinna, Cornelia was related by birth or marriage to many of the most influential figures of the late Republic."
    ]
  },
  {
    "query": "Why did John Middleton Murry's wife die?",
    "gold_answer": "tuberculosis",
    "generated_answer": "Murry edited her work",
    "retrieved_passages": [
      "John Middleton Murry Jr.\nJohn Middleton Murry Jr. (9 May 1926 – 31 March 2002) was an English writer who used the names Colin Murry and Richard Cowper.",
      "John Middleton Murry\nJohn Middleton Murry (6 August 1889 – 12 March 1957) was an English writer.\nHe was a prolific author, producing more than 60 books and thousands of essays and reviews on literature, social issues, politics, and religion during his lifetime.\nA prominent critic, Murry is best remembered for his association with Katherine Mansfield, whom he married in 1918 as her second husband, for his friendship with D. H. Lawrence and T. S. Eliot, and for his friendship (and brief affair) with Frieda Lawrence.\nFollowing Mansfield's death, Murry edited her work.",
      "John Middleton (architect)\nJohn Middleton( 1820–1885) was an English architect of the 19th century.\nHe was born in York, in August 1820.",
      "John Middleton (footballer, born 1955)\nJohn Middleton( born 11 July 1955) is an English former footballer who played for Bradford City and Macclesfield Town.\nHe was born in Rawmarsh, near Rotherham.",
      "John, Count Palatine of Neumarkt\nJohn (Johann von Pfalz-Neumarkt; 1383 – 14 March 1443) was the Count Palatine of Neumarkt from 1410 to his death.\nThe son of Rupert III of the Palatinate, he married Catherine of Pomerania in 1407.\nHe is mainly known for his crushing victory against the Hussites at the Battle of Hiltersried in 1433.",
      "James Corker\nJames Corker or James Cleveland( born 1753 or 1754, died March 24, 1791) was a man of English descent who took part in clan fighting in precolonial Sierra Leone.",
      "Anne Denman\nAnne Denman( 1587–1661) was born in Olde Hall, Retford, Nottinghamshire.\nThrough a fortunate second marriage with Thomas Aylesbury, she became the grandmother of Lady Anne Hyde, Duchess of York and great- grandmother of Queen Mary II and Queen Anne.",
      "Anne Denman\nAnne Denman( 1587–1661) was born in Olde Hall, Retford, Nottinghamshire.\nThrough a fortunate second marriage with Thomas Aylesbury, she became the grandmother of Lady Anne Hyde, Duchess of York and great- grandmother of Queen Mary II and Queen Anne.",
      "Jean Bretagne Charles de La Trémoille\nPrince Jean-Bretagne-Charles de La Trémoille (5 February 1737 – 19 May 1792), 7th Duke of Thouars, was a French soldier and the son of Charles Armand René de La Trémoille and his wife, Marie Hortense de La Tour d'Auvergne of Bouillon.",
      "Tjuyu\nTjuyu( sometimes transliterated as Thuya or Thuyu) was an Egyptian noblewoman and the mother of queen Tiye, and the wife of Yuya.\nShe is the grandmother of Akhenaten, and great grandmother of Tutankhamun."
    ],
    "gold_passages": [
      "Katherine Mansfield\nKathleen Mansfield Murry (\"née\" Beauchamp; 14 October 1888 – 9 January 1923) was a prominent New Zealand modernist short story writer and poet who was born and brought up in colonial New Zealand and wrote under the pen name of Katherine Mansfield.\nAt the age of 19, she left New Zealand and settled in England, where she became a friend of writers such as D. H. Lawrence and Virginia Woolf.\nMansfield was diagnosed with extrapulmonary tuberculosis in 1917; the disease claimed her life at the age of 34.",
      "John Middleton Murry\nJohn Middleton Murry (6 August 1889 – 12 March 1957) was an English writer.\nHe was a prolific author, producing more than 60 books and thousands of essays and reviews on literature, social issues, politics, and religion during his lifetime.\nA prominent critic, Murry is best remembered for his association with Katherine Mansfield, whom he married in 1918 as her second husband, for his friendship with D. H. Lawrence and T. S. Eliot, and for his friendship (and brief affair) with Frieda Lawrence.\nFollowing Mansfield's death, Murry edited her work."
    ]
  },
  {
    "query": "Who is the paternal grandfather of Taj Al-Dawla?",
    "gold_answer": "Rukn al-Dawla",
    "generated_answer": "Abu'l-Husain Ahmad",
    "retrieved_passages": [
      "Taj al-Dawla\nAbu'l-Husain Ahmad , better known by his \"laqab\" of Taj al-Dawla\n(Arabic: تاج الدولة،, \"Crown of the Dynasty\"), was the Buyid ruler of Khuzestan during the 980s.\nHe was the son of 'Adud al-Dawla.",
      "Kaya Alp\nKaya Alp was, according to Ottoman tradition, the son of Kızıl Buğa and the father of Suleyman Shah, who was, in turn, the grandfather of Ertuğrul, and the great grandfather of the Ottoman Empire founder, Osman I.",
      "Abd al-Muttalib\nAbd al- Muttalib Shaybah ibn Hashim( c. 497 – 578) was the grandfather of Islamic prophet Muhammad.",
      "Hubba bint Hulail\nHubba bint Hulail was the grandmother of Hashim ibn' Abd Manaf, thus the great- great- great- grandmother of the Islamic\" Nabī\"( Prophet) Muhammad ibn Abdullah.",
      "Hubba bint Hulail\nHubba bint Hulail was the grandmother of Hashim ibn' Abd Manaf, thus the great- great- great- grandmother of the Islamic\" Nabī\"( Prophet) Muhammad ibn Abdullah.",
      "Ka'us III\nKa'us III, was the fourth ruler of the Paduspanid branch of Kojur.\nHe was the son and successor of Ashraf ibn Taj al- Dawla.",
      "'Adud al-Dawla\nFannā (Panāh) Khusraw , better known by his laqab of ʿAḍud al-Dawla (\"Pillar of the [Abbasid] Dynasty\")\n(September 24, 936 – March 26, 983) was an emir of the Buyid dynasty, ruling from 949 to 983, and at his height of power ruling an empire stretching from Makran as far to Yemen and the shores of the Mediterranean Sea.\nHe is widely regarded as the greatest monarch of the dynasty, and by the end of his reign was the most powerful ruler in the Middle East.\nThe son of Rukn al-Dawla, Fanna Khusraw was given the title of Adud al-Dawla by the Abbasid caliph in 948 when he was made emir of Fars after the death of his childless uncle\nImad al-Dawla, after which Rukn al-Dawla became the senior emir of the Buyids.\nIn 974 Adud al-Dawla was sent by his father to save his cousin Izz al-Dawla from a rebellion.\nAfter defeating the rebel forces, he claimed the emirate of Iraq for himself, and forced his cousin to abdicate.\nHis father, however, became angered by this decision and restored Izz al-Dawla.\nAfter the death of Adud al-Dawla's father, his cousin rebelled against him, but was defeated.\nAdud al-Dawla became afterwards the sole ruler of the Buyid dynasty and assumed the ancient Iranian title of Shahanshah (\"King of Kings\").\nWhen Adud al-Dawla became emir of Iraq, the capital city, Baghdad, was suffering from violence and instability owing to sectarian conflict.\nIn order to bring peace and stability to the city, he ordered the banning of public demonstrations and polemics.\nAt the same time, he patronized a number of Shia scholars such as al-Mufid, and sponsored the renovation of a number of important Shia shrines.\nIn addition, 'Adud al-Dawla is credited with sponsoring and patronizing other scientific projects during his time.\nAn observatory was built by his orders in Isfahan where Azophi worked.\nAl-Muqaddasi also reports that he ordered the construction of a great dam between Shiraz and Estakhr in 960.\nThe dam irrigated some 300 villages in Fars province and became known as \"Band-e Amir\" (Dam of the emir).\nAmong his other major constructions was the digging of the Haffar channel, that joined the Karun river to the Shatt al-Arab river (the confluence of the Tigris and the Euphrates).\nThe port of Khorramshahr was built on the Haffar, at its joining point with the Shatt al-Arab.",
      "Tjuyu\nTjuyu( sometimes transliterated as Thuya or Thuyu) was an Egyptian noblewoman and the mother of queen Tiye, and the wife of Yuya.\nShe is the grandmother of Akhenaten, and great grandmother of Tutankhamun.",
      "Tjuyu\nTjuyu( sometimes transliterated as Thuya or Thuyu) was an Egyptian noblewoman and the mother of queen Tiye, and the wife of Yuya.\nShe is the grandmother of Akhenaten, and great grandmother of Tutankhamun.",
      "Takayama Tomoteru\nHe was the father of Takayama Ukon, and was a Kirishitan."
    ],
    "gold_passages": [
      "'Adud al-Dawla\nFannā (Panāh) Khusraw , better known by his laqab of ʿAḍud al-Dawla (\"Pillar of the [Abbasid] Dynasty\")\n(September 24, 936 – March 26, 983) was an emir of the Buyid dynasty, ruling from 949 to 983, and at his height of power ruling an empire stretching from Makran as far to Yemen and the shores of the Mediterranean Sea.\nHe is widely regarded as the greatest monarch of the dynasty, and by the end of his reign was the most powerful ruler in the Middle East.\nThe son of Rukn al-Dawla, Fanna Khusraw was given the title of Adud al-Dawla by the Abbasid caliph in 948 when he was made emir of Fars after the death of his childless uncle\nImad al-Dawla, after which Rukn al-Dawla became the senior emir of the Buyids.\nIn 974 Adud al-Dawla was sent by his father to save his cousin Izz al-Dawla from a rebellion.\nAfter defeating the rebel forces, he claimed the emirate of Iraq for himself, and forced his cousin to abdicate.\nHis father, however, became angered by this decision and restored Izz al-Dawla.\nAfter the death of Adud al-Dawla's father, his cousin rebelled against him, but was defeated.\nAdud al-Dawla became afterwards the sole ruler of the Buyid dynasty and assumed the ancient Iranian title of Shahanshah (\"King of Kings\").\nWhen Adud al-Dawla became emir of Iraq, the capital city, Baghdad, was suffering from violence and instability owing to sectarian conflict.\nIn order to bring peace and stability to the city, he ordered the banning of public demonstrations and polemics.\nAt the same time, he patronized a number of Shia scholars such as al-Mufid, and sponsored the renovation of a number of important Shia shrines.\nIn addition, 'Adud al-Dawla is credited with sponsoring and patronizing other scientific projects during his time.\nAn observatory was built by his orders in Isfahan where Azophi worked.\nAl-Muqaddasi also reports that he ordered the construction of a great dam between Shiraz and Estakhr in 960.\nThe dam irrigated some 300 villages in Fars province and became known as \"Band-e Amir\" (Dam of the emir).\nAmong his other major constructions was the digging of the Haffar channel, that joined the Karun river to the Shatt al-Arab river (the confluence of the Tigris and the Euphrates).\nThe port of Khorramshahr was built on the Haffar, at its joining point with the Shatt al-Arab.",
      "Taj al-Dawla\nAbu'l-Husain Ahmad , better known by his \"laqab\" of Taj al-Dawla\n(Arabic: تاج الدولة،, \"Crown of the Dynasty\"), was the Buyid ruler of Khuzestan during the 980s.\nHe was the son of 'Adud al-Dawla."
    ]
  },
  {
    "query": "Do both films Payment On Demand and My Cousin From Warsaw have the directors from the same country?",
    "gold_answer": "yes",
    "generated_answer": "Polish",
    "retrieved_passages": [
      "Mieczysław Krawicz\nMieczysław Krawicz( 1893–1944) was a Polish film director from Warsaw.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "M. Venkataraju\nM Venkataraju, was a music director/ composer of Kannada film world.",
      "Hassan Zee\nHassan Zee is a Pakistani- American film director who was born in Chakwal, Pakistan.",
      "Xawery Żuławski\nXawery Żuławski (born 22 December 1971 in Warsaw) is a Polish film director.\nIn 1995 he graduated National Film School in Łódź.\nHe is the son of actress Małgorzata Braunek and director Andrzej Żuławski.\nHis second feature \"Wojna polsko-ruska\" (2009), adapted from the controversial best-selling novel by Dorota Masłowska, won First Prize in the New Polish Films competition at the 9th Era New Horizons Film Festival in Wrocław.\nIn 2013, he stated he intends to direct a Polish novel \"Zły\" by Leopold Tyrmand.\nŻuławski and his wife Maria Strzelecka had 2 children together:\nson Kaj Żuławski (born 2002) and daughter Jagna Żuławska (born 2009).",
      "My Cousin from Warsaw (film)\nMy Cousin from Warsaw is a 1931 French- German comedy film directed by Carmine Gallone and starring Elvire Popesco, André Roanne and Madeleine Lambert.\nThe films screenplay was adapted by Henri-Georges Clouzot.\nA separate German- language version was also made.\nThe film's art direction was by Julius von Borsody.",
      "Hanro Smitsman\nHanro Smitsman, born in 1967 in Breda( Netherlands), is a writer and director of film and television.",
      "Sepideh Farsi\nSepideh Farsi is an Iranian film director, born in Tehran in 1965."
    ],
    "gold_passages": [
      "Curtis Bernhardt\nCurtis Bernhardt( 15 April 1899 – 22 February 1981) was a German film director born in Worms, Germany, under the name Kurt Bernhardt.\nHe trained as an actor in Germany, and performed on the stage, before starting as a film director in 1924, with\" Nameless Heroes\".\nOther films include\" A Stolen Life\"( 1946) and\" Sirocco\"( 1951).\nBernhardt made films in Germany from 1925 until 1933, when he was forced to flee the Nazi regime — who briefly had him arrested — because he was Jewish.\nBernhardt directed films in France and England before moving on to Hollywood to work for Warner Brothers in 1940.\nHe produced and directed his last Hollywood picture,\" Kisses for My President\"( 1964), about the nation's first female Chief Executive starring Polly Bergen and Fred MacMurray.\nHe is interred at Glendale's Forest Lawn Memorial Park Cemetery, near his wife, Pearl Argyle Wellman Bernhardt.",
      "Payment on Demand\nPayment on Demand is a 1951 drama film directed by Curtis Bernhardt and starring Bette Davis and Barry Sullivan.\nThe screenplay by Bernhardt and Bruce Manning chronicles a marriage from its idealistic early days to its dissolution.",
      "Carl Boese\nCarl Boese( 26 August 1887 – 6 July 1958) was a German film director, screenwriter and producer.\nHe directed 158 films between 1917 and 1957.",
      "My Cousin from Warsaw\nMy Cousin from Warsaw is a 1931 German comedy film directed by Carl Boese and starring Liane Haid, Tala Birell and Fritz Schulz.\nA separate French- language version\" Ma cousine de Varsovie\" was also made, directed by Carmine Gallone.\nThe film was based upon the play by Louis Verneuil.\nThe film's art direction was by Julius von Borsody."
    ]
  },
  {
    "query": "What is the place of birth of the director of film And The Spring Comes?",
    "gold_answer": "Xi'an",
    "generated_answer": "Xi'an",
    "retrieved_passages": [
      "M. Venkataraju\nM Venkataraju, was a music director/ composer of Kannada film world.",
      "Gu Changwei\nGu Changwei (born 12 December 1957) is a Chinese cinematographer and film director.\nGu was born in Xi'an, Shaanxi in the People's Republic of China.\nGu is considered one of the major Chinese cinematographers working today.",
      "Hassan Zee\nHassan Zee is a Pakistani- American film director who was born in Chakwal, Pakistan.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "G. Marthandan\nG. Marthandan is an Indian film director who works in Malayalam cinema.",
      "Fred Roy Krug\nFred R. Krug is an American film and television producer- director born in Bern, Switzerland.",
      "Hanro Smitsman\nHanro Smitsman, born in 1967 in Breda( Netherlands), is a writer and director of film and television.",
      "David Eady (film director)\nDavid Eady( April 22, 1924- April 5, 2009) was a British film director and producer.\nHe was born in London."
    ],
    "gold_passages": [
      "And the Spring Comes\nAnd the Spring Comes\nis a 2007 film directed by Gu Changwei, written by Li Qiang.\nThis is Gu's second feature following his acclaimed feature debut \"Peacock\".\nThe film premiered at the 2007 Rome Film Festival, and the lead actress Jiang Wenli, also Gu Changwei's wife, won the Best Actress award.",
      "Gu Changwei\nGu Changwei (born 12 December 1957) is a Chinese cinematographer and film director.\nGu was born in Xi'an, Shaanxi in the People's Republic of China.\nGu is considered one of the major Chinese cinematographers working today."
    ]
  },
  {
    "query": "Who died first, Madame Pasca or James A. Donohoe?",
    "gold_answer": "Madame Pasca",
    "generated_answer": "Obata Toramori",
    "retrieved_passages": [
      "Madame Pasca\nAlice Marie Angèle Pasquier (November 16, 1833 – May 25, 1914), better known by her stage name Madame Pasca and also known as Alix-Marie Pasquier, was a French stage actress.",
      "James A. Donohoe\nJames A. Donohoe( August 9, 1877 – February 26, 1956) was a United States District Judge of the United States District Court for the District of Nebraska.",
      "Obata Toramori\nHe was the father of Obata Masamori.",
      "Marie-Louise Coidavid\nMarie Louise Coidavid( 1778 – March 11, 1851), was the Queen of the Kingdom of Haiti 1811 – 20 as the spouse of Henri I of Haiti.",
      "Minamoto no Chikako\nShe was the mother of Prince Morinaga.",
      "Marie Zéphyrine of France\nMarie Zéphyrine of France (26 August 1750 – 2 September 1755) was a French princess, the daughter of Louis, Dauphin of France, and Maria Josepha of Saxony.\nMarie Zéphyrine, known as \"Madame Royale\" or \"la Petite Madame\", was born at the Palace of Versailles and was named after St Zephyrinus, on whose feast day she was born.\nHer birth was greeted with caution; in the previous two years, Maria Josepha had suffered stillbirths and her health was of a fragile nature.\nLouis XV, on the other hand, had hoped for a grandson.\nMarie Isabelle de Rohan served as Marie Zéphyrine's governess.\nMarie Zéphyrine died at Versailles due to an attack of convulsions, in the early hours of the morning of 2 September, having been baptised just days before by the Abbot of Chabannes.\nShe was not officially mourned; a French princess could only be mourned if she was over the age of 7.\nShe was buried at the Royal Basilica of Saint Denis outside the capital of Paris.",
      "Afonso, Prince of Portugal (1526)\nAfonso, Prince of Portugal was the first son of king John III of Portugal and his queen, Catherine of Austria.\nHe was the Prince of Portugal but died in the same year he was born, in 1526.",
      "James Corker\nJames Corker or James Cleveland( born 1753 or 1754, died March 24, 1791) was a man of English descent who took part in clan fighting in precolonial Sierra Leone.",
      "Julia Crawford Ivers\nJulia Crawford Ivers( October 3, 1869 – May 8, 1930) was an American motion picture pioneer.",
      "François II de La Trémoille\nFrançois de La Trémoille( 1505 – 1541) was a French nobleman of the La Tremoille family.\nHe was the son of Charles I de la Trémoille( killed in 1515 at the battle of Marignano) and of Louise de Coëtivy."
    ],
    "gold_passages": [
      "James A. Donohoe\nJames A. Donohoe( August 9, 1877 – February 26, 1956) was a United States District Judge of the United States District Court for the District of Nebraska.",
      "Madame Pasca\nAlice Marie Angèle Pasquier (November 16, 1833 – May 25, 1914), better known by her stage name Madame Pasca and also known as Alix-Marie Pasquier, was a French stage actress."
    ]
  },
  {
    "query": "Who was born later, D'Arcy Coulson or Thomas William Adams?",
    "gold_answer": "D'Arcy Coulson",
    "generated_answer": "John D' Arcy Coulson",
    "retrieved_passages": [
      "William E. Adams (New York)\nWilliam E. Adams( December 25, 1922 – April 1983) was an American lawyer and politician from New York.",
      "William Adams (minister)\nWilliam Adams( January 25, 1807 – August 31, 1880) was a noted American clergyman and academic.",
      "D'Arcy Coulson\nJohn D' Arcy Coulson( February 17, 1908 – April 13, 1996) was a Canadian professional ice hockey defenceman who played one season in the National Hockey League for the Philadelphia Quakers.\nBorn in Sudbury, Ontario and raised in Ottawa, he first played for the Ottawa Shamrocks of the OCHL in 1927.\nHe played for the Quakers in the 1930 – 31 season, scoring no goals in the NHL but ranking third in the league in penalty minutes that season.\nAfter leaving hockey, Coulson, whose father owned hotels in Sudbury, Ottawa and Hawkesbury and a golf club in Aylmer, Quebec, joined the family business.\nThe hotel in Sudbury, although no longer owned by the Coulson family, is still named the Coulson Hotel.",
      "Ernie Adams (footballer, born 1922)\nErnest William Adams (3 April 1922 – September 2009) was an English professional footballer who played in the Football League for Queens Park Rangers as a forward.",
      "William Adams (wrestler)\nWilliam Adams was a British wrestler.\nHe competed in the 1908 Summer Olympics.",
      "William Whitaker (geologist)\nWilliam Whitaker was born on 4 May 1836 in London,",
      "David Eady (film director)\nDavid Eady( April 22, 1924- April 5, 2009) was a British film director and producer.\nHe was born in London.",
      "Thomas William Adams\nAlfred Albert Thomas William Adams( 24 June 1842 – 1 June 1919), known as Thomas William Adams, was a New Zealand farmer, forester, churchman and educationalist.\nHe was born in Graveley, Cambridgeshire, England on 24 June 1842.\nIn 1862 he emigrated to New Zealand on the\" African\".\nHe bought of virgin tussock land at Greendale in Canterbury in 1865 and converted them to farmland.\nThe area prospered over the next few years as more farmers developed land.\nAdams married Lucy Pannett in 1867 and they had a daughter the following year.\nLucy drowned in 1869.\nAdams married her sister Harriet in 1872, and they had five sons and three daughters together.\nAdams was a pioneer in planting trials, obtaining seeds from correspondents around the world, keeping records and publishing the results.\nHe started planting trees in 1868 for shelter and fuel, and by 1908 had created an arboretum of 800 species.\nHis recommendation of\" Pinus radiata\" and other pines influenced early New Zealand forestry.\nIn 1913 he was a member of the Royal Commission on Forestry, and in 1918 he became a lifetime member of the New Zealand Forestry League.\nFor 40 years, Adams taught Sunday school at Greendale, which began by teaching local children to read.\nHe was instrumental in the formation of the Greendale day school in 1872, and served on the North Canterbury Education Board from 1892 to 1918, serving as chairman from 1897 to 1905.\nHe was also a governor of Canterbury College( now University of Canterbury) from 1897 until his death.\nHe was the first secretary of the Canterbury Baptist Association, and later its president.\nAdams died at Greendale on 1 June 1919 and was buried there.\nHis will left £ 2000 and of land to Canterbury College to be used for a school of forestry.\nHarriet died 15 January 1934 and was buried with him.\nThe school of forestry opened in 1924, and about 1975 a T.W. Adams Scholarship was set up to support postgraduate forestry students.",
      "Thomas Scott (diver)\nThomas Scott( 1907- date of death unknown) was an English diver.",
      "Afonso, Prince of Portugal (1526)\nAfonso, Prince of Portugal was the first son of king John III of Portugal and his queen, Catherine of Austria.\nHe was the Prince of Portugal but died in the same year he was born, in 1526."
    ],
    "gold_passages": [
      "D'Arcy Coulson\nJohn D' Arcy Coulson( February 17, 1908 – April 13, 1996) was a Canadian professional ice hockey defenceman who played one season in the National Hockey League for the Philadelphia Quakers.\nBorn in Sudbury, Ontario and raised in Ottawa, he first played for the Ottawa Shamrocks of the OCHL in 1927.\nHe played for the Quakers in the 1930 – 31 season, scoring no goals in the NHL but ranking third in the league in penalty minutes that season.\nAfter leaving hockey, Coulson, whose father owned hotels in Sudbury, Ottawa and Hawkesbury and a golf club in Aylmer, Quebec, joined the family business.\nThe hotel in Sudbury, although no longer owned by the Coulson family, is still named the Coulson Hotel.",
      "Thomas William Adams\nAlfred Albert Thomas William Adams( 24 June 1842 – 1 June 1919), known as Thomas William Adams, was a New Zealand farmer, forester, churchman and educationalist.\nHe was born in Graveley, Cambridgeshire, England on 24 June 1842.\nIn 1862 he emigrated to New Zealand on the\" African\".\nHe bought of virgin tussock land at Greendale in Canterbury in 1865 and converted them to farmland.\nThe area prospered over the next few years as more farmers developed land.\nAdams married Lucy Pannett in 1867 and they had a daughter the following year.\nLucy drowned in 1869.\nAdams married her sister Harriet in 1872, and they had five sons and three daughters together.\nAdams was a pioneer in planting trials, obtaining seeds from correspondents around the world, keeping records and publishing the results.\nHe started planting trees in 1868 for shelter and fuel, and by 1908 had created an arboretum of 800 species.\nHis recommendation of\" Pinus radiata\" and other pines influenced early New Zealand forestry.\nIn 1913 he was a member of the Royal Commission on Forestry, and in 1918 he became a lifetime member of the New Zealand Forestry League.\nFor 40 years, Adams taught Sunday school at Greendale, which began by teaching local children to read.\nHe was instrumental in the formation of the Greendale day school in 1872, and served on the North Canterbury Education Board from 1892 to 1918, serving as chairman from 1897 to 1905.\nHe was also a governor of Canterbury College( now University of Canterbury) from 1897 until his death.\nHe was the first secretary of the Canterbury Baptist Association, and later its president.\nAdams died at Greendale on 1 June 1919 and was buried there.\nHis will left £ 2000 and of land to Canterbury College to be used for a school of forestry.\nHarriet died 15 January 1934 and was buried with him.\nThe school of forestry opened in 1924, and about 1975 a T.W. Adams Scholarship was set up to support postgraduate forestry students."
    ]
  },
  {
    "query": "Are Simonds Catholic College and Saginaw High School (Texas) both located in the same country?",
    "gold_answer": "no",
    "generated_answer": "USA",
    "retrieved_passages": [
      "John Paul II Catholic High School (Schertz, Texas)\nJohn Paul II High School is a private Roman Catholic college preparatory high school in Schertz, Texas.\nIt is operated by the Roman Catholic Archdiocese of San Antonio.",
      "St. Joseph High School (Victoria, Texas)\nSt. Joseph High School is a co-educational, private Roman Catholic college preparatory high school in Victoria, Texas, USA.\nIt is located in the Roman Catholic Diocese of Victoria in Texas.",
      "Simonds Catholic College\nSimonds Catholic College is a Roman Catholic school for boys located in Melbourne.\nThe school consists of two campuses.\nThe St Mary's campus( years 7- 10) is in West Melbourne and is within walking distance of the Queen Victoria Market.\nThe St Brigid's campus( Years 11- 12) is in Fitzroy North.\nThe college is an associate member of the Associated Catholic Colleges History Simonds was formed in 1996 through the amalgamation of Cathedral College, East Melbourne and St Mary's Boys School.\nIn 2010, the former St Brigid's Primary School in North Fitzroy was renovated, and a new senior campus of the college was opened there.\nThe school is named after Justin Simonds, the first ever Australian born Archbishop who served as Archbishop of Melbourne from 1963- 67.\nHe also served as parish priest of St Mary ’s where the Years 7- 10 campus is located.\nHouses Students at Simonds are placed into houses at the start of commencement of year 7 and remain in the same house until Graduation.\nThe schools houses are Goold, Knox, Manix, Polding.\nEach house is named after a previous Archbishop of Melbourne\nThroughout the year students are awarded points for their houses through house sports, co-curriculum activities, academic performance and many more ways.\nThe main house competitions are the Swimming Carnival and the Athletics Carnival.\nBoth held in term 1.\nHigh performing students in these events are selected to represent the school in the Associated Catholic Colleges Swimming and Athletics Championships",
      "Saginaw High School (Texas)\nSaginaw High School opened in 2005 as the second high school serving the Eagle Mountain- Saginaw Independent School District( EMS- ISD).\nIt is a 5- A school located in Saginaw, Texas, United States.\nThe mascot is the Rough Rider, and the school colors are cardinal red and Las Vegas gold.\nThe principal is Karen Pressley.\nEnrollment is just shy of 2,000 students.",
      "DeSales High School (Louisville, Kentucky)\nDeSales High School is a private, Roman Catholic, college- preparatory school for boys in Louisville, Kentucky, United States.\nIt was established in 1956 and is located in the Roman Catholic Archdiocese of Louisville.",
      "Saginaw High School\nSaginaw High School( part of the Saginaw City School District) is located in Saginaw, Michigan, USA.\nThe student enrollment is 593 students.\nThe school's mission statement is\" Saginaw High is committed to ensuring a safe and academic environment where the students will become academically proficient, life long learners, and productive citizens.\"",
      "Holy Family High School (Broomfield, Colorado)\nHoly Family High School in Broomfield, Colorado, is a Roman Catholic college- preparatory high school located in the technology corridor between Denver and Boulder.\nThe school is operated under the auspices of the Roman Catholic Archdiocese of Denver.",
      "DeLaSalle High School (Minneapolis)\nDeLaSalle High School is a Catholic, college preparatory high school in Minneapolis, Minnesota.\nIt is located on Nicollet Island.",
      "Castleberry High School\nCastleberry High School is a public high school in Fort Worth, Texas.\nIt administers grades 9- 12 and is part of the Castleberry Independent School District.\nTheir rival is Lake Worth High School( Texas).",
      "Nazareth Academy (La Grange Park, Illinois)\nNazareth Academy is a Roman Catholic college- preparatory high school located in LaGrange Park, Illinois, United States, in the Roman Catholic Archdiocese of Chicago.\nIt was founded in 1900 by the Sisters of St. Joseph."
    ],
    "gold_passages": [
      "Saginaw High School (Texas)\nSaginaw High School opened in 2005 as the second high school serving the Eagle Mountain- Saginaw Independent School District( EMS- ISD).\nIt is a 5- A school located in Saginaw, Texas, United States.\nThe mascot is the Rough Rider, and the school colors are cardinal red and Las Vegas gold.\nThe principal is Karen Pressley.\nEnrollment is just shy of 2,000 students.",
      "Simonds Catholic College\nSimonds Catholic College is a Roman Catholic school for boys located in Melbourne.\nThe school consists of two campuses.\nThe St Mary's campus( years 7- 10) is in West Melbourne and is within walking distance of the Queen Victoria Market.\nThe St Brigid's campus( Years 11- 12) is in Fitzroy North.\nThe college is an associate member of the Associated Catholic Colleges History Simonds was formed in 1996 through the amalgamation of Cathedral College, East Melbourne and St Mary's Boys School.\nIn 2010, the former St Brigid's Primary School in North Fitzroy was renovated, and a new senior campus of the college was opened there.\nThe school is named after Justin Simonds, the first ever Australian born Archbishop who served as Archbishop of Melbourne from 1963- 67.\nHe also served as parish priest of St Mary ’s where the Years 7- 10 campus is located.\nHouses Students at Simonds are placed into houses at the start of commencement of year 7 and remain in the same house until Graduation.\nThe schools houses are Goold, Knox, Manix, Polding.\nEach house is named after a previous Archbishop of Melbourne\nThroughout the year students are awarded points for their houses through house sports, co-curriculum activities, academic performance and many more ways.\nThe main house competitions are the Swimming Carnival and the Athletics Carnival.\nBoth held in term 1.\nHigh performing students in these events are selected to represent the school in the Associated Catholic Colleges Swimming and Athletics Championships"
    ]
  },
  {
    "query": "Which country Prince Nikolaus Wilhelm Of Nassau's mother is from?",
    "gold_answer": "German",
    "generated_answer": "Württemberg",
    "retrieved_passages": [
      "Prince Nikolaus Wilhelm of Nassau\nPrince Nikolaus Wilhelm of Nassau (20 September 1832 – 17 September 1905), was the only son of William, Duke of Nassau by his second wife Princess Pauline of Württemberg.",
      "Adolf of Nassau (1540–1568)\nAdolf of Nassau (Dillenburg, 11 July 1540 – Heiligerlee, 23 May 1568) was a count of Nassau, also known as Adolphus of Nassau.\nHe was the fourth son and sixth child of William I, Count of Nassau-Dillenburg and Juliana of Stolberg.\nHe was the second youngest brother of William the Silent.",
      "Otto I, Count of Nassau\nOtto I of Nassau,( † between 3 May 1289 and 19 March 1290) was Count of Nassau and is the ancestor of the Ottonian branch of the House of Nassau.",
      "Frederick Augustus, Duke of Nassau\nFriedrich August, Duke of Nassau, Prince of Nassau- Usingen( 23 April 1738 in Usingen – 24 March 1816 in Wiesbaden) was the last Prince of Nassau- Usingen and, jointly with his cousin, Friedrich Wilhelm of Nassau- Weilburg, first Duke of Nassau.\nHe died without surviving male issue and was succeeded by his cousin's son, Wilhelm.",
      "Frederick William, Prince of Nassau-Weilburg\nFrederick William, Prince of Nassau- Weilburg( 25 October 1768, The Hague – 9 January 1816, Weilburg) was a ruler of Nassau- Weilburg.\nIn 1806 he was given the title of Prince of Nassau, while his cousin, Prince Frederick Augustus of Nassau- Usingen, became the Duke of Nassau.\nFrederick William died in January 1816, only two months before his cousin.\nBoth men were succeeded by Frederick William's son, William.",
      "Sophie of Merenberg\nCountess Sophie Nikolaievna of Merenberg, Countess de Torby( 1 June 1868 – 14 September 1927), also known as\" Countess Torbay\", was the elder daughter of Prince Nikolaus Wilhelm of Nassau and his morganatic wife, Natalia Alexandrovna Pushkina( who had been granted the title of Countess of Merenberg).",
      "Nikolaus, Hereditary Grand Duke of Oldenburg\nNikolaus, Hereditary Grand Duke of Oldenburg( 10 August 18973 April 1970) was the eldest son of Frederick Augustus II, Grand Duke of Oldenburg, who was the last ruling Grand Duke of Oldenburg.\nIn 1931, Nikolaus succeeded to his father's titles and assumed the role of pretender to the Grand Duchy, until his death in 1970.",
      "Diana Guardato\nDiana Guardato was a member of the aristocratic Patrician Guardato family, and had three children with King Ferdinand I: Diana Guardato is the 16th- Great Grandmother of His Royal Highness Albert II of Belgium, 15th- Great Grandmother of His Majesty Juan Carlos\nI of Spain, 17th- Great Grandmother of Philippe of Belgium, 14th- Great Grandmother of His Majesty Manuel II of Portugal, 16th- Great Grandmother of Grand Duke Henri, as well as many others.",
      "Elisabeth of Nassau-Dillenburg, Countess of Wied\nElisabeth of Nassau-Dillenburg (1 December 1488 – 3 June 1559 in Dillenburg) was a member of the House of Nassau.\nShe was a daughter of John V of Nassau-Dillenburg and his wife Elisabeth of Hesse-Marburg.\nHer brothers were Henry III of Nassau-Breda, John of Nassau-Vianden-Dietz, Ernest of Nassau and William the Rich.\nHer sister was Maria of Nassau.",
      "Catherine of Pomerania, Countess Palatine of Neumarkt\nCatherine of Pomerania\n(German: \"\nKatharina von Pommern\"; c. 1390 - 4 March 1426), was a Pomeranian princess and Countess Palatine of Neumarkt.\nShe was the wife of John, Count Palatine of Neumarkt and the mother of Christopher of Bavaria, who would rule over Denmark, Sweden, and Norway as king of the Kalmar Union."
    ],
    "gold_passages": [
      "Prince Nikolaus Wilhelm of Nassau\nPrince Nikolaus Wilhelm of Nassau (20 September 1832 – 17 September 1905), was the only son of William, Duke of Nassau by his second wife Princess Pauline of Württemberg.",
      "Princess Pauline of Württemberg (1810–1856)\nPrincess \"Pauline\" Friederike Marie of Württemberg, full German name: \"Pauline Friederike Marie, Prinzessin von Württemberg\" (25 February 1810, Stuttgart, Kingdom of Württemberg – 7 July 1856, Wiesbaden, Duchy of Nassau) was a member of the House of Württemberg and a Princess of Württemberg by birth.\nThrough her marriage to William, Duke of Nassau, Louise was also a Duchess consort of Nassau.\nPauline is an ancestress of the present Belgian, Danish, Dutch, Luxembourg, Norwegian, and Swedish Royal families."
    ]
  },
  {
    "query": "Which film whose director was born first, 45 Fathers or The Intended?",
    "gold_answer": "45 Fathers",
    "generated_answer": "45 Fathers",
    "retrieved_passages": [
      "45 Fathers\n45 Fathers is a 1937 American comedy film directed by James Tinling, written by Frances Hyland and Albert Ray, and starring Jane Withers, Thomas Beck, Louise Henry, Richard Carle, Nella Walker and Andrew Tombes.\nIt was released on November 26, 1937, by 20th Century Fox.",
      "William C. McGann\nWilliam C. McGann( April 15, 1893 – November 15, 1977) was an American film director.\nHe directed 52 films between 1930 and 1942.\nHe was born in Pittsburgh, Pennsylvania and died in Los Angeles, California.",
      "Carl Boese\nCarl Boese( 26 August 1887 – 6 July 1958) was a German film director, screenwriter and producer.\nHe directed 158 films between 1917 and 1957.",
      "Lew Landers\nLew Landers( born Louis Friedlander, January 2, 1901 – December 16, 1962) was an American independent film and television director.",
      "When Were You Born\nWhen Were You Born is a 1938 murder mystery film directed by William C. McGann and starring Anna May Wong as an astrologer who helps the police.\nEach of the twelve principal characters was born under a different astrological sign.",
      "Charles Saunders (director)\nCharles Joel Saunders (8 April 1904 – April 1997) was an English film director and screenwriter who started in the industry as a film editor, and who also contributed to television.\nHe was the brother of the theatrical producer Sir Peter Saunders.",
      "David Eady (film director)\nDavid Eady( April 22, 1924- April 5, 2009) was a British film director and producer.\nHe was born in London.",
      "All in the Family (film)\nAll in the Family is a 1975 Hong Kong adult comedy film, directed by Mu Zhu and produced under Golden Harvest productions.\nDespite starring in the film, Jackie Chan does not appear until 1 hour into the movie.",
      "The Intended\nThe Intended is 2002 English- language period drama film directed by Kristian Levring and starring Janet McTeer( who also co-wrote the screenplay), JJ Feild, Olympia Dukakis, Tony Maudsley and Brenda Fricker.\nIt centres on a surveyor and his fiancée who arrive in a remote Malaysian trading post and encounter a close- fisted ivory trader and her ill- meaning family.",
      "Mieczysław Krawicz\nMieczysław Krawicz( 1893–1944) was a Polish film director from Warsaw."
    ],
    "gold_passages": [
      "James Tinling\nJames Tinling( May 8, 1889 in Seattle – May 14, 1967 in Los Angeles) was an American film director.\nHe worked during the silent period as a prop boy and stuntman, and directed primarily for 20th Century Fox in the 1930s and 1940s.\nHe has been cited as one of the best B-film directors for Fox, known for directing numerous westerns and lighthearted films, including\" Charlie Chan in Shanghai\"( 1935).",
      "The Intended\nThe Intended is 2002 English- language period drama film directed by Kristian Levring and starring Janet McTeer( who also co-wrote the screenplay), JJ Feild, Olympia Dukakis, Tony Maudsley and Brenda Fricker.\nIt centres on a surveyor and his fiancée who arrive in a remote Malaysian trading post and encounter a close- fisted ivory trader and her ill- meaning family.",
      "45 Fathers\n45 Fathers is a 1937 American comedy film directed by James Tinling, written by Frances Hyland and Albert Ray, and starring Jane Withers, Thomas Beck, Louise Henry, Richard Carle, Nella Walker and Andrew Tombes.\nIt was released on November 26, 1937, by 20th Century Fox.",
      "Kristian Levring\nKristian Levring( born May 9, 1957) is a Danish film director.\nHe was the fourth signatory of the Dogme95 movement.\nHis feature films as director include\" Et skud fra hjertet The King is Alive The Intended Fear Me Not\", and\" The Salvation\"."
    ]
  },
  {
    "query": "Who is the paternal grandfather of Alexandre Berthier, 3Rd Prince Of Wagram?",
    "gold_answer": "Louis-Alexandre Berthier",
    "generated_answer": "Louis Alexandre Berthier",
    "retrieved_passages": [
      "Alexandre Berthier, 3rd Prince of Wagram\nLouis Philippe Marie \"Alexandre\" Berthier, 3rd Prince of Wagram (24 March 1836, Paris – 15 July 1911, Château de Grosbois) was a French nobleman and prince of Wagram.\nHe was the son of Napoléon Alexandre Berthier and Zénaïde Françoise Clary and grandson of Louis Alexandre Berthier.",
      "Napoléon Alexandre Berthier, 2nd Prince of Wagram\nNapoléon Alexandre Louis Joseph Berthier, 2nd Prince of Wagram (11 September 1810, Paris10 February 1887, Paris) was a French politician and nobleman.\nSon of Louis-Alexandre Berthier, 1st Prince of Wagram, and Duchess Maria Elisabeth in Bavaria (and by his mother, grandnephew of King Maximilian I of Bavaria).",
      "Alexandre Louis Philippe Marie Berthier, 4th Prince of Wagram\nAlexandre Louis Philippe Marie Berthier( July 20, 1883, Paris – May 30, 1918, Barenton- sur- Serre; 4th Prince de Wagram) was the son of Bertha Clara von Rothschild of the German branch of the prominent Rothschild family and Louis Philippe Marie Alexandre Berthier, 3rd Prince de Wagram( 1836 – 1911).\nThe family resided in the ancestral home, the Château de Grosbois, a large estate in Boissy- Saint- Léger, southeast of Paris.\nAlexandre Berthier was an active collector of impressionist paintings and owned works by Gustave Courbet, Édouard Manet, Claude Monet, and Pierre- Auguste Renoir.\nThrough a relationship with Marie- Louise Salivas dite Welson, he had a daughter, Monique Berthier de Wagram( 1914–2000).\nAlexandre Berthier had not yet married when he was killed in action at Barenton- sur- Cere during World War I.\nAs such, the title became extinct.\nHis daughter, though married three times( to two men), had no children, and so Alexander Berthier has no living descendants.",
      "Louis-Alexandre Berthier\nLouis- Alexandre Berthier( 20 November 1753 – 1 June 1815), 1st Prince of Wagram, Sovereign Prince of Neuchâtel, was a French Marshal and Vice- Constable of the Empire, and Chief of Staff under Napoleon.",
      "Guillaume Wittouck\nGuillaume Wittouck( 1749- 1829) was a Belgian lawyer and High Magistrate.\nHe was the Grandfather of industrialist Paul Wittouck.",
      "Prince Philippe, Count of Paris\nPrince Philippe of Orléans, Count of Paris( Louis Philippe Albert; 24 August 1838 – 8 September 1894), was the grandson of Louis Philippe I, King of the French.\nHe was the Count of Paris as Orléanist claimant to the French throne from 1848 until his death.",
      "Charles Bretagne Marie de La Trémoille\nPrince Charles Bretagne Marie de La Trémoille (24 March 1764 – 10 November 1839), 8th Duke of Thouars, 7th Duke of La Trémoïlle, 10th prince de Tarente, 14th prince de Talmond and 14th Count of Laval, was a French aristocrat and soldier; he was the son of Jean Bretagne Charles de La Trémoille and his wife Princess Marie-Maximilienne of Salm-Kyrburg.",
      "Jean Bretagne Charles de La Trémoille\nPrince Jean-Bretagne-Charles de La Trémoille (5 February 1737 – 19 May 1792), 7th Duke of Thouars, was a French soldier and the son of Charles Armand René de La Trémoille and his wife, Marie Hortense de La Tour d'Auvergne of Bouillon.",
      "Louis Charles de La Trémoille\nPrince Louis Charles de La Trémoille( 26 October 1838 – 4 July 1911), 9th Duke of Thouars, 8th Duke of La Trémoïlle, 11th prince de Tarente, 15th prince de Talmond and 15th Count of Laval was a French aristocrat and the son of Charles Bretagne Marie de La Trémoille and his third wife, Valentine Eugénie Joséphine Walsh de Serrant.\nLouis Charles was also an archivist, bibliophile and also collector.",
      "Louis Philippe, Crown Prince of Belgium\nLouis- Philippe, Crown Prince of Belgium( Louis Philippe Léopold Victor Ernest; 24 July 1833 – 16 May 1834), was the eldest child and heir- apparent of King Leopold I of the Belgians and his second wife, Princess Louise d'Orléans."
    ],
    "gold_passages": [
      "Napoléon Alexandre Berthier, 2nd Prince of Wagram\nNapoléon Alexandre Louis Joseph Berthier, 2nd Prince of Wagram (11 September 1810, Paris10 February 1887, Paris) was a French politician and nobleman.\nSon of Louis-Alexandre Berthier, 1st Prince of Wagram, and Duchess Maria Elisabeth in Bavaria (and by his mother, grandnephew of King Maximilian I of Bavaria).",
      "Alexandre Berthier, 3rd Prince of Wagram\nLouis Philippe Marie \"Alexandre\" Berthier, 3rd Prince of Wagram (24 March 1836, Paris – 15 July 1911, Château de Grosbois) was a French nobleman and prince of Wagram.\nHe was the son of Napoléon Alexandre Berthier and Zénaïde Françoise Clary and grandson of Louis Alexandre Berthier."
    ]
  },
  {
    "query": "Where was the husband of Caterina Visconti born?",
    "gold_answer": "Pavia",
    "generated_answer": "Forl",
    "retrieved_passages": [
      "Caterina Visconti\nCaterina Visconti (1361 – 17 October 1404) was Duchess of Milan as the second spouse of Gian Galeazzo Visconti, the first Duke of Milan, and was the mother of two succeeding Dukes of Milan, Gian Maria and Filippo Maria Visconti.\nCaterina served as Regent of Milan from 1402 to 1404, during her elder son's minority, but due to Gian Maria's suspicion of her alleged treason (planted in his mind by her enemy, the condottiero Facino Cane), he had his mother arrested and imprisoned in the castle of Monza, where she was presumably poisoned in 1404.",
      "Giacomo Feo\nGiacomo Feo( c. 1471 – 27 August 1495), was the second husband of Caterina Sforza, Countess of Forlì.\nHe was born and died in Forlì.",
      "Mario Visconti\nMario Visconti( born 23 October 1968) is a former professional tennis player from Italy.",
      "Giovanni Visconti (cyclist)\nGiovanni Visconti( born 13 January 1983) is an Italian professional road racing cyclist, who currently rides for UCI Professional Continental team.",
      "Pietro Visconti\nPietro Visconti( born 24 May 1989) is an Italian football player who plays for Novara.",
      "Obata Toramori\nHe was the father of Obata Masamori.",
      "Cornelia (wife of Caesar)\nCornelia (c. 97 – c. 69 BC) was the first or second wife of Caesar, and the mother of his only daughter, Julia.\nA daughter of Lucius Cornelius Cinna, Cornelia was related by birth or marriage to many of the most influential figures of the late Republic.",
      "Catherine of Pomerania, Countess Palatine of Neumarkt\nCatherine of Pomerania\n(German: \"\nKatharina von Pommern\"; c. 1390 - 4 March 1426), was a Pomeranian princess and Countess Palatine of Neumarkt.\nShe was the wife of John, Count Palatine of Neumarkt and the mother of Christopher of Bavaria, who would rule over Denmark, Sweden, and Norway as king of the Kalmar Union.",
      "Maria Teresa, Grand Duchess of Luxembourg\nMaria Teresa, Grand Duchess of Luxembourg( born María Teresa Mestre y Batista; on 22 March 1956), is the spouse of Grand Duke Henri.",
      "Julia (daughter of Caesar)\nJulia (c. 76 BC – 54 BC) was the daughter of Roman dictator Julius Caesar by his first or second wife Cornelia, and his only child from his marriages.\nJulia became the fourth wife of Pompey the Great and was renowned for her beauty and virtue."
    ],
    "gold_passages": [
      "Gian Galeazzo Visconti\nGian Galeazzo Visconti (16 October 1351 – 3 September 1402), son of Galeazzo II Visconti and Bianca of Savoy, was the first Duke of Milan (1395) and ruled the late-medieval city just before the dawn of the Renaissance.\nHe was the founding patron of the Certosa di Pavia, completing the Visconti Castle at Pavia begun by his father and furthering work on the Duomo of Milan.",
      "Caterina Visconti\nCaterina Visconti (1361 – 17 October 1404) was Duchess of Milan as the second spouse of Gian Galeazzo Visconti, the first Duke of Milan, and was the mother of two succeeding Dukes of Milan, Gian Maria and Filippo Maria Visconti.\nCaterina served as Regent of Milan from 1402 to 1404, during her elder son's minority, but due to Gian Maria's suspicion of her alleged treason (planted in his mind by her enemy, the condottiero Facino Cane), he had his mother arrested and imprisoned in the castle of Monza, where she was presumably poisoned in 1404."
    ]
  },
  {
    "query": "Which film has the director who was born later, A Quiet Place In The Country or When Were You Born?",
    "gold_answer": "A Quiet Place In The Country",
    "generated_answer": "When Were You Born",
    "retrieved_passages": [
      "When Were You Born\nWhen Were You Born is a 1938 murder mystery film directed by William C. McGann and starring Anna May Wong as an astrologer who helps the police.\nEach of the twelve principal characters was born under a different astrological sign.",
      "William C. McGann\nWilliam C. McGann( April 15, 1893 – November 15, 1977) was an American film director.\nHe directed 52 films between 1930 and 1942.\nHe was born in Pittsburgh, Pennsylvania and died in Los Angeles, California.",
      "Lew Landers\nLew Landers( born Louis Friedlander, January 2, 1901 – December 16, 1962) was an American independent film and television director.",
      "A Quiet Place in the Country\nA Quiet Place in the Country is a 1968 giallo thriller film directed by Elio Petri, and starring Franco Nero and Vanessa Redgrave.\nBased on the short story\" The Beckoning Fair One\" by Oliver Onions, its plot follows an artist who relocates to a rural villa with his girlfriend, where he begins to experience increasingly terrifying, apparently supernatural events.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Mieczysław Krawicz\nMieczysław Krawicz( 1893–1944) was a Polish film director from Warsaw.",
      "David Eady (film director)\nDavid Eady( April 22, 1924- April 5, 2009) was a British film director and producer.\nHe was born in London.",
      "Carl Boese\nCarl Boese( 26 August 1887 – 6 July 1958) was a German film director, screenwriter and producer.\nHe directed 158 films between 1917 and 1957."
    ],
    "gold_passages": [
      "A Quiet Place in the Country\nA Quiet Place in the Country is a 1968 giallo thriller film directed by Elio Petri, and starring Franco Nero and Vanessa Redgrave.\nBased on the short story\" The Beckoning Fair One\" by Oliver Onions, its plot follows an artist who relocates to a rural villa with his girlfriend, where he begins to experience increasingly terrifying, apparently supernatural events.",
      "When Were You Born\nWhen Were You Born is a 1938 murder mystery film directed by William C. McGann and starring Anna May Wong as an astrologer who helps the police.\nEach of the twelve principal characters was born under a different astrological sign.",
      "William C. McGann\nWilliam C. McGann( April 15, 1893 – November 15, 1977) was an American film director.\nHe directed 52 films between 1930 and 1942.\nHe was born in Pittsburgh, Pennsylvania and died in Los Angeles, California.",
      "Elio Petri\nElio Petri( 29 January 1929 – 10 November 1982) was an Italian political filmmaker best known for the 1970 Academy Award- winning film\" Investigation of a Citizen Above Suspicion\"."
    ]
  },
  {
    "query": "Who was born first, John Beach or Gordon Persons?",
    "gold_answer": "John Beach",
    "generated_answer": "Nelson J. Beach",
    "retrieved_passages": [
      "Nelson J. Beach\nNelson John Beach( September 21, 1800 Hebron, Tolland County, Connecticut- February 22, 1876 Watson, Lewis County, New York) was an American surveyor, businessman and politician from New York.",
      "John Litel\nJohn Beach Litel( December 30, 1892 – February 3, 1972) was an American film and television actor.",
      "Gordon Persons\nSeth Gordon Persons( February 5, 1902 – May 29, 1965) was an American Democratic politician who was the 43rd Governor of Alabama from 1951 to 1955.\nHe was born and died in Montgomery, Alabama.\nThe Dauphin Island Bridge south of Mobile is formally named for him.\nThe Gordon Persons Building is a six floor, 60,000 square foot state government office building in Montgomery.\nPersons built a successful business running electrical lines in rural Alabama( benefiting from Rural Electrification Administration contracts); in addition to financial gain, he also won considerable popularity.\nWhen running for office in 1950, Persons gained notoriety by touring the state in a helicopter( prompting one opponent to dub him\" the man from Mars\").\nHe won the Democratic nomination by defeating a crowded field that included former governor Chauncey Sparks.\nIn office, his notable accomplishments included abolishing flogging in Alabama's prisons, advocating for the establishment of Alabama Public Television, and imposing speed limits on state highways.\nPersons largely accomplished his goal of having four years of\" no fighting,\" maintaining a truce among the various wings of the state Democratic Party.\nAt the end of his term, Persons ordered the National Guard into Phenix City following the assassination of Attorney- General- elect Albert Patterson.\nAfter leaving office as governor, Persons never sought statewide public office again, although he did make an unsuccessful run for circuit judge late in life.\nPersons was an alumnus of Auburn University, though he attended for only one year.\nWhile at Auburn, Persons served as president of a student organization( known as the\" Boxcar Reds and Boxcar Blacks\") that traveled to away football games.",
      "Thomas Scott (diver)\nThomas Scott( 1907- date of death unknown) was an English diver.",
      "John Westley\nRev. John Westley( 1636 – 78) was an English nonconformist minister.\nHe was the grandfather of John Wesley( founder of Methodism).",
      "John Beach\nMajor John Beach( January 1, 1812 – August 31, 1874) was a United States Army officer during the Black Hawk and American Civil War.\nHe was the last U.S. Indian Agent to the Sac and Fox tribes.\nA so n-in-law to General Joseph Street, Beach succeeded him as agent to the Sac and Fox upon Street's death, and he eventually hosted the week- long council that resulted in the signing of the treaty for the purchase of much of Iowa from the Sac and Fox Indians in October 1842.",
      "George William Patchett\nGeorge William Patchett was a British motorcycle racer and engineer.",
      "John Middleton Murry Jr.\nJohn Middleton Murry Jr. (9 May 1926 – 31 March 2002) was an English writer who used the names Colin Murry and Richard Cowper.",
      "Harry Johnson (wrestler)\nHarry Johnson( 1903- date of death unknown) was an English wrestler.",
      "John Middleton (footballer, born 1955)\nJohn Middleton( born 11 July 1955) is an English former footballer who played for Bradford City and Macclesfield Town.\nHe was born in Rawmarsh, near Rotherham."
    ],
    "gold_passages": [
      "Gordon Persons\nSeth Gordon Persons( February 5, 1902 – May 29, 1965) was an American Democratic politician who was the 43rd Governor of Alabama from 1951 to 1955.\nHe was born and died in Montgomery, Alabama.\nThe Dauphin Island Bridge south of Mobile is formally named for him.\nThe Gordon Persons Building is a six floor, 60,000 square foot state government office building in Montgomery.\nPersons built a successful business running electrical lines in rural Alabama( benefiting from Rural Electrification Administration contracts); in addition to financial gain, he also won considerable popularity.\nWhen running for office in 1950, Persons gained notoriety by touring the state in a helicopter( prompting one opponent to dub him\" the man from Mars\").\nHe won the Democratic nomination by defeating a crowded field that included former governor Chauncey Sparks.\nIn office, his notable accomplishments included abolishing flogging in Alabama's prisons, advocating for the establishment of Alabama Public Television, and imposing speed limits on state highways.\nPersons largely accomplished his goal of having four years of\" no fighting,\" maintaining a truce among the various wings of the state Democratic Party.\nAt the end of his term, Persons ordered the National Guard into Phenix City following the assassination of Attorney- General- elect Albert Patterson.\nAfter leaving office as governor, Persons never sought statewide public office again, although he did make an unsuccessful run for circuit judge late in life.\nPersons was an alumnus of Auburn University, though he attended for only one year.\nWhile at Auburn, Persons served as president of a student organization( known as the\" Boxcar Reds and Boxcar Blacks\") that traveled to away football games.",
      "John Beach\nMajor John Beach( January 1, 1812 – August 31, 1874) was a United States Army officer during the Black Hawk and American Civil War.\nHe was the last U.S. Indian Agent to the Sac and Fox tribes.\nA so n-in-law to General Joseph Street, Beach succeeded him as agent to the Sac and Fox upon Street's death, and he eventually hosted the week- long council that resulted in the signing of the treaty for the purchase of much of Iowa from the Sac and Fox Indians in October 1842."
    ]
  },
  {
    "query": "Which film has the director born earlier, The House By The Cemetery or Charlie Chan In Honolulu?",
    "gold_answer": "Charlie Chan In Honolulu",
    "generated_answer": "Charlie Chan in Honolulu",
    "retrieved_passages": [
      "Charlie Chan in Honolulu\nCharlie Chan in Honolulu is a 1939 American film directed by H. Bruce Humberstone, starring Sidney Toler as the fictional Chinese- American detective Charlie Chan.\nThe film is the first appearance of both Toler as Chan and Victor Sen Yung as\" number two son\" Jimmy.",
      "James Tinling\nJames Tinling( May 8, 1889 in Seattle – May 14, 1967 in Los Angeles) was an American film director.\nHe worked during the silent period as a prop boy and stuntman, and directed primarily for 20th Century Fox in the 1930s and 1940s.\nHe has been cited as one of the best B-film directors for Fox, known for directing numerous westerns and lighthearted films, including\" Charlie Chan in Shanghai\"( 1935).",
      "William C. McGann\nWilliam C. McGann( April 15, 1893 – November 15, 1977) was an American film director.\nHe directed 52 films between 1930 and 1942.\nHe was born in Pittsburgh, Pennsylvania and died in Los Angeles, California.",
      "Charlie Chan in Shanghai\nCharlie Chan in Shanghai is the ninth Charlie Chan film produced by Fox Film Corporation with the title character played by Warner Oland.",
      "The Golden Eye\nThe Golden Eye is a 1948 American film directed by William Beaudine and starring Roland Winters in his fourth appearance as Charlie Chan.\nThe film is also known as Charlie Chan in Texas( Belgian English title) and Charlie Chan in the Golden Eye( American poster title).",
      "When Were You Born\nWhen Were You Born is a 1938 murder mystery film directed by William C. McGann and starring Anna May Wong as an astrologer who helps the police.\nEach of the twelve principal characters was born under a different astrological sign.",
      "Gu Changwei\nGu Changwei (born 12 December 1957) is a Chinese cinematographer and film director.\nGu was born in Xi'an, Shaanxi in the People's Republic of China.\nGu is considered one of the major Chinese cinematographers working today.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris."
    ],
    "gold_passages": [
      "Lucio Fulci\nLucio Fulci( 17 June 1927 – 13 March 1996) was an Italian film director, screenwriter, producer, and actor.\nAlthough he worked in a wide array of genres through a career spanning nearly five decades, including comedy, spaghetti western, adventure, science fiction and erotica, he garnered an international cult following for his giallo and horror films.\nHis most notable films include the\" Gates of Hell\" trilogy —\" City of the Living Dead\"( 1980),\" The Beyond\"( 1981), and\" The House by the Cemetery\"( 1981) —as well as\" Massacre Time\"( 1966),\" One on Top of the Other\"( 1969),\" A Lizard in a Woman's Skin\"( 1971),\" Do n't Torture a Duckling\"( 1972),\" White Fang\"( 1973),\" Four of the Apocalypse\"( 1975),\" Sette note in nero\"( 1977),\" Zombi 2\"( 1979),\" Contraband\"( 1980),\" The Black Cat\"( 1981),\" The New York Ripper\"( 1982),\" Murder Rock\"( 1984), and\" A Cat in the Brain\"( 1990).\nBecause of the high level of visceral graphic violence present in many of his films, especially\" Zombi 2\" and\" The Beyond\", Fulci is frequently referred to as\" The Godfather of Gore\", a title also given to Herschell Gordon Lewis.\nFulci was in his young adult years a politically active radical for the Italian Communist Party.",
      "Charlie Chan in Honolulu\nCharlie Chan in Honolulu is a 1939 American film directed by H. Bruce Humberstone, starring Sidney Toler as the fictional Chinese- American detective Charlie Chan.\nThe film is the first appearance of both Toler as Chan and Victor Sen Yung as\" number two son\" Jimmy.",
      "H. Bruce Humberstone\nH. Bruce\" Lucky\" Humberstone( November 18, 1901 – October 11, 1984) was a movie actor( as a child), a script clerk, an assistant director, working with directors such as King Vidor, Edmund Goulding and Allan Dwan and, ultimately, a director.",
      "The House by the Cemetery\nThe House by the Cemetery is a 1981 Italian horror film directed by Lucio Fulci.\nThe film stars Catriona MacColl, Paolo Malco, Ania Pieroni, Giovanni Frezza, Silvia Collatina and Dagmar Lassander.\nIt s plot revolves around a series of murders taking place in a New England home – a home which happens to be hiding a gruesome secret within its basement walls."
    ]
  },
  {
    "query": "Who is the child of the director of film La Leona (Film)?",
    "gold_answer": "Víctor Bó",
    "generated_answer": "Isabel Sarli",
    "retrieved_passages": [
      "La Leona (film)\nLa Leona is a 1964 Argentine film directed by and starring Armando Bo with Isabel Sarli.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "Claude Weisz\nClaude Weisz is a French film director born in Paris.",
      "El extraño caso de la mujer asesinada\nEl Extraño caso de la mujer asesinada is a 1949 Argentine film.",
      "Crimen a las tres\nCrimen a las tres is a Argentine crime film directed and written by Luis Saslavsky.",
      "Armando Bó\nArmando Bó (3 May 1914 – 8 October 1981) was an Argentine film actor, director, producer, screenwriter and score composer of the classic era.\nHe is mostly known for his sexploitation films in the 1960s and 1970s starring his favorite actress and romantic partner, sex symbol Isabel Sarli.\nHis works include the first nude scene in an Argentine film (\"El trueno entre las hojas\").\nBó's son is the actor Víctor Bó and his grandson\nis the screenwriter Armando Bó.",
      "Luis Saslavsky\nLuis Saslavsky( April 21, 1903 – March 20, 1995) was an Argentine film director, screenwriter and film producer, and one of the influential directors in the Cinema of Argentina of the classic era.\nHe was Jewish.\nSaskavsky was born in Rosario, Santa Fe, Argentina.\nHe directed and wrote over 40 films between 1931 and 1979.\nHe directed films such as Crimen a las tres in 1935 and wrote for films such as Allá en el Norte in 1973.\nHe retired from the industry in 1979.\nHe died in Buenos Aires, aged 91.",
      "Fernando Fernán Gómez\nFernando Fernández Gómez (28 August 1921 – 21 November 2007) better known as Fernando Fernán-Gómez was a Spanish actor, screenwriter, film director, theater director and member of the Royal Spanish Academy for seven years.\nHe was born in Argentina while his mother, Spanish actress Carola Fernán-Gómez, was making a tour in Latin America.\nHe would later use her surname for his stage name when he moved to Spain in 1924.\nAfter the Spanish Civil War he began to study law but interrupted his studies to work in theater.\nIn 1942 he began to act in movies but also continued working on plays.\nHe formed his own theater company and received awards for directing and writing.\nIn the 1950s he began to direct movies, including the film of his novel, \"El viaje a ninguna parte\".\nHe received praise for his 1958 comedy \"La vida por delante\", which led to a sequel, \"La vida alrededor\".\nIn 1977, he won the Silver Bear for Best Actor at the 27th Berlin International Film Festival for his role in \"The Anchorite\".\nHe won the award again at the 35th Berlin International Film Festival in 1985 for his role in \"Stico\" and finally the Honorary Golden Bear at the 55th Berlin International Film Festival in 2005.\nHaving been very much in demand during the 1970s and 1980s, the 1990s was a less active period for him, but towards the end of his life, he enjoyed something of a revival, featuring in three major projects: \"Todo sobre mi madrePlenilunio\", and a starring role in the hit \"La lengua de las mariposas\".\nHe married María Dolores Pradera in 1945; they divorced in 1959.\nHe married Emma Cohen in 2000.\nFernando Fernán Gómez died in Madrid on 21 November 2007 from a heart failure.\nAs he was a lifelong anarchist, his coffin was covered in a black and red anarchist flag.",
      "Dana Blankstein\nDana Blankstein- Cohen( born March 3, 1981) is the director of the Israeli Academy of Film and Television.\nShe is a film director, and an Israeli culture entrepreneur."
    ],
    "gold_passages": [
      "La Leona (film)\nLa Leona is a 1964 Argentine film directed by and starring Armando Bo with Isabel Sarli.",
      "Armando Bó\nArmando Bó (3 May 1914 – 8 October 1981) was an Argentine film actor, director, producer, screenwriter and score composer of the classic era.\nHe is mostly known for his sexploitation films in the 1960s and 1970s starring his favorite actress and romantic partner, sex symbol Isabel Sarli.\nHis works include the first nude scene in an Argentine film (\"El trueno entre las hojas\").\nBó's son is the actor Víctor Bó and his grandson\nis the screenwriter Armando Bó."
    ]
  },
  {
    "query": "Who is Blanche Of Portugal (1259–1321)'s paternal grandmother?",
    "gold_answer": "Urraca of Castile",
    "generated_answer": "Blanche of Castile",
    "retrieved_passages": [
      "Blanche of Portugal (1259–1321)\nBlanche of Portugal (25 February 1259 in Santarém, – 17 April 1321 in Burgos; Branca in Portuguese and Blanca in Spanish), was an \"infanta\", the firstborn child of King Afonso III of Portugal and his second wife Beatrice of Castile.\nNamed after her great-aunt Blanche of Castile, queen of France, Blanche was the Lady of Las Huelgas, Montemor-o-Velho, Alcocer and Briviesca, the city which she founded.",
      "Diana Guardato\nDiana Guardato was a member of the aristocratic Patrician Guardato family, and had three children with King Ferdinand I: Diana Guardato is the 16th- Great Grandmother of His Royal Highness Albert II of Belgium, 15th- Great Grandmother of His Majesty Juan Carlos\nI of Spain, 17th- Great Grandmother of Philippe of Belgium, 14th- Great Grandmother of His Majesty Manuel II of Portugal, 16th- Great Grandmother of Grand Duke Henri, as well as many others.",
      "Marie-Louise Coidavid\nMarie Louise Coidavid( 1778 – March 11, 1851), was the Queen of the Kingdom of Haiti 1811 – 20 as the spouse of Henri I of Haiti.",
      "Marie Charlotte de La Trémoille\nMarie Charlotte de La Trémoille( 26 January 1632 – 24 August 1682). was a French noblewoman member of the House of La Trémoille and by marriage Duchess of Saxe- Jena.\nBorn in Thouars, she was the fifth of six children born from the marriage of Henri III de La Trémoille, 3rd Duke of Thouars, 2nd Duke of La Tremoille, Prince of Talmond and Taranto, and Marie de La Tour d'Auvergne.",
      "Guillaume Wittouck\nGuillaume Wittouck( 1749- 1829) was a Belgian lawyer and High Magistrate.\nHe was the Grandfather of industrialist Paul Wittouck.",
      "Maria Teresa, Grand Duchess of Luxembourg\nMaria Teresa, Grand Duchess of Luxembourg( born María Teresa Mestre y Batista; on 22 March 1956), is the spouse of Grand Duke Henri.",
      "Elisabeth of Nassau-Dillenburg, Countess of Wied\nElisabeth of Nassau-Dillenburg (1 December 1488 – 3 June 1559 in Dillenburg) was a member of the House of Nassau.\nShe was a daughter of John V of Nassau-Dillenburg and his wife Elisabeth of Hesse-Marburg.\nHer brothers were Henry III of Nassau-Breda, John of Nassau-Vianden-Dietz, Ernest of Nassau and William the Rich.\nHer sister was Maria of Nassau.",
      "Robert le Maçon\nRobert le Maçon( c. 1365 – 28 January 1443) was chancellor of France, advisor to Charles VII and supporter of Joan of Arc.",
      "Julia (daughter of Caesar)\nJulia (c. 76 BC – 54 BC) was the daughter of Roman dictator Julius Caesar by his first or second wife Cornelia, and his only child from his marriages.\nJulia became the fourth wife of Pompey the Great and was renowned for her beauty and virtue.",
      "Gertrude of Bavaria\nGertrude of Saxony and Bavaria( 1152/55–1197) was Duchess of Swabia as the spouse of Duke Frederick IV, and Queen of Denmark as the spouse of King Canute VI."
    ],
    "gold_passages": [
      "Afonso III of Portugal\nAfonso III (rare English alternatives: \"Alphonzo\" or \"Alphonse\"), or \"Affonso\" (Archaic Portuguese), \"Alfonso\" or \"Alphonso\" (Portuguese-Galician) or \"Alphonsus\" (Latin), the Boulonnais (Port. \"\no Bolonhês\"), King of Portugal (5 May 121016 February 1279) was the first to use the title \"King of Portugal and the Algarve\", from 1249.\nHe was the second son of King Afonso II of Portugal and his wife, Urraca of Castile; he succeeded his brother, King Sancho II of Portugal, who died on 4 January 1248.",
      "Blanche of Portugal (1259–1321)\nBlanche of Portugal (25 February 1259 in Santarém, – 17 April 1321 in Burgos; Branca in Portuguese and Blanca in Spanish), was an \"infanta\", the firstborn child of King Afonso III of Portugal and his second wife Beatrice of Castile.\nNamed after her great-aunt Blanche of Castile, queen of France, Blanche was the Lady of Las Huelgas, Montemor-o-Velho, Alcocer and Briviesca, the city which she founded."
    ]
  }
]